[
  {
    "id": 5,
    "title": "How India Plans to Redefine Global AI Governance",
    "url": "https://emag.directindustry.com/2025/11/28/india-ai-governance-delhi-summit-global-south/",
    "source": "emag.directindustry.com",
    "description": "A few months before the India AI Impact Summit in Delhi, scheduled for February 19–20, 2026, India is displaying an ambitious vision: turning AI into a lever for social inclusion, digital sovereignty, and international cooperation. Speaking at a conference during the AIM event in Marseille, Sanjeev ...",
    "category": "AI",
    "country": "India",
    "published_date": "2025-11-28"
  },
  {
    "id": 54,
    "title": "Russian Central Bank To Open Representative Office In India",
    "url": "https://russiaspivottoasia.com/russian-central-bank-to-open-representative-office-in-india/",
    "source": "russiaspivottoasia.com",
    "description": "The Central Bank of Russia is to open a representative office in India, the regulator’s press service has stated, saying “The Central Bank of Russia is looking into opening a representative office in Mumbai, India. This would contribute to solidifying interaction between the two countries’ regulator...",
    "category": "Central Bank",
    "country": "India",
    "published_date": "2025-11-28"
  },
  {
    "id": 51,
    "title": "India’s Economic Growth Defies Estimates as Reforms Accelerate",
    "url": "https://www.bloomberg.com/news/newsletters/2025-11-28/india-s-gdp-accelerates-economic-reforms-quicken-despite-us-tariffs",
    "source": "www.bloomberg.com",
    "description": "Welcome to India Edition, Bloomberg’s daily dive into what’s moving the worlds of business, markets and politics in this dynamic, fast-paced economy. If you didn’t receive this directly in your inbox, you can subscribe here, and share feedback with me here.\n\nHello, I am Dan Strumpf, Bloomberg’s seni...",
    "category": "Economy",
    "country": "India",
    "published_date": "2025-11-28"
  },
  {
    "id": 61,
    "title": "India's Economy Growth Outlook Complicated by US Trade Deal Woes",
    "url": "https://www.bloomberg.com/news/articles/2025-11-28/india-s-economic-growth-outlook-muddied-by-us-trade-deal-woes",
    "source": "www.bloomberg.com",
    "description": "Follow Bloomberg India on WhatsApp for exclusive content and analysis on what billionaires, businesses and markets are doing. Sign up here.",
    "category": "Economy",
    "country": "India",
    "published_date": "2025-11-28"
  },
  {
    "id": 79,
    "title": "India’s April-October fiscal deficit widens to ₹8.25 trillion, reaching 52.6% of FY26 target",
    "url": "https://www.livemint.com/economy/india-fiscal-deficit-april-october-government-spending-tax-revenue-rbi-dividend-11764313977256.html",
    "source": "www.livemint.com",
    "description": "India’s fiscal deficit for the April-October period rose on higher capital expenditure and lower net tax revenue.\n\nThe fiscal deficit stood at ₹8.25 trillion, or 52.6% of the 2025-26 budget target, showed data released by the Controller General of Accounts (CGA) on Friday. That compares with ₹7.51 t...",
    "category": "Fiscal Policy",
    "country": "India",
    "published_date": "2025-11-28"
  },
  {
    "id": 38,
    "title": "India economy grows at faster-than-expected 8.2% in September quarter even as tariffs bite",
    "url": "https://www.cnbc.com/2025/11/28/india-economy-gdp-grows-september-quarter-tariffs-bite-trade-us-modi.html",
    "source": "www.cnbc.com",
    "description": "In a quarter partially affected by the 50% U.S. tariffs, the Indian economy grew faster than expected at an annual rate of 8.2% in the quarter ending in September.\n\nThe growth was an acceleration from 7.8% in the previous quarter, when a lower deflator unexpectedly boosted real growth. A deflator me...",
    "category": "GDP",
    "country": "India",
    "published_date": "2025-11-28"
  },
  {
    "id": 40,
    "title": "India growth beats all estimates as factories defy Trump tariffs",
    "url": "https://fortune.com/2025/11/28/india-gdp-growth-beats-all-estimates-manufacturing-trump-tariffs/",
    "source": "fortune.com",
    "description": "India’s economy grew at the fastest pace in six quarters, underscoring its resilience even as US President Donald Trump’s steep tariffs cloud the outlook.\n\nGross domestic product rose 8.2%in the three months through September from a year earlier, the Statistics Ministry said Friday, beating all 38 e...",
    "category": "GDP",
    "country": "India",
    "published_date": "2025-11-28"
  }
]