[
  {
    "id": 1625,
    "title": "China holds lending rates steady, focuses on bank stability amid economic slowdown; PBOC signals caution",
    "url": "https://www.livemint.com/news/world/china-holds-lending-rates-steady-focuses-on-bank-stability-amid-economic-slowdown-pboc-signals-caution-11724122040383.html",
    "source": "www.livemint.com",
    "description": "Chinese banks kept their benchmark lending rates unchanged for August, as profit margins come under pressure and policymakers focus on the health of financial institutions.\n\nThe one-year loan prime rate will stay at 3.35% and the five-year rate, a reference for long-term credit including mortgages, ...",
    "category": "Interest Rates",
    "country": "China",
    "published_date": "2024-08-01"
  },
  {
    "id": 1648,
    "title": "China’s rising youth unemployment breeds new working class",
    "url": "https://www.thehindu.com/news/international/chinas-rising-youth-unemployment-breeds-new-working-class/article68553567.ece",
    "source": "www.thehindu.com",
    "description": "Rising unemployment in China is pushing millions of college graduates into a tough bargain, with some forced to accept low-paying work or even subsist on their parents’ pensions, a plight that has created a new working class of “rotten-tail kids”.\n\nThe phrase has become a social media buzzword this ...",
    "category": "Unemployment",
    "country": "China",
    "published_date": "2024-08-01"
  },
  {
    "id": 1649,
    "title": "China youth unemployment jumps to 17.1% in July",
    "url": "https://www.newindianexpress.com/business/2024/Aug/17/china-youth-unemployment-jumps-to-171-in-july",
    "source": "www.newindianexpress.com",
    "description": "BEIJING: Youth unemployment in China ticked up to 17.1 percent in July, official figures showed, the highest level this year as the world's second-largest economy faces mounting headwinds.\n\nChina is battling soaring joblessness among young people, a heavily indebted property sector and intensifying ...",
    "category": "Unemployment",
    "country": "China",
    "published_date": "2024-08-01"
  }
]