[
  {
    "id": 243,
    "title": "China’s Middle-Income Class, Macroeconomic Growth, and Common Prosperity",
    "url": "https://www.prcleader.org/post/china-s-middle-income-class-macroeconomic-growth-and-common-prosperity",
    "source": "www.prcleader.org",
    "description": "Sicular Yang Gustafsson CLM Issue 86 December 2025 .pdf Download PDF • 477KB\n\n\n\n\n\nThe emergence of a prosperous, middle-income class is seen as important for China’s drive for sustained macroeconomic growth and the achievement of common prosperity. Using household survey data and defining “middl...",
    "category": "Economic Growth",
    "country": "China",
    "published_date": "2025-11-01"
  },
  {
    "id": 244,
    "title": "Our economic outlook for China",
    "url": "https://corporate.vanguard.com/content/corporatesite/us/en/corp/vemo/vemo-china.html",
    "source": "corporate.vanguard.com",
    "description": "While China’s third-quarter real GDP growth remained firm, nominal GDP growth slowed to 3.7% year over year, down from 3.9% in the second quarter and its lowest level since the fourth quarter of 2022. Still, China’s full-year growth target appears largely on track, given that real GDP grew by 5.2% y...",
    "category": "Economic Growth",
    "country": "China",
    "published_date": "2025-11-01"
  },
  {
    "id": 1606,
    "title": "China factory activity slumps for longest stretch on record",
    "url": "https://www.moneycontrol.com/news/business/china-factory-activity-slumps-for-longest-stretch-on-record-13703000.html",
    "source": "www.moneycontrol.com",
    "description": "Beyond geopolitical risks, weak domestic demand is still casting a pall over the outlook for Chinese factories.\n\nChina’s factory activity improved but remained in contraction in November, extending its streak of declines to a record as the country’s economic slowdown deepens.\n\nThe official manufactu...",
    "category": "Economy",
    "country": "China",
    "published_date": "2025-11-01"
  },
  {
    "id": 1611,
    "title": "‘No longer neutral’: Why West can no longer ignore China’s role in Russia-Ukraine war",
    "url": "https://www.moneycontrol.com/world/no-longer-neutral-why-west-can-no-longer-ignore-china-s-role-in-russia-ukraine-war-article-13703246.html",
    "source": "www.moneycontrol.com",
    "description": "DragonBear axis reshapes Ukraine war\n\nGeopolitical strategist Velina Tchakarova has warned that China is no longer a neutral actor in the war in Ukraine, arguing that Beijing is now “getting embedded inside Russia’s drone war machine and war economy”.\n\nIn a detailed post on X, Tchakarova cited an in...",
    "category": "Economy",
    "country": "China",
    "published_date": "2025-11-01"
  },
  {
    "id": 238,
    "title": "Japan’s China row could be the GDP killer that sinks Takaichi",
    "url": "https://asiatimes.com/2025/11/japans-china-row-could-be-the-gdp-killer-that-sinks-takaichi/",
    "source": "asiatimes.com",
    "description": "TOKYO — By taking a hard line on China, Japan’s Sanae Takaichi thinks she’s establishing her right-wing bona fides. In reality, she may be ensuring her premiership will be a brief one.\n\nTakaichi wasn’t chosen by the Liberal Democratic Party (LDP) to stir a geopolitical hornet’s nest with China. She ...",
    "category": "GDP",
    "country": "China",
    "published_date": "2025-11-01"
  },
  {
    "id": 1584,
    "title": "China’s Q3 2025 Growth Slows as Soft Domestic Demand Weighs on Economy",
    "url": "https://www.econotimes.com/Chinas-Q3-2025-Growth-Slows-as-Soft-Domestic-Demand-Weighs-on-Economy-1727324",
    "source": "www.econotimes.com",
    "description": "China’s economy expanded at a slower pace in the third quarter of 2025 despite stronger-than-expected GDP data, as weakening domestic demand and persistent disinflation continued to pressure overall momentum. Analysts from BofA Securities said resilient exports helped bolster growth between July and...",
    "category": "GDP",
    "country": "China",
    "published_date": "2025-11-01"
  }
]