[
  {
    "id": 844,
    "title": "Big win for fugitive Mehul Choksi, can't be removed from Antigua and Barbuda: Report",
    "url": "https://www.hindustantimes.com/india-news/big-win-for-mehul-choksi-can-t-be-removed-from-antigua-without-order-report-101681517291387.html",
    "source": "www.hindustantimes.com",
    "description": "Mehul Choksi, the diamantaire who is wanted in India in connection with ₹13000 crore fraud cannot be removed from Antigua and Barbuda, the country's High Court said Friday as it gave the ruling in his favour. The court order has prohibited the removal of Mehul Choksi from Antigua and Barbuda's terri...",
    "category": "Central Bank",
    "country": "Antigua and Barbuda",
    "published_date": "2023-04-01"
  },
  {
    "id": 842,
    "title": "Mehul Choksi's legal victory: Can't be removed from Antigua without court order",
    "url": "https://www.livemint.com/news/world/mehul-choksi-wins-legal-battle-can-t-be-removed-from-antigua-barbuda-without-court-order-11681517336821.html",
    "source": "www.livemint.com",
    "description": "The High Court of Antigua and Barbuda has ruled in favour of Mehul Choksi, a diamond merchant who is wanted in India for his alleged involvement in a fraud worth ₹13,000 crore.\n\nAccording to the court's recent ruling on Friday, Choksi cannot be extradited from Antigua and Barbuda, as it was in his f...",
    "category": "Economy",
    "country": "Antigua and Barbuda",
    "published_date": "2023-04-01"
  },
  {
    "id": 843,
    "title": "Mehul Choksi wins legal battle in Antigua and Barbuda, allowed to stay on island",
    "url": "https://www.moneycontrol.com/news/india/mehul-choksi-wins-legal-battle-in-antigua-and-barbuda-allowed-to-stay-on-island-10416671.html",
    "source": "www.moneycontrol.com",
    "description": "Mehul Choksi\n\nMehul Choksi, a diamond merchant who is wanted in India for a fraud case worth Rs 13,000 crore, has emerged victorious in a legal battle, according to reports.\n\nThe High Court of Antigua and Barbuda ruled in his favour, granting him permission to stay on the island and not be removed. ...",
    "category": "Economy",
    "country": "Antigua and Barbuda",
    "published_date": "2023-04-01"
  }
]