[
  {
    "id": 4054,
    "title": "‘For India, Saudi Arabia is…’: PM Modi after meeting as Crown Prince speaks on economic corridor",
    "url": "https://www.hindustantimes.com/india-news/for-india-saudi-arabia-is-pm-modi-after-meeting-as-crown-prince-mohammed-bin-salman-speaks-on-economic-corridor-101694416517277.html",
    "source": "www.hindustantimes.com",
    "description": "Prime Minister Narendra Modi said Saudi Arabia is one of India's most important strategic partners, after his bilateral meeting with Crown Prince Mohammed bin Salman Al Saud in New Delhi on Monday. Both leaders also signed the minutes of the first meeting of the India-Saudi Strategic Partnership Cou...",
    "category": "Economic Growth",
    "country": "Saudi Arabia",
    "published_date": "2023-09-01"
  },
  {
    "id": 4057,
    "title": "Saudi Arabia's Fashion Industry: A Catalyst for Economic Growth",
    "url": "https://www.outlookindia.com/canada/saudi-arabia-s-fashion-industry-a-catalyst-for-economic-growth-news-314935",
    "source": "www.outlookindia.com",
    "description": "The fashion world is turning its gaze to an unexpected runway: Riyadh, the capital of Saudi Arabia, is emerging as a formidable contender in the global fashion industry. Vision 2030 reforms are steering Saudi Arabia toward becoming an international hub for fashion, with social changes and economic d...",
    "category": "Economic Growth",
    "country": "Saudi Arabia",
    "published_date": "2023-09-01"
  },
  {
    "id": 4024,
    "title": "Tesla, Saudi Arabia in talks for EV factory in gulf kingdom to diversify economy",
    "url": "https://www.livemint.com/companies/news/tesla-saudi-arabia-in-early-talks-for-ev-factory-in-the-gulf-kingdom-to-diversify-economy-11695043329955.html",
    "source": "www.livemint.com",
    "description": "Saudi Arabia is in early talks with US electric automaker Tesla to set up a manufacturing facility in the kingdom to help diversify its economy away from oil, the Wall Street Journal reported Monday citing sources.\n\nThe gulf country has been wooing the US automaker with the right to purchase certain...",
    "category": "Economy",
    "country": "Saudi Arabia",
    "published_date": "2023-09-01"
  },
  {
    "id": 4047,
    "title": "India, Saudi Arabia to explore trade in local currencies",
    "url": "https://www.moneycontrol.com/news/business/economy/india-saudi-arabia-to-explore-trade-in-local-currencies-11349051.html",
    "source": "www.moneycontrol.com",
    "description": "PM Narendra Modi met Saudi Arabia Crown Prince Mohammed bin Salman on September 11.\n\nIndia and Saudi Arabia have begun discussions on settling their trade in local currencies, officials from the external affairs ministry said on September 11.\n\nSpeaking to reporters following the state visit of Crown...",
    "category": "Trade Policy",
    "country": "Saudi Arabia",
    "published_date": "2023-09-01"
  }
]