[
  {
    "id": 4523,
    "title": "Syria's new rulers name foreign minister amid push for international relations",
    "url": "https://www.hindustantimes.com/world-news/syrias-new-rulers-name-foreign-minister-amid-push-for-international-relations-101734784184509.html",
    "source": "www.hindustantimes.com",
    "description": "- Syria's new rulers have appointed a foreign minister, the official Syrian news agency said on Saturday, as they seek to build international relations two weeks after Bashar al-Assad was ousted. Syria's new rulers name foreign minister amid push for international relations\n\nThe ruling General Comma...",
    "category": "Currency Exchange Rates",
    "country": "Syria",
    "published_date": "2024-12-01"
  },
  {
    "id": 4506,
    "title": "Syria News Highlights: Transitional PM named till March 1, new rulers plan shift to ‘free-market economy’",
    "url": "https://www.livemint.com/news/world/syria-news-live-bashar-al-assad-hayat-tahrir-al-sham-us-russia-iran-iraq-civil-war-damascus-aleppo-homs-hama-11733624419642.html",
    "source": "www.livemint.com",
    "description": "Syria Civil War Live Updates: Syrian President Bashar al-Assad has fled the country of Syria ending a fifty year regime. Russian media reported that the ousted President had been granted asylum in Moscow on ‘humanitarian grounds’. The Opposition forces in war-torn Syria took over the capital city of...",
    "category": "Economy",
    "country": "Syria",
    "published_date": "2024-12-01"
  },
  {
    "id": 4498,
    "title": "Indian stock market: 10 key things that changed for market over weekend - Gift Nifty, China inflation to Syria civil war",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-10-key-things-that-changed-for-market-over-weekend-gift-nifty-china-inflation-to-syria-civil-war-11733706813147.html",
    "source": "www.livemint.com",
    "description": "Indian stock market: The domestic equity benchmark indices, Sensex and Nifty 50, are expected to open lower on Monday following weak global cues.\n\nAsian markets traded mostly lower, while the US stock market ended mixed last week, with the Nasdaq and the S&P 500 hitting record closing highs.\n\nGlobal...",
    "category": "Inflation",
    "country": "Syria",
    "published_date": "2024-12-01"
  },
  {
    "id": 4516,
    "title": "‘Assad is gone, Russia lost Interest’: Trump blames Putin for Syria collapse",
    "url": "https://www.moneycontrol.com/news/world/assad-is-gone-russia-lost-interest-trump-blames-putin-for-syria-collapse-12885471.html",
    "source": "www.moneycontrol.com",
    "description": "In a post on his social media platform, Truth Social, Trump claimed Russia’s focus on its war in Ukraine has led to its diminished involvement in Syria. “\n\nU.S. President-elect Donald Trump criticised Russian President Vladimir Putin for withdrawing support for Syrian President Bashar al-Assad, who ...",
    "category": "Interest Rates",
    "country": "Syria",
    "published_date": "2024-12-01"
  },
  {
    "id": 4520,
    "title": "Syria news: Kid scheduled to be executed the same day, walks out of Bashar Assad's ‘human slaughterhouse’",
    "url": "https://www.livemint.com/news/world/syria-news-kid-scheduled-to-be-executed-the-same-day-walks-out-of-bashar-assads-human-slaughterhouse-watch-11733878244449.html",
    "source": "www.livemint.com",
    "description": "Syria news: Syria witnessed a historic moment, after a kid who was scheduled to be ‘slaughtered’ (executed) the same day, walked out of a cell of the Sednaya prison, which has been dubbed as Assad's ‘human slaughterhouse,’ reported Al Jazeera. Syria was freed from the clutches of President Bashar Al...",
    "category": "Unemployment",
    "country": "Syria",
    "published_date": "2024-12-01"
  },
  {
    "id": 4521,
    "title": "Syria news: Freed Sednaya prisoners reveal horrors – ‘Was scheduled to be hanged 30 minutes ago’",
    "url": "https://www.livemint.com/news/world/syria-news-freed-prisoners-from-notorious-sednaya-prison-recount-horror-was-scheduled-to-be-hanged-30-minutes-ago-11733717641677.html",
    "source": "www.livemint.com",
    "description": "Syria News: As Syrian rebels led by the Islamist group Hayat Tahrir al-Sham (HTS) captured city after city on the road to Damascus, forcing Bashar al-Assad to flee the country, they also opened the doors of the regime’s notorious prisons, into which upwards of 100,000 people disappeared during nearl...",
    "category": "Unemployment",
    "country": "Syria",
    "published_date": "2024-12-01"
  }
]