[
  {
    "id": 758,
    "title": "Manufacturing pickup is good news for the world economy",
    "url": "https://www.moneycontrol.com/news/opinion/manufacturing-pickup-is-good-news-for-the-world-economy-12565061.html",
    "source": "www.moneycontrol.com",
    "description": "The gentle upswing in manufacturing should be welcomed rather than\n\nscoured for caveats. The good news is that the global economy appears to have avoided a protracted downdraft, something that looked like a reasonable outcome last year. The US doesn’t have to carry the world on its shoulders, at lea...",
    "category": "Economy",
    "country": "Albania",
    "published_date": "2024-04-01"
  },
  {
    "id": 761,
    "title": "Interest rates have investors worried. Profits give them comfort.",
    "url": "https://www.livemint.com/market/stock-market-news/interest-rates-have-investors-worried-profits-give-them-comfort/amp-11712895019043.html",
    "source": "www.livemint.com",
    "description": "The trouble is that Wall Street expects a lot of profit this year, next year and, in early forecasts, 2026. The future is bright, investors and analysts think, even though it’s extremely rare for reality to come in better than originally hoped. On a quarterly basis, of course, companies tend to talk...",
    "category": "Interest Rates",
    "country": "Albania",
    "published_date": "2024-04-01"
  },
  {
    "id": 754,
    "title": "RBI Monetary Policy MPC Meeting April 2024 Highlights: RBI holds repo rate at 6.5%",
    "url": "https://www.thehindubusinessline.com/money-and-banking/rbi-monetary-policy-committee-mpc-meeting-live-updates-and-news-april-2024/article68028551.ece",
    "source": "www.thehindubusinessline.com",
    "description": "“MPC policy took recognition of fluidity of global narratives, even as domestic dynamics have stayed favorable. This suggests that when needed, the aim of financial stability may even precede inflation management. We have long maintained that the RBI policy has been somewhat pegged to the Fed, speci...",
    "category": "Monetary Policy",
    "country": "Albania",
    "published_date": "2024-04-01"
  }
]