[
  {
    "id": 3726,
    "title": "Papua New Guinea says landslide buried over 2,000 people; formally asks for help",
    "url": "https://www.hindustantimes.com/world-news/papua-new-guinea-says-landslide-buried-over-2-000-people-formally-asks-for-help-101716842667068.html",
    "source": "www.hindustantimes.com",
    "description": "A Papua New Guinea government official has told the United Nations that more than 2,000 people are believed to have been buried alive by last Friday's landslide and has formally asked for international help. A view after the landslide in Yambali village. More than 2,000 people are feared buried in a...",
    "category": "Fiscal Policy",
    "country": "Papua New Guinea",
    "published_date": "2024-05-01"
  },
  {
    "id": 3717,
    "title": "India announces $1 million assistance to Papua New Guinea amid landslide devastation",
    "url": "https://www.livemint.com/news/india/india-announces-1-million-assistance-to-papua-new-guinea-amid-landslide-devastation-11716884084039.html",
    "source": "www.livemint.com",
    "description": "India has announced immediate relief assistance worth $1 million to Papua New Guinea in the wake of a devastating landslide on the Pacific island nation, as per a release from the Ministry of External Affairs on May 28.\n\nThis comes after a massive landslide occurred on May 24 in Enga Province, Papua...",
    "category": "GDP",
    "country": "Papua New Guinea",
    "published_date": "2024-05-01"
  },
  {
    "id": 3718,
    "title": "Over 2,000 people buried in Papua New Guinea landslide",
    "url": "https://www.thehindu.com/news/international/papua-new-guinea-landslide-over-2000-people-buried/article68220590.ece",
    "source": "www.thehindu.com",
    "description": "Papua New Guinea informed the U.N. on May 27 that more than 2,000 people were buried in a massive landslide that swept over a remote village, according to a copy of the letter obtained by AFP.\n\n\"The landslide buried more than 2,000 people alive and caused major destruction,\" the country's national d...",
    "category": "GDP",
    "country": "Papua New Guinea",
    "published_date": "2024-05-01"
  },
  {
    "id": 3722,
    "title": "India announces assistance of $1 mn for Papua New Guinea after landslide",
    "url": "https://www.hindustantimes.com/india-news/india-announces-assistance-of-1-mn-for-papua-new-guinea-after-landslide-101716890211039.html",
    "source": "www.hindustantimes.com",
    "description": "India on Tuesday announced immediate relief assistance worth $1 million for Papua New Guinea after a massive landslide in the Pacific Island nation buried about 2,000 people alive and caused widespread destruction. The landslide tore through an area 600 km northwest of the capital Port Moresby in th...",
    "category": "Inflation",
    "country": "Papua New Guinea",
    "published_date": "2024-05-01"
  }
]