[
  {
    "id": 3403,
    "title": "New Zealand slips into its second recession in 18 months as economy contracts",
    "url": "https://www.thehindu.com/news/international/new-zealand-slips-into-its-second-recession-in-18-months-as-economy-contracts/article67974882.ece",
    "source": "www.thehindu.com",
    "description": "New Zealand has entered its second recession in 18 months after the latest round of GDP figures confirmed its economy contracted in the last quarter of 2023.\n\nThe country's economy shrank by 0.1% in the quarter to December and 0.7% in per capita terms, the New Zealand's official statistics agency, S...",
    "category": "Economy",
    "country": "New Zealand",
    "published_date": "2024-03-01"
  },
  {
    "id": 3379,
    "title": "New Zealand GDP shrinks 0.3%, entering second recession in a row, yield on key bond drops 8 basis points",
    "url": "https://www.livemint.com/news/world/new-zealand-gdp-shrinks-0-3-entering-second-recession-in-a-row-yield-on-key-bond-drops-8-basis-points-11710986363029.html",
    "source": "www.livemint.com",
    "description": "New Zealand’s economy unexpectedly contracted in the final three months of last year, confirming a recession and sending the currency initially lower as traders boosted bets on interest-rate cuts.\n\nGross domestic product dropped 0.1% in the fourth quarter after declining 0.3% in the prior three mont...",
    "category": "GDP",
    "country": "New Zealand",
    "published_date": "2024-03-01"
  },
  {
    "id": 3380,
    "title": "New Zealand GDP shrinks 0.3% unexpectedly, entering second recession in a row: What's happening?",
    "url": "https://www.hindustantimes.com/business/new-zealand-gdp-shrinks-0-3-unexpectedly-entering-second-recession-in-a-row-whats-happening-101710988197113.html",
    "source": "www.hindustantimes.com",
    "description": "New Zealand’s economy unexpectedly contracted in the final three months of last year, confirming a recession and sending the currency initially lower as traders boosted bets on interest-rate cuts. View of an entrance to the Reserve Bank of New Zealand in Wellington, New Zealand. (Reuters)\n\nGross dom...",
    "category": "GDP",
    "country": "New Zealand",
    "published_date": "2024-03-01"
  }
]