[
  {
    "id": 2679,
    "title": "Jamaica’s financial system resilient to hurricane blow, central bank says",
    "url": "https://www.jamaicaobserver.com/2025/11/21/jamaicas-financial-system-resilient-hurricane-blow-central-bank-says/",
    "source": "www.jamaicaobserver.com",
    "description": "Bank of Jamaica headquarters in Kingston, where officials say the financial system remains resilient after Hurricane Melissa.\n\nJAMAICA’S financial system is resilient enough to withstand the impact of Hurricane Melissa, the country’s central bank said on Tuesday, even as new estimates reveal the Cat...",
    "category": "Central Bank",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  },
  {
    "id": 2682,
    "title": "Revitalising economic activity a necessity for recovery",
    "url": "https://www.jamaicaobserver.com/2025/11/30/revitalising-economic-activity-necessity-recovery/",
    "source": "www.jamaicaobserver.com",
    "description": "Word from Tourism Minister Edmund Bartlett that Jamaica’s tourism sector is rebounding with strong momentum following the passage of Hurricane Melissa is music to our ears.\n\nMr Bartlett, who carries a steady, unshakeable optimism — an instinctive belief that every challenge presents an opportunity —...",
    "category": "Economic Growth",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  },
  {
    "id": 2674,
    "title": "Jamaica’s economy was surging before Hurricane Melissa",
    "url": "https://www.jamaicaobserver.com/2025/11/25/jamaicas-economy-surging-hurricane-melissa-survey/",
    "source": "www.jamaicaobserver.com",
    "description": "ANDERSON...The economy was not stagnating before Hurricane Melissa; it was surging. This pre-storm strength suggests that the private sector has the psychological and financial resilience required to drive the coming reconstruction.\n\nKINGSTON, Jamaica —The Q3 JCC/GK Capital Management Business and C...",
    "category": "Economy",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  },
  {
    "id": 2664,
    "title": "Economy to contract 11-13 per cent Oct-Dec — PIOJ",
    "url": "https://www.jamaicaobserver.com/2025/11/25/economy-contract-11-13-per-cent-oct-dec-pioj/",
    "source": "www.jamaicaobserver.com",
    "description": "Director General, Planning Institute of Jamaica (PIOJ), Wayne Henry. (Photo: Adrian Walker)\n\nKINGSTON, Jamaica — Reeling from the devastation brought on by the passage of Hurricane Melissa last month, the local economy is expected to register as much as a 13 per cent decline in gross domestic produc...",
    "category": "GDP",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  },
  {
    "id": 2667,
    "title": "BOJ warns of prolonged inflation spike",
    "url": "https://www.jamaicaobserver.com/2025/11/25/boj-warns-prolonged-inflation-spike/",
    "source": "www.jamaicaobserver.com",
    "description": "The inflationary shock from the hurricane is set to become broad-based, rippling out into wider categories of goods and services such as routine household maintenance, transport services and personal care items.\n\nTHE Bank of Jamaica (BOJ) is warning households to budget for higher food and utility b...",
    "category": "Inflation",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  },
  {
    "id": 2668,
    "title": "Jamaica’s inflation ticks up in October, driven by food prices",
    "url": "https://www.jamaicaobserver.com/2025/11/19/jamaicas-inflation-ticks-october-driven-food-prices/",
    "source": "www.jamaicaobserver.com",
    "description": "Consumer Price Index infographic\n\nKINGSTON, Jamaica — Jamaica’s consumer prices rose by 0.7 per cent in October, with higher costs for food and electricity being the main drivers.\n\nThe Statistical Institute of Jamaica (STATIN), in a monthly report on Monday, shared that the increase brought the poin...",
    "category": "Inflation",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  },
  {
    "id": 2669,
    "title": "Bank of Jamaica wins 2025 Best Central Bank award",
    "url": "https://www.jamaicaobserver.com/2025/11/28/bank-jamaica-wins-2025-best-central-bank-award/",
    "source": "www.jamaicaobserver.com",
    "description": "Bank of Jamaica's headquarters. The 'A'-rated central bank was named the 2025 Best Central Bank for its consistent monetary policy and leadership.\n\nKINGSTON, Jamaica — The Bank of Jamaica (BOJ) said on Wednesday it received the Best Bank Award 2025 from the international financial publication Global...",
    "category": "Monetary Policy",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  },
  {
    "id": 2670,
    "title": "BOJ injects billions; holds rate to shore up financial system after hurricane",
    "url": "https://www.jamaicaobserver.com/2025/11/26/boj-injects-billions-holds-rate-shore-financial-system-hurricane/",
    "source": "www.jamaicaobserver.com",
    "description": "Bank of Jamaica\n\nTHE Bank of Jamaica (BOJ) is shoring up the island’s financial stability in the wake of Hurricane Melissa, facilitating billions of dollars in emergency cash and waiving key transaction fees to ensure the flow of money through a disrupted banking system, even as it held its key inte...",
    "category": "Monetary Policy",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  },
  {
    "id": 2684,
    "title": "Brace for a recession",
    "url": "https://www.jamaicaobserver.com/2025/11/26/brace-for-a-recession/",
    "source": "www.jamaicaobserver.com",
    "description": "Wayne Henry (right), PIOJ director general, and James Stewart, senior director in the economic planning and research division, converse during a quarterly press briefing held by the institute at its Oxford Road office on Tuesday.Garfield Robinson\n\nTechnocrats at the Planning Institute of Jamaica (PI...",
    "category": "Unemployment",
    "country": "Jamaica",
    "published_date": "2025-11-01"
  }
]