[
  {
    "id": 3855,
    "title": "Qatar Central Bank Governor meets Audi CEO to discuss global financial trends",
    "url": "https://thepeninsulaqatar.com/article/30/11/2025/qatar-central-bank-governor-meets-audi-ceo-to-discuss-global-financial-trends",
    "source": "thepeninsulaqatar.com",
    "description": "QNA\n\nDoha: Qatar Central Bank Governor HE Sheikh Bandar bin Mohammed bin Saoud Al-Thani met with Gernot Dollner, Chairman of Audi AG, to discuss key developments in global finance and investment.\n\nThe discussion focused on international financial trends and investment opportunities, reflecting Qatar...",
    "category": "Central Bank",
    "country": "Qatar",
    "published_date": "2025-11-01"
  },
  {
    "id": 3867,
    "title": "‘Qatar advancing in industrial safety to boost economic growth’",
    "url": "https://thepeninsulaqatar.com/article/21/11/2025/qatar-advancing-in-industrial-safety-to-boost-economic-growth",
    "source": "thepeninsulaqatar.com",
    "description": "Industry leaders during the panel session.\n\nDOHA: Experts emphasised modernising industrial safety through advanced technology, leadership development, and data-driven practices that supports Qatar’s broader economic ambitions by strengthening the performance of key sectors such as energy, maritime,...",
    "category": "Economic Growth",
    "country": "Qatar",
    "published_date": "2025-11-01"
  },
  {
    "id": 3846,
    "title": "Qatar participates in women exporters in the Digital Economy Fund's Governing Board Meeting",
    "url": "https://thepeninsulaqatar.com/article/19/11/2025/qatar-participates-in-women-exporters-in-the-digital-economy-funds-governing-board-meeting",
    "source": "thepeninsulaqatar.com",
    "description": "QNA\n\nGeneva: The State of Qatar participated in the meeting of the Governing Board of the Women Exporters in the Digital Economy Fund (WEIDE Fund), held at the headquarters of the World Trade Organization in Geneva.\n\nRepresenting the State of Qatar at the meeting was HE Permanent Representative of t...",
    "category": "Economy",
    "country": "Qatar",
    "published_date": "2025-11-01"
  },
  {
    "id": 3851,
    "title": "Qatar’s role in peace efforts would lead to economic partnership",
    "url": "https://www.gulf-times.com/article/715540/qatar/qatars-role-in-peace-efforts-would-lead-to-economic-partnership",
    "source": "www.gulf-times.com",
    "description": "Deputy Prime Minister in charge of the National Economy of DRC Daniel Mukoko Samba highlighted the great importance that the visit of His Highness the Amir Sheikh Tamim bin Hamad al-Thani to Congo holds, especially in promoting peace and investment relations, given the role of Qatar in supporting pe...",
    "category": "Economy",
    "country": "Qatar",
    "published_date": "2025-11-01"
  },
  {
    "id": 3852,
    "title": "Qatar Central Bank launches QCB mobile app",
    "url": "https://www.iloveqatar.net/news/general/qatar-central-bank-launches-qcb-mobile-app",
    "source": "www.iloveqatar.net",
    "description": "The Qatar Central Bank announces the launch of its mobile application, an initiative aimed at enhancing the user experience and keeping pace with technological advancements and the requirements of digital transformation within the financial sector. This launch aligns with the Third Financial Sector ...",
    "category": "Economy",
    "country": "Qatar",
    "published_date": "2025-11-01"
  },
  {
    "id": 3860,
    "title": "QNB offers customers exceptional interest rates on new loans in celebration of Qatar National Day",
    "url": "https://thepeninsulaqatar.com/article/19/11/2025/qnb-offers-customers-exceptional-interest-rates-on-new-loans-in-celebration-of-qatar-national-day",
    "source": "thepeninsulaqatar.com",
    "description": "The Peninsula\n\nDoha, Qatar: In celebration of Qatar National Day, QNB announced a limited-time special loan offer designed to make customers’ financial goals more achievable than ever. For a limited period, the Bank is offering an exceptional interest rate of 3.45% (APR) on new personal and vehicle ...",
    "category": "Interest Rates",
    "country": "Qatar",
    "published_date": "2025-11-01"
  },
  {
    "id": 3844,
    "title": "How much more monetary accommodation can the Fed deliver?",
    "url": "https://thepeninsulaqatar.com/article/16/11/2025/how-much-more-monetary-accommodation-can-the-fed-deliver",
    "source": "thepeninsulaqatar.com",
    "description": "The Peninsula\n\nDoha, Qatar: The US Federal Reserve (Fed) is once again at the forefront of the global macro agenda, after a period dominated by US-driven trade negotiations, fiscal debates and geopolitical conflict. Economic policy uncertainty has been reduced significantly on the back of a plethora...",
    "category": "Monetary Policy",
    "country": "Qatar",
    "published_date": "2025-11-01"
  }
]