[
  {
    "id": 1197,
    "title": "World Bank delegation meets Jamaat chief in Dhaka",
    "url": "https://www.thedailystar.net/news/bangladesh/diplomacy/news/world-bank-delegation-meets-jamaat-chief-dhaka-4037936",
    "source": "www.thedailystar.net",
    "description": "Bangladesh, Bhutan Division Director Jean Pesme leads talks\n\nA World Bank delegation led by Jean Pesme, division director for Bangladesh and Bhutan, held a meeting with Bangladesh Jamaat-e-Islami Ameer Shafiqur Rahman today.\n\nThe meeting was held at the Jamaat chief's office in Dhaka's Bashundhara R...",
    "category": "Central Bank",
    "country": "Bhutan",
    "published_date": "2025-11-01"
  },
  {
    "id": 1192,
    "title": "Ethereum News: Bhutan Expands Blockchain Adoption Through Ethereum Staking",
    "url": "https://www.livebitcoinnews.com/ethereum-news-bhutan-expands-blockchain-adoption-through-ethereum-staking/",
    "source": "www.livebitcoinnews.com",
    "description": "Bhutan moved 320 Ethereum to Figment for staking. This highlights its growing blockchain adoption and digital strategy.\n\nThe Royal Government of Bhutan today moved 320 Ethereum. This is worth around $970,000. It was moved to Figment. Figment is an institutional staking provider. It specializes in sa...",
    "category": "Economy",
    "country": "Bhutan",
    "published_date": "2025-11-01"
  },
  {
    "id": 1193,
    "title": "Bhutan Stakes 320 ETH via Figment for Ethereum 2.0",
    "url": "https://www.crypto-news-flash.com/bhutan-stakes-320-eth-via-figment/",
    "source": "www.crypto-news-flash.com",
    "description": "All news is rigorously fact-checked and reviewed by leading blockchain experts and seasoned industry insiders.\n\nThe Bhutan Government stakes 320 ETH through Figment, adding 10 validators.\n\nBhutan is expanding its role in blockchain adoption and institutional participation in Ethereum staking.\n\nOn-ch...",
    "category": "Economy",
    "country": "Bhutan",
    "published_date": "2025-11-01"
  },
  {
    "id": 1194,
    "title": "Bhutan's first transit cargo set for release Tuesday after 2-month delay",
    "url": "https://www.tbsnews.net/economy/bhutans-first-transit-cargo-set-release-tuesday-after-2-month-delay-1293596",
    "source": "www.tbsnews.net",
    "description": "Bhutan's first trial transit shipment through Chattogram Port is set to roll out on Tuesday (25 November), ending a two-month wait caused by delayed regulatory clearances. The shipment includes 6,530 kgs of goods such as shampoo, dried palm, iced tea, chocolate and juice. Bhutan's Abit Trading is th...",
    "category": "Economy",
    "country": "Bhutan",
    "published_date": "2025-11-01"
  },
  {
    "id": 1195,
    "title": "Bhutan begins first trial transit of goods via Bangladesh on 22-24 Nov",
    "url": "https://www.tbsnews.net/economy/bhutan-begins-first-trial-transit-goods-bangladesh-22-24-nov-1291366",
    "source": "www.tbsnews.net",
    "description": "Highlights:\n\nTrial run coincides with Bhutan PM Tshering Tobgay's 22–24 Nov Dhaka visit\n\nBangladesh already issued clearance to port and customs authorities\n\nNo trade talks planned during this visit; next secretary-level meeting in Jan\n\nSecond trial run needed before transit begins regular commercia...",
    "category": "Economy",
    "country": "Bhutan",
    "published_date": "2025-11-01"
  },
  {
    "id": 1196,
    "title": "NBR sets fees for first Bangladesh-Bhutan transit trial",
    "url": "https://www.thedailystar.net/business/economy/news/nbr-sets-fees-first-bangladesh-bhutan-transit-trial-4039806",
    "source": "www.thedailystar.net",
    "description": "The government has fixed a set of administrative fees and charges for customs formalities related to the first trial run of transit and transshipment of goods between Bangladesh and Bhutan via the Chattogram-Burimari route, according to a notification by the National Board of Revenue (NBR) issued ye...",
    "category": "Economy",
    "country": "Bhutan",
    "published_date": "2025-11-01"
  }
]