[
  {
    "id": 1716,
    "title": "Costa Rica Colón Exchange Rate Dips to ¢499",
    "url": "https://ticotimes.net/2025/11/15/costa-rica-colon-exchange-rate-dips-to-%C2%A2499-raising-concerns",
    "source": "ticotimes.net",
    "description": "The Central Bank of Costa Rica reported the buy rate at 499.46 colones per dollar on November 12, with similar levels persisting into the following days. This represents a drop from earlier in the year, when rates hovered above 505 colones. While a stronger colón benefits importers and locals with f...",
    "category": "Central Bank",
    "country": "Costa Rica",
    "published_date": "2025-11-01"
  },
  {
    "id": 1728,
    "title": "Can industrial growth and climate action go hand in hand?",
    "url": "https://news.un.org/en/story/2025/11/1166421",
    "source": "news.un.org",
    "description": "In Namibia’s Daures region, a bold experiment aims to prove economies can create jobs without fossil fuels.\n\nWhen completed, Daures Green Hydrogen Village will sustainably produce hydrogen and ammonia from renewable sources, which will be used to make the country’s first carbon-free green fertiliser...",
    "category": "Economic Growth",
    "country": "Costa Rica",
    "published_date": "2025-11-01"
  },
  {
    "id": 1725,
    "title": "Foreign Trade Minister: Peru is betting on greater trade openness (Interview)",
    "url": "https://andina.pe/ingles/noticia-foreign-trade-minister-peru-is-betting-on-greater-trade-openness-interview-1053083.aspx",
    "source": "andina.pe",
    "description": "To learn more about this topic, the Official Gazette El Peruano interviewed the head of the Ministry of Foreign Trade and Tourism (Mincetur)\n\n\n\n\n\nYou played a very active role in the Ninth Meeting of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) Commission in Melb...",
    "category": "Trade Policy",
    "country": "Costa Rica",
    "published_date": "2025-11-01"
  }
]