[
  {
    "id": 3271,
    "title": "Mozambique: Government cuts growth forecasts – Mozambique",
    "url": "https://clubofmozambique.com/news/mozambique-government-cuts-growth-forecasts/",
    "source": "clubofmozambique.com",
    "description": "Mozambique’s government has acknowledged that the financial scenario is “substantially more adverse” than predicted in the 2026 budget proposal, cutting growth forecasts to 1.6% this year and expected revenues for next year.\n\n“In the context of strengthening budgetary transparency and the sustainabi...",
    "category": "Economic Growth",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3260,
    "title": "Credit Suisse Faces Swiss Charges for 2016 Mozambique Loan Scandal",
    "url": "https://www.occrp.org/en/news/credit-suisse-faces-swiss-charges-for-2016-mozambique-loan-scandal",
    "source": "www.occrp.org",
    "description": "Swiss prosecutors filed charges Monday against Credit Suisse over what they say were organizational failures that allowed money laundering linked to Mozambique’s “tuna bonds” fraud, which devastated the country’s economy in the 2010s.\n\nThe Office of the Attorney General of Switzerland said Credit Su...",
    "category": "Economy",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3261,
    "title": "Mozambique to build two new cement plants with Chinese investment",
    "url": "https://www.globalcement.com/news/item/19517-mozambique-to-build-two-new-cement-plants-with-chinese-investment",
    "source": "www.globalcement.com",
    "description": "Mozambique: Mozambique and China will together invest US$333m to build two new cement plants, a jetty and hospital services in Nampula and Cabo Delgado. The investment is the result of four agreements signed in October 2025 at an investment conference in Xian in China’s Shaanxi province, where repre...",
    "category": "Economy",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3262,
    "title": "Mozambique: Government to invest $12 million in rehabilitation of vocational institutions – Mozambique",
    "url": "https://clubofmozambique.com/news/mozambique-government-to-invest-12-million-in-rehabilitation-of-vocational-institutions/",
    "source": "clubofmozambique.com",
    "description": "The Mozambican government intends to invest 12 million US dollars in the rehabilitation of technical and vocational institutions throughout the country, as part of a reform project supported by partners.\n\nAccording to Leo Jamal, Secretary of State for Technical and Vocational Education, who was spea...",
    "category": "Economy",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3263,
    "title": "Mozambique: Dutch vice-minister visits Beira port – Mozambique",
    "url": "https://clubofmozambique.com/news/mozambique-dutch-vice-minister-visits-beira-port/",
    "source": "clubofmozambique.com",
    "description": "The Vice-Minister for International Cooperation and Trade of the Kingdom of the Netherlands, Pascalle Grotenhuis, will visit Beira Port this Tuesday. The port’s concessionaire is Cornelder de Moçambique.\n\nThe visit is part of efforts to strengthen cooperation between the Netherlands and Mozambique, ...",
    "category": "Economy",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3265,
    "title": "Union Minister Hardeep Singh Puri, Mozambique Economy Minister discuss ways to further enhance collaboration in energy projects",
    "url": "https://www.aninews.in/news/world/others/union-minister-hardeep-singh-puri-mozambique-economy-minister-discuss-ways-to-further-enhance-collaboration-in-energy-projects20231031010751/",
    "source": "www.aninews.in",
    "description": "Maputo [Mozambique], October 31 (ANI): Union Minister for Petroleum and Natural Gas Hardeep Singh Puri on Monday held a meeting with Mozambique's Minister of Economy and Finance Ernesto Max Elias Tonela and discussed how energy, particularly gas, will play an important role in India's journey from b...",
    "category": "Economy",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3266,
    "title": "UK withdraws $1.15bn loan from Mozambique gas project over climate and security risks",
    "url": "https://bmmagazine.co.uk/news/uk-withdraws-funding-mozambique-gas-project/",
    "source": "bmmagazine.co.uk",
    "description": "The UK government has withdrawn its backing for a $1.15bn (£870m) loan to a major gas development in Mozambique, citing escalating concerns over climate impact, human rights violations and the deadly insurgency that engulfed the region.\n\nBusiness secretary Peter Kyle confirmed on Monday that the UK ...",
    "category": "Economy",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3257,
    "title": "Mozambique: Banks cut prime rate to 15.8% in December – Mozambique",
    "url": "https://clubofmozambique.com/news/mozambique-banks-cut-prime-rate-to-15-8-in-december/",
    "source": "clubofmozambique.com",
    "description": "The benchmark interest rate for credit in Mozambique will fall by 0.20 percentage points in December to 15.80%, the Mozambican Banking Association (AMB) announced on Friday.\n\nSince January 2024, the rate, known as the “prime rate”, has been falling steadily after six consecutive months at a high of ...",
    "category": "Inflation",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3258,
    "title": "International Monetary Fund (IMF) Staff Completes 2025 Article IV Mission to Mozambique",
    "url": "https://www.zawya.com/en/press-release/africa-press-releases/international-monetary-fund-imf-staff-completes-2025-article-iv-mission-to-mozambique-s0p4enf7",
    "source": "www.zawya.com",
    "description": "Economic activity is gradually recovering from an abrupt contraction during the last quarter of 2024, and inflation pressures are muted.\n\nGrowth is expected to remain moderate, as challenges including a constrained funding environment, policy uncertainty, and foreign exchange shortages are holding b...",
    "category": "Monetary Policy",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  },
  {
    "id": 3269,
    "title": "Mozambique: Afreximbank plans $3.5 billion to finance projects in energy and gas sectors – Mozambique",
    "url": "https://clubofmozambique.com/news/afreximbank-plans-3-5-billion-fund-for-mozambique-projects/",
    "source": "clubofmozambique.com",
    "description": "The African Export-Import Bank (Afreximbank) is preparing a fund of around four billion dollars (€3.5 billion) to finance projects in Mozambique in the energy, oil, and gas sectors.\n\n“At Afreximbank, there was a commitment to finance around three to four billion dollars in infrastructure projects in...",
    "category": "Trade Policy",
    "country": "Mozambique",
    "published_date": "2025-12-01"
  }
]