[
  {
    "id": 2628,
    "title": "2025 high-tech conference opens in Tel Aviv with focus on post-war growth",
    "url": "https://www.i24news.tv/en/news/israel/economy/artc-2025-high-tech-conference-opens-in-tel-aviv-with-focus-on-post-war-growth",
    "source": "www.i24news.tv",
    "description": "The 2025 Industry and High-Tech Conference opened this morning in Tel Aviv, drawing hundreds of top figures from Israel’s industrial and economic sectors, including entrepreneurs, economists, government officials, and high-tech representatives.\n\nThe conference will feature a series of sessions and m...",
    "category": "Economic Growth",
    "country": "Israel",
    "published_date": "2025-11-01"
  },
  {
    "id": 2596,
    "title": "Will Israel’s Interest Rate Cut Have Real Impact?",
    "url": "https://themedialine.org/top-stories/will-israels-interest-rate-cut-have-real-impact/",
    "source": "themedialine.org",
    "description": "Israel’s first rate cut in nearly two years drew political optimism, but economists and lawmakers say households will barely feel relief and warn of risks to competition, exports, and postwar reconstruction\n\nIsrael’s long-anticipated interest rate cut, a 0.25 percentage-point reduction from 4.50% to...",
    "category": "Inflation",
    "country": "Israel",
    "published_date": "2025-11-01"
  },
  {
    "id": 2617,
    "title": "Will rate cut boost real estate market?",
    "url": "https://en.globes.co.il/en/article-will-rate-cut-boost-real-estate-market-1001526918",
    "source": "en.globes.co.il",
    "description": "On Monday, many analysts believe that the Bank of Israel Monetary Committee will cut the interest rate by a quarter of a percentage point after 14 consecutive interest rate decisions in which the rate was left unchanged.\n\nThe potential cut raises hope in several sectors of the economy that have suff...",
    "category": "Interest Rates",
    "country": "Israel",
    "published_date": "2025-11-01"
  },
  {
    "id": 2622,
    "title": "Sinn Fein and DUP clash after Executive meeting over Israel decision",
    "url": "https://www.derrynow.com/news/northern-ireland/1951816/sinn-fein-and-dup-clash-after-executive-meeting-over-israel-decision.html",
    "source": "www.derrynow.com",
    "description": "Sinn Fein and DUP ministers have clashed following an Executive meeting over a decision to block trade talks with Israel.\n\nThe DUP was unable to overturn Sinn Fein Economy Minister Caoimhe Archibald’s policy following a vote of ministers.\n\nBut DUP deputy First Minister Emma Little-Pengelly accused M...",
    "category": "Trade Policy",
    "country": "Israel",
    "published_date": "2025-11-01"
  },
  {
    "id": 2633,
    "title": "Unemployment in Israel remains very low",
    "url": "https://en.globes.co.il/en/article-unemployment-in-israel-remains-very-low-1001526606",
    "source": "en.globes.co.il",
    "description": "Unemployment in Israel remained low in October at just 3%, seasonally adjusted, unchanged from September, the Central Bureau of Statistics reports. The rate of participation in the workforce also remained unchanged in October at 60.9%.\n\nThe number of job vacancies in October was 149,000 - up from th...",
    "category": "Unemployment",
    "country": "Israel",
    "published_date": "2025-11-01"
  }
]