[
  {
    "id": 3633,
    "title": "Tanzania, Oman deepen cooperation in key economic sectors",
    "url": "https://dailynews.co.tz/tanzania-oman-deepen-cooperation-in-key-economic-sectors/",
    "source": "dailynews.co.tz",
    "description": "DAR ES SALAAM: MINISTER for Foreign Affairs and East African Cooperation Ambassador Mahmoud Thabit Kombo has said that cooperation between Tanzania and Oman has expanded in education, tourism, mining, energy and transportation, boosting economic growth for both nation.\n\nHe was speaking during the Om...",
    "category": "Economic Growth",
    "country": "Oman",
    "published_date": "2025-11-01"
  },
  {
    "id": 3635,
    "title": "Oman’s aviation sector powers tourism growth and investment",
    "url": "https://www.omanobserver.om/article/1180122/business/omans-aviation-sector-powers-tourism-growth-and-investment",
    "source": "www.omanobserver.om",
    "description": "MUSCAT: Oman’s civil aviation sector is playing a pivotal role in boosting tourism and attracting investment through the continuous development of airport infrastructure and the expansion of air connectivity to regional and international markets.\n\nThe Civil Aviation Authority (CAA), working with air...",
    "category": "Economic Growth",
    "country": "Oman",
    "published_date": "2025-11-01"
  },
  {
    "id": 3613,
    "title": "Oman's economy on path of growth, expansion: Minister",
    "url": "https://www.omanobserver.om/article/1180108/business/economy/omans-economy-on-path-of-growth-expansion-minister",
    "source": "www.omanobserver.om",
    "description": "Muscat: The economy is making good progress, as the Sultanate of Oman has transitioned from the recovery phase to one of economic growth and expansion.\n\nDr. Said bin Mohammed al Saqri, Minister of Economy, has said in a radio interview that the average growth at current prices was approximately 10 p...",
    "category": "Economy",
    "country": "Oman",
    "published_date": "2025-11-01"
  },
  {
    "id": 3614,
    "title": "Oman leads region in digital transformation, AI and ICT development",
    "url": "https://www.omanobserver.om/article/1179944/business/economy/oman-leads-region-in-digital-transformation-ai-and-ict-development",
    "source": "www.omanobserver.om",
    "description": "MUSCAT: The Sultanate of Oman has made substantial gains in digital transformation and technological innovation, with the Ministry of Transport, Communications and Information Technology (MoTCIT) reporting strong progress across artificial intelligence (AI), e-government, skills development and ICT ...",
    "category": "Economy",
    "country": "Oman",
    "published_date": "2025-11-01"
  },
  {
    "id": 3603,
    "title": "Oman's National Day fervour @ night",
    "url": "https://www.omanobserver.om/article/1179873/oman/governorates/omans-national-day-fervour-night",
    "source": "www.omanobserver.om",
    "description": "The Sultanate of Oman will mark this Thursday its Glorious National Day, commemorating the Al Busaidi State Foundation Day on November 20 every year.\n\nThese concerted efforts have collectively served to underpin the expansion of the Gross Domestic Product (GDP), attract heightened investment inflows...",
    "category": "GDP",
    "country": "Oman",
    "published_date": "2025-11-01"
  }
]