[
  {
    "id": 259,
    "title": "Iran, Afghanistan central bank chiefs agree to boost monetary, banking ties",
    "url": "https://www.tehrantimes.com/news/510003/Iran-Afghanistan-central-bank-chiefs-agree-to-boost-monetary",
    "source": "www.tehrantimes.com",
    "description": "TEHRAN – The governors of Iran and Afghanistan’s central banks met on the sidelines of a banking technology summit in Yekaterinburg, Russia, to discuss strengthening monetary and banking cooperation, Iran’s central bank said.\n\nIran’s central bank chief, Mohammad Reza Farzin, and his Afghan counterpa...",
    "category": "Central Bank",
    "country": "Afghanistan",
    "published_date": "2025-02-01"
  },
  {
    "id": 277,
    "title": "Taliban Releases $20 Million To Stabilise Afghan Currency Amid Depreciation",
    "url": "https://www.afintl.com/en/202502176622",
    "source": "www.afintl.com",
    "description": "The Central Bank of Afghanistan, under Taliban control, has announced plans to inject an additional $20 million into the market on Tuesday in an effort to stabilise the afghani amid ongoing currency depreciation.\n\nThe move comes in response to the suspension of U.S. foreign aid and the subsequent de...",
    "category": "Currency Exchange Rates",
    "country": "Afghanistan",
    "published_date": "2025-02-01"
  },
  {
    "id": 247,
    "title": "World Bank: Afghanistan's economic recovery precarious",
    "url": "https://www.voanews.com/a/world-bank-afghanistan-s-economic-recovery-precarious/7978106.html",
    "source": "www.voanews.com",
    "description": "The World Bank reported Monday that the economic recovery in Taliban-controlled Afghanistan remains precarious, beset by persistent challenges, including policy uncertainty, financial isolation, reduced foreign aid and fragile trade relations with neighboring Pakistan.\n\nThe bank assessed in its late...",
    "category": "GDP",
    "country": "Afghanistan",
    "published_date": "2025-02-01"
  },
  {
    "id": 718,
    "title": "RBI likely to cut repo rate by 25 bps in Governor Sanjay Malhotra's first policy move: Report",
    "url": "https://www.indiatvnews.com/business/news/rbi-repo-rate-cut-mpc-policy-decision-2025-governor-sanjay-malhotra-bps-inflation-2025-02-07-975047",
    "source": "www.indiatvnews.com",
    "description": "RBI likely to cut repo rate by 25 bps in Governor Sanjay Malhotra's first policy move: Report The RBI’s Monetary Policy Committee (MPC) may cut the repo rate by 25 bps in Governor Sanjay Malhotra’s first policy move. Experts predicted a balanced approach to inflation and growth.\n\nNew Delhi:\n\nThe Res...",
    "category": "Monetary Policy",
    "country": "Afghanistan",
    "published_date": "2025-02-01"
  }
]