[
  {
    "id": 3945,
    "title": "BLP presence in St Vincent causes stir, but political scientists’ views differ",
    "url": "https://nationnews.com/2025/11/22/blp-presence-in-st-vincent-causes-stir-but-political-scientists-views-differ/",
    "source": "nationnews.com",
    "description": "The presence of several members of the Barbados Labour Party (BLP) in St Vincent and the Grenadines a week ahead of elections in that country has stirred some Vincentians who have been posting under a story and pictures that captured the arrival of the group.\n\nThe information came to light when iWit...",
    "category": "Economy",
    "country": "Saint Vincent and the Grenadines",
    "published_date": "2025-11-01"
  },
  {
    "id": 3954,
    "title": "One of world's longest serving democratic leaders loses election in St. Vincent and the Grenadines",
    "url": "https://www.newsday.com/news/nation/st-vincent-grenadines-gonsalves-godwin-friday-election-w09338",
    "source": "www.newsday.com",
    "description": "SAN JUAN, Puerto Rico — St. Vincent and the Grenadines on Friday swore in a new prime minister for the first time in 24 years after Godwin Friday of the New Democratic Party beat Ralph Gonsalves of the Unity Labor Party.\n\nGonsalves was first elected in March 2001, making him one of the world’s longe...",
    "category": "Trade Policy",
    "country": "Saint Vincent and the Grenadines",
    "published_date": "2025-11-01"
  },
  {
    "id": 3957,
    "title": "One of world’s longest serving democratic leaders loses election in St. Vincent and the Grenadines",
    "url": "https://apnews.com/article/st-vincent-grenadines-gonsalves-godwin-friday-election-19dae7a73c91ccad643ade4b1ed08cba",
    "source": "apnews.com",
    "description": "Add AP News as your preferred source to see more of our stories on Google.\n\nAdd AP News on Google Add AP News as your preferred source to see more of our stories on Google. Share\n\nSAN JUAN, Puerto Rico (AP) — St. Vincent and the Grenadines on Friday swore in a new prime minister for the first time i...",
    "category": "Unemployment",
    "country": "Saint Vincent and the Grenadines",
    "published_date": "2025-11-01"
  }
]