[
  {
    "id": 4431,
    "title": "Sri Lanka unexpectedly raises rates to fulfil IMF bailout requirements",
    "url": "https://timesofindia.indiatimes.com/business/international-business/sri-lanka-unexpectedly-raises-rates-to-fulfil-imf-bailout-requirements/articleshow/98393532.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "COLOMBO: Sri Lanka 's central bank raised interest rates in an unexpected move on Friday in a bid to help the country secure a bailout package from the International Monetary Fund (IMF) to stabilise its crisis-hit economy.The bank raised its standing deposit facility rate and standing lending facili...",
    "category": "Currency Exchange Rates",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4432,
    "title": "Sri Lanka has already notified Indian Rupee as designated foreign currency: MEA Spokesperson",
    "url": "https://timesofindia.indiatimes.com/videos/news/sri-lanka-has-already-notified-indian-rupee-as-designated-foreign-currency-mea-spokesperson/videoshow/101994751.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Bangladesh Backs India On Delhi Blast At Security Dialogue As Sheikh Hasina Exile Tensions Intensify\n\nIn a major diplomatic development, Bangladesh has officially condemned the Delhi Blast that killed 15 civilians on November 10. Speaking at the Colombo Security Dialogue on November 20, NSA Khalilur...",
    "category": "Currency Exchange Rates",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4433,
    "title": "Sri Lanka cuts key rates as expected; more cuts seen by year-end",
    "url": "https://www.financialexpress.com/policy/economy-sri-lanka-cuts-key-rates-as-expected-more-cuts-seen-by-year-end-3158378/",
    "source": "www.financialexpress.com",
    "description": "Sri Lanka cut its key interest rates for the second consecutive month on Thursday as inflation tapered after last year’s devastating economic crisis and the focus returned to reviving economic growth following a bailout from the International Monetary Fund (IMF).\n\nThe Central Bank of Sri Lanka (CBSL...",
    "category": "Currency Exchange Rates",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4436,
    "title": "Sri Lanka not averse to using Indian rupee as common currency: President Wickremesinghe",
    "url": "https://www.financialexpress.com/policy/economy-sri-lanka-not-averse-to-using-indian-rupee-as-common-currency-president-wickremesinghe-3171759/",
    "source": "www.financialexpress.com",
    "description": "Sri Lanka would want to see the Indian rupee used as much as the US dollar, President Ranil Wickremesinghe has said, days ahead of his first official visit to New Delhi.\n\nWickremesinghe, also the cash-strapped country’s finance minister, made this remark while addressing the Indian CEO Forum here th...",
    "category": "Currency Exchange Rates",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4421,
    "title": "Krishan Balendra Urges Unified Recovery at Sri Lanka Economic & Investment Summit 2025 - Adaderana Biz English",
    "url": "https://bizenglish.adaderana.lk/krishan-balendra-urges-unified-recovery-at-sri-lanka-economic-investment-summit-2025/",
    "source": "bizenglish.adaderana.lk",
    "description": "The Ceylon Chamber of Commerce (CCC) today (02) kicked off the Sri Lanka Economic & Investment Summit 2025 at the Shangri-La Colombo with a strong call for unity, resilience, and renewed economic ambition. Delivering the keynote welcome, Chairperson Krishan Balendra said the Summit—held amid the nat...",
    "category": "Economic Growth",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4422,
    "title": "Sri Lanka facing post-deluge multi-billion rupee recovery bill",
    "url": "https://island.lk/sri-lanka-facing-post-deluge-multi-billion-rupee-recovery-bill/",
    "source": "island.lk",
    "description": "Sri Lanka’s already-stretched public finances are bracing for another significant setback, with senior officials confirming that the economic losses from the recent floods will far exceed initial expectations.\n\nEarly assessments point to a multibillion-rupee recovery bill that will pressure budget a...",
    "category": "Economic Growth",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4424,
    "title": "Climate Threats Mount, but Sri Lanka’s New Report Outlines a Road to Green Recovery",
    "url": "https://www.devdiscourse.com/article/science-environment/3702545-climate-threats-mount-but-sri-lankas-new-report-outlines-a-road-to-green-recovery",
    "source": "www.devdiscourse.com",
    "description": "Sri Lanka’s Country Climate and Development Report (CCDR), prepared by the World Bank with research support from the International Finance Corporation (IFC) and the Multilateral Investment Guarantee Agency (MIGA), presents a vivid account of a nation balancing economic recovery with intensifying cli...",
    "category": "Economic Growth",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4401,
    "title": "Cyclone Ravages Sri Lanka, Japan Boosts Defense, Netanyahu Seeks Pardon: Today’s Top Global News",
    "url": "https://www.psuconnect.in/international-news/cyclone-ravages-sri-lanka-japan-boosts-defense-netanyahu-seeks-pardon-todays-top-global-news",
    "source": "www.psuconnect.in",
    "description": "The world is witnessing a series of dramatic events today, from natural disasters wreaking havoc to major political developments and strategic moves by global powers. Here’s a detailed look at the top international news making headlines right now.\n\n\n\n\n\n1. Cyclone Ditwah Devastates Sri Lanka\n\nSri Lan...",
    "category": "Economy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4402,
    "title": "After Cyclone Ditwah: Climate Proofing Sri Lanka’s Health System",
    "url": "https://groundviews.org/2025/12/02/after-cyclone-ditwah-climate-proofing-sri-lankas-health-system/",
    "source": "groundviews.org",
    "description": "Photo courtesy of UN News\n\nAs Sri Lanka currently counts human and economic costs of Cyclone Ditwah, the images are both disturbing and somewhat familiar: flooded hospitals, access roads buried by landslides, evacuation centres overflowing with displaced families and officials in health and disaster...",
    "category": "Economy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4403,
    "title": "Sri Lanka reels under Cyclone Ditwah, hundreds dead, thousands evacuated",
    "url": "https://www.thehindu.com/videos/sri-lanka-reels-under-cyclone-ditwah-hundreds-dead-thousands-evacuated/article70344827.ece",
    "source": "www.thehindu.com",
    "description": "At least 334 people have died so far, and 370 remain missing as Sri Lanka reels from the devastating impact of Cyclone Ditwah. More than 11 lakh people have been affected and nearly 2 lakh displaced and housed in safety centres, the Disaster Management Centre.",
    "category": "Economy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4396,
    "title": "Cyclone Ditwah may disrupt recovery, hit tourism, supply chains, and banking sector",
    "url": "https://www.hirunews.lk/goldfmnews/433635/cyclone-ditwah-may-disrupt-recovery-hit-tourism-supply-chains-and-banking-sector",
    "source": "www.hirunews.lk",
    "description": "Sri Lanka’s disaster situation is expected to delay the country’s ongoing recovery and may require revisions to growth and fiscal forecasts, though a clearer picture will only emerge once damage assessments and reconstruction plans are finalised.\n\nIn the near term, focus remains on emergency relief ...",
    "category": "Fiscal Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4398,
    "title": "Sri Lanka to extend its visa-free travel policy for 40 countries; India also on the list",
    "url": "https://timesofindia.indiatimes.com/life-style/travel/news/sri-lanka-to-extend-its-visa-free-travel-policy-for-40-countries-india-also-on-the-list/articleshow/122920209.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "India Resumes Tourist Visas For Chinese Citizens 5 Years After 2020 Galwan Valley Clash\n\nNew List of countries:\n\n\n\n\n\nIn a bid to boost tourism and recover from an economic crisis, Sri Lanka has announced plans to extend its free tourist visa policy to 40 additional countries, according to a news sha...",
    "category": "Fiscal Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4377,
    "title": "Time to bury the “6% of GDP for Education” slogan and manage with 2%",
    "url": "https://www.ft.lk/sujata-gamage/Time-to-bury-the-6-of-GDP-for-Education-slogan-and-manage-with-2/10513-784716",
    "source": "www.ft.lk",
    "description": "Rupees 704 billion is allocated for education in the 2026 Budget for Sri Lanka. This amount is the second highest allocation in the Budget and 2% of the projected GDP. This allocation is obviously nowhere near the much-cited goal of 6% GDP for education. What we have is an allocation which, like oth...",
    "category": "GDP",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4378,
    "title": "What AKD missed: Sri Lanka must earn $50 b foreign exchange annually",
    "url": "https://www.ft.lk/rohantha-athukorala/What-AKD-missed-Sri-Lanka-must-earn-50-b-foreign-exchange-annually/19-784884",
    "source": "www.ft.lk",
    "description": "1 Sri Lanka will only be at a 50% implementation on the 2025 capital Budget. President and Finance Minister Anura Kumara Dissanayake delivering the 2026 Budget in Parliament on 7 November\n\nThis turnaround will be a waste unless the growth reforms are done to boost Sri Lanka's foreign exchange reserv...",
    "category": "GDP",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4380,
    "title": "Sri Lanka\u0092s national initiatives align with China\u0092s 15th five-year plan, says Ambassador",
    "url": "https://www.adaderana.lk/news/114989/sri-lankas-national-initiatives-align-with-chinas-15th-five-year-plan-says-ambassador",
    "source": "www.adaderana.lk",
    "description": "“Partnering with China means embracing opportunities. Believing in China means being optimistic about the future. And investing in China means investing in tomorrow,” said Chinese Ambassador to Sri Lanka Qi Zhenhong, highlighting the long-standing friendship between the two countries.\n\nChina has pre...",
    "category": "GDP",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4382,
    "title": "Sri Lanka\u0092s inflation rises to 2.7% in October 2025",
    "url": "https://www.adaderana.lk/news/114958/sri-lankas-inflation-rises-to-27-in-october-2025",
    "source": "www.adaderana.lk",
    "description": "The overall rate of inflation, as measured by the National Consumer Price Index (NCPI) on a year-on-year basis, increased to 2.7% in October 2025, compared to 2.1% in September 2025, according to the latest data released by the Department of Census and Statistics.\n\nMeanwhile, food inflation increase...",
    "category": "Inflation",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4383,
    "title": "CCPI Inflation remains stable at 2.1%",
    "url": "https://www.hirunews.lk/goldfmnews/433723/ccpi-inflation-remains-stable-at-2-1",
    "source": "www.hirunews.lk",
    "description": "The overall inflation rate, as measured by the Colombo Consumer Price Index (CCPI), was recorded at 2.1% in November 2025.\n\nNotably, this figure remains the same as the value recorded in October 2025.\n\nThe Department of Census and Statistics reported a mixed trend within the components.\n\nFood inflat...",
    "category": "Inflation",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4384,
    "title": "Sri Lanka's key consumer price index falls 2.1% in November",
    "url": "https://timesofindia.indiatimes.com/business/international-business/sri-lankas-key-consumer-price-index-falls-2-1-in-november/articleshow/115839021.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Sri Lanka's consumer price index fell 2.1 per cent year-on-year in November after dropping 0.8 per cent in the previous month, the statistics department said on Friday.The Colombo Consumer Price Index , a leading indicator for broader national prices, tracks inflation in Colombo, Sri Lanka's largest...",
    "category": "Inflation",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4385,
    "title": "Sri Lanka holds rates to manage inflation, foster economic stability",
    "url": "https://timesofindia.indiatimes.com/business/international-business/sri-lanka-holds-rates-to-manage-inflation-foster-economic-stability/articleshow/110482542.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "COLOMBO: Sri Lanka 's central bank held interest rates steady on Tuesday to ensure inflation pressures remain in check as authorities look to foster economic stability and lift growth following the South Asian nation's worst financial crisis in decades.The Central Bank of Sri Lanka (CBSL) kept the S...",
    "category": "Inflation",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4409,
    "title": "Sri Lanka: Sri Lanka cuts interest rates to boost growth while waiting for IMF review",
    "url": "https://timesofindia.indiatimes.com/business/international-business/sri-lanka-cuts-interest-rates-to-boost-growth-while-waiting-for-imf-review/articleshow/105461449.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "File photo: Reuters\n\nCOLOMBO: Sri Lanka 's central bank lowered interest rates on Friday in an unexpected move to boost growth , while projecting inflation would remain subdued over the medium term.Helped by its bailout by the International Monetary Fund, the South Asian island nation is recovering ...",
    "category": "Interest Rates",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4411,
    "title": "Sri Lanka cuts interest rates as IMF delays loan",
    "url": "https://timesofindia.indiatimes.com/business/international-business/sri-lanka-cuts-interest-rates-as-imf-delays-loan/articleshow/104176272.cms?from=mdr",
    "source": "timesofindia.indiatimes.com",
    "description": "Crisis-hit Sri Lanka cut interest rates by 100 basis points Thursday as the second instalment of an IMF bailout was held up after the government missed several loan conditions. Colombo had hoped to get the second instalment last month after the first review of the IMF program.\n\nCOLOMBO: Crisis-hit S...",
    "category": "Interest Rates",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4412,
    "title": "India Converted $100 Mn Sri Lanka Loan Into Grant, Reduced Interest Rates: Modi",
    "url": "https://www.businessworld.in/article/india-converted-100-mn-sri-lanka-loan-into-grant-reduced-interest-rates-modi-552742",
    "source": "www.businessworld.in",
    "description": "Prime Minister Narendra Modi has said that India has converted loans worth more than USD 100 million into grants in the last six months and decided to reduce interest rates on existing credit, marking a shift towards providing more immediate and concessional aid to its crisis-hit neighbour.\n\nAddress...",
    "category": "Interest Rates",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4388,
    "title": "Sri Lanka central bank holds interest rate steady ahead of budget, IMF review",
    "url": "https://www.channelnewsasia.com/business/sri-lanka-central-bank-holds-interest-rate-steady-ahead-budget-imf-review-5490701",
    "source": "www.channelnewsasia.com",
    "description": "COLOMBO :Sri Lanka's central bank kept its policy interest rate unchanged on Wednesday as it awaited approval of the country's budget and the latest loan review from the International Monetary Fund.\n\nThe Central Bank of Sri Lanka (CBSL) held the overnight policy rate at 7.75 per cent, as forecast by...",
    "category": "Monetary Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4390,
    "title": "Sri Lanka, official creditors seal $5.9 billion debt revamp deal",
    "url": "https://www.financialexpress.com/policy/economy-sri-lanka-official-creditors-seal-5-9-billion-debt-revamp-deal-3321462/",
    "source": "www.financialexpress.com",
    "description": "Sri Lanka struck an initial deal with a group of key official creditors, including India and the Paris Club, to restructure about $5.9 billion of debt, a key step toward the nation’s efforts to recover from an unprecedented economic crisis.\n\nThe agreement covers a mix of long-term maturity extension...",
    "category": "Monetary Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4391,
    "title": "Lanka’s poverty doubles, employment hits 20-year low – Dr. Nishan De Mel",
    "url": "https://www.hirunews.lk/goldfmnews/432064/lankas-poverty-doubles-employment-hits-20-year-low-dr-nishan-de-mel",
    "source": "www.hirunews.lk",
    "description": "Sri Lanka’s real economic indicators remain troubling, with employment at a 20-year low, real incomes still below 2018 levels, and poverty having doubled since 2019, said Dr. Nishan De Mel, Director of Verité Research, at a seminar on “Impact of the Budget on the National Economy – Way Forward” host...",
    "category": "Monetary Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4392,
    "title": "Central Bank decides to keep policy rate unchanged",
    "url": "https://www.adaderana.lk/news/115135/central-bank-decides-to-keep-policy-rate-unchanged",
    "source": "www.adaderana.lk",
    "description": "The Central Bank of Sri Lanka (CBSL) has decided to maintain the Overnight Policy Rate (OPR) at 7.75%, following its latest Monetary Policy Board meeting held yesterday (25).\n\nThe Board arrived at the decision after considering the evolving developments and the outlook on both domestic and global fr...",
    "category": "Monetary Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4393,
    "title": "Overnight Policy Rate remains unchanged",
    "url": "https://www.hirunews.lk/goldfmnews/432717/overnight-policy-rate-remains-unchanged",
    "source": "www.hirunews.lk",
    "description": "The Central Bank decided to maintain the Monetary Policy Interest Rate (OPR) at 7.75%.\n\nThe Monetary Policy Board of the Central Bank of Sri Lanka made this decision yesterday (25) and decided to keep the rate unchanged.\n\nThe Monetary Policy Board arrived at this decision after considering domestic ...",
    "category": "Monetary Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4394,
    "title": "ADBI-Central Bank of Sri Lanka-APAEA joint workshop on Monetary Policy and Central Banking issues in Asia and the Pacific",
    "url": "https://www.aninews.in/news/business/business/adbi-central-bank-of-sri-lanka-apaea-joint-workshop-on-monetary-policy-and-central-banking-issues-in-asia-and-the-pacific20231024124943/",
    "source": "www.aninews.in",
    "description": "Colombo [Sri Lanka]. October 24 (ANI): The Asian Development Bank Institute (ADBI) along with the Central Bank of Sri Lanka and the Agricultural and Processed Food Products Export Development Authority (APAEA) will conduct a workshop on Monetary policy and Central Banking issues in Asia and Pacific ...",
    "category": "Monetary Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4413,
    "title": "India, Sri Lanka eye deeper trade, investment collaboration",
    "url": "https://timesofindia.indiatimes.com/india/india-sri-lanka-eye-deeper-trade-investment-collaboration/articleshow/116371166.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "NEW DELHI: The bilateral meeting between Prime Minister Narendra Modi and Sri Lankan president Anura Kumara Dissanayake marked a notable advancement in relations, with both nations acknowledging the benefits of the India-Sri Lanka Free Trade Agreement (ISFTA) and consenting to strengthen trade settl...",
    "category": "Trade Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4415,
    "title": "Regional trade push: RBI allows rupee credit to Bhutan, Nepal and Sri Lanka; extends forex repatriation window",
    "url": "https://timesofindia.indiatimes.com/business/india-business/regional-trade-push-rbi-allows-rupee-credit-to-bhutan-nepal-and-sri-lanka-extends-forex-repatriation-window/articleshow/124532224.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "In a move aimed at strengthening regional trade and payment systems, the Reserve Bank of India ( RBI ) on Monday allowed Indian banks and their overseas branches to extend rupee-denominated loans to persons residing in Bhutan, Nepal, and Sri Lanka.The RBI said the step was taken to facilitate cr...",
    "category": "Trade Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4417,
    "title": "Korea–Sri Lanka forum pushes for stronger investment ties",
    "url": "https://www.hirunews.lk/goldfmnews/431449/koreasri-lanka-forum-pushes-for-stronger-investment-ties",
    "source": "www.hirunews.lk",
    "description": "The \"Korea–Sri Lanka Investment Facilitation Forum\" was successfully held in Colombo with the aim of further strengthening bilateral trade and investment cooperation between Sri Lanka and the Republic of Korea.\n\nThe forum, jointly organised by the Embassy of the Republic of Korea, the Board of Inves...",
    "category": "Trade Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4419,
    "title": "Op Sagar Bandhu: India deploys Navy, Army for relief in cyclone-hit Sri Lanka",
    "url": "http://www.uniindia.com/~/op-sagar-bandhu-india-deploys-navy-army-for-relief-in-cyclone-hit-sri-lanka/India/news/3660731.html",
    "source": "www.uniindia.com",
    "description": "Op Sagar Bandhu: India deploys Navy, Army for relief in cyclone-hit Sri Lanka\n\nNew Delhi, Dec 2 (UNI) Reaffirming its commitment under the MAHASAGAR vision and Neighbourhood First policy, India has deployed INS Vikrant, INS Udaygiri, INS Sukanya and a specialised Indian Army contingent to deliver re...",
    "category": "Trade Policy",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4428,
    "title": "Over 365,000 individuals currently unemployed in Sri Lanka \u0096 PM",
    "url": "https://www.adaderana.lk/news/115148/over-365000-individuals-currently-unemployed-in-sri-lanka-pm-",
    "source": "www.adaderana.lk",
    "description": "A total of 365,951 individuals are currently unemployed in Sri Lanka, according to Prime Minister Dr. Harini Amarasuriya.\n\nThe Prime Minister made this revelation today (26) in Parliament, in response to a question raised by the Leader of the Opposition, Sajith Premadasa.\n\nThe Prime Minister emphasi...",
    "category": "Unemployment",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  },
  {
    "id": 4429,
    "title": "Over 365,000 unemployed in Sri Lanka, says PM",
    "url": "https://www.hirunews.lk/goldfmnews/432743/over-365000-unemployed-in-sri-lanka-says-pm",
    "source": "www.hirunews.lk",
    "description": "Prime Minister Harini Amarasuriya stated that 365,951 people in the country are currently facing unemployment.\n\nShe made this statement today (26) in Parliament while responding to a question posed by Opposition Leader Sajith Premadasa.\n\nShe mentioned that according to the 2024 Labour Force Survey, ...",
    "category": "Unemployment",
    "country": "Sri Lanka",
    "published_date": "2025-12-01"
  }
]