[
  {
    "id": 131,
    "title": "Italy presses ahead with claim on central bank's $300 billion gold pile",
    "url": "https://uk.finance.yahoo.com/news/italy-presses-ahead-claim-central-100445666.html",
    "source": "uk.finance.yahoo.com",
    "description": "By Giuseppe Fonte\n\nROME (Reuters) -Italian ruling lawmakers intend to press ahead with a claim that the central bank's $300 billion in gold reserves belong to the state, ​a senator said on Thursday, despite widespread concern that the move could breach EU rules.\n\nSenator Lucio ‌Malan, from Prime Min...",
    "category": "Central Bank",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 145,
    "title": "Currency Exchange Rate Calculator",
    "url": "https://www.mastercard.com/us/en/personal/get-support/currency-exchange-rate-converter.html",
    "source": "www.mastercard.com",
    "description": "This currency converter tool provides foreign exchange rates by Mastercard to convert from the transaction currency to your card's currency for cross-border purchases and ATM transactions.",
    "category": "Currency Exchange Rates",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 146,
    "title": "What Is the Foreign Exchange Market: A Guide",
    "url": "https://www.britannica.com/money/foreign-exchange-market",
    "source": "www.britannica.com",
    "description": "We all know what money is. It’s what we use to buy and sell goods and services and, from a savings and investing standpoint, it’s how we keep score of (i.e., place a value on) the assets we own.\n\nBut money does have a price tag. It’s called an exchange rate, and in the global currency market , it’s ...",
    "category": "Currency Exchange Rates",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 148,
    "title": "Traveling Abroad? Order Currency Before You Go",
    "url": "https://www.nerdwallet.com/travel/learn/order-foreign-currency",
    "source": "www.nerdwallet.com",
    "description": "Upon landing in a foreign country, expect a lot of lines. There’s immigration, passport control and customs inspection. But there’s one line you can — and absolutely should — skip: the airport currency exchange.\n\nNot only does the airport currency exchange counter’s line cut into precious time abroa...",
    "category": "Currency Exchange Rates",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 139,
    "title": "China Factory Activity Slumps for Longest Stretch on Record",
    "url": "https://www.bloomberg.com/news/articles/2025-11-30/chinese-factory-activity-slump-reaches-longest-stretch-on-record",
    "source": "www.bloomberg.com",
    "description": "China’s factory activity improved but remained in contraction in November, extending its streak of declines to a record as the country’s economic slowdown deepens.\n\nThe official manufacturing purchasing managers’ index was 49.2, remaining below the 50 mark that separates growth and contraction for a...",
    "category": "Economic Growth",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 129,
    "title": "The Foundation of the U.S. Economy Appears to Be Breaking, and Wall Street Has Turned a Blind Eye",
    "url": "https://finance.yahoo.com/news/foundation-u-economy-appears-breaking-144400992.html",
    "source": "finance.yahoo.com",
    "description": "To begin with, the delinquency rate for commercial mortgage-backed securities (CMBS) hit an all-time high of 11.76% in October 2025, according to commercial real estate research and analytics firm Trepp. To put this figure into perspective, CMBS delinquencies have increased almost tenfold since 2023...",
    "category": "Economy",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 150,
    "title": "Tim Wu knows where you got your ‘economic resentment’ and that ‘weird feeling of something you like getting worse’: It’s ‘the age of extraction’",
    "url": "https://fortune.com/2025/11/30/tim-wu-interview-economic-resentment-angry-politics-weird-feeling-age-of-extraction/",
    "source": "fortune.com",
    "description": "Tim Wu, the influential Columbia Law School professor who previously served in the Biden administration, is back with a message: Modern American capitalism has devolved into a system defined by the accumulation of market power and “extraction,” generating a profound sense of “economic resentment” ac...",
    "category": "Economy",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 121,
    "title": "Scott Bessent says ‘move from a blue state to a red state’ is No. 1 way to beat inflation, leaving critics stunned",
    "url": "https://finance.yahoo.com/news/scott-bessent-says-move-blue-144300057.html",
    "source": "finance.yahoo.com",
    "description": "There’s also the question of whether the red-vs.-blue inflation claim holds up. While Bessent cited the Council of Economic Advisers, the CEA does not appear to have published a state-level inflation analysis showing a 0.5% gap (4).\n\nSocial media echoed the sentiment. One top comment on X read: “Gre...",
    "category": "Inflation",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 149,
    "title": "Why you may not want lower prices as much as you think you do",
    "url": "https://www.washingtonpost.com/business/2025/11/30/consumer-high-prices-economy/",
    "source": "www.washingtonpost.com",
    "description": "Americans keep saying it: They want lower prices. Groceries have swelled 25 percent in the past five years. The average price of a new car just topped $50,000. Energy bills are soaring, as are health care premiums and child care costs. And housing has come up as much as 30 percent since 2020, for bo...",
    "category": "Inflation",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 133,
    "title": "Mortgage and refinance interest rates today, November 30, 2025: The 6% 30-year mortgage is back, could 5% be next?",
    "url": "https://finance.yahoo.com/personal-finance/mortgages/article/mortgage-refinance-rates-today-sunday-november-30-2025-110044524.html",
    "source": "finance.yahoo.com",
    "description": "Mortgage rates vary across the nation, but some borrowers are getting the lowest rates in a long time. According to Zillow data, the current 30-year fixed average mortgage rate is 6.00%. The 15-year fixed rate is 5.50%. Last Wednesday, Freddie Mac reported a 6.23% 30-year rate. That tells you just h...",
    "category": "Interest Rates",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 124,
    "title": "A compass for monetary policy under model uncertainty",
    "url": "https://cepr.org/voxeu/columns/compass-monetary-policy-under-model-uncertainty",
    "source": "cepr.org",
    "description": "Central banks routinely face two forms of uncertainty when setting monetary policy. One concerns the economic model: different structural models can generate different trade-offs and often imply very different policy responses. The other is about the horizon of stabilisation: should policy react equ...",
    "category": "Monetary Policy",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 135,
    "title": "Trade Policy Review: Tunisia",
    "url": "https://www.wto.org/english/tratop_e/tpr_e/tpr_tun_25nov25_e.htm",
    "source": "www.wto.org",
    "description": "The following documents are available:\n\nSecretariat report\n\nA detailed report written independently by the WTO Secretariat.\n\nGovernment report\n\nA policy statement by the government of the member under review.\n\nConcluding remarks\n\nFrom the meeting\n\nThe Secretariat and Government reports are discussed...",
    "category": "Trade Policy",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 136,
    "title": "Nick Russell, Associate, International Trade Policy",
    "url": "https://www.akingump.com/en/lawyers-advisors/nick-russell",
    "source": "www.akingump.com",
    "description": "",
    "category": "Trade Policy",
    "country": "Global",
    "published_date": "2025-11-30"
  },
  {
    "id": 144,
    "title": "I Lost My Job and Drained My Savings. It Taught Me to Lean on People",
    "url": "https://www.businessinsider.com/lost-my-job-year-unemployed-make-ends-meet-new-perspective-2025-11",
    "source": "www.businessinsider.com",
    "description": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThis as-told-to essay is based on a conversation with Keijhon Francis, a 29-year-old communications specialist based in Brooklyn, NY. The following has been edited for length and clarity.\n\n...",
    "category": "Unemployment",
    "country": "Global",
    "published_date": "2025-11-30"
  }
]