[
  {
    "id": 5039,
    "title": "Economic Hardship Deepens In Yemen",
    "url": "https://www.miragenews.com/economic-hardship-deepens-in-yemen-1571694/",
    "source": "www.miragenews.com",
    "description": "Washington, November 17, 2025 - Yemen's economy remained under severe strain in the first half of 2025 as the continued blockade on oil exports, rising inflation, and declining aid have compounded with years of conflict and institutional division, according to the World Bank's latest Yemen Economic ...",
    "category": "Economy",
    "country": "Yemen",
    "published_date": "2025-12-01"
  },
  {
    "id": 5038,
    "title": "Budget 2025: Govt Set to Beat Fiscal Target, FY26 Challenges Ahead",
    "url": "https://www.siliconindia.com/news/general/budget-2025-govt-set-to-beat-fiscal-target-fy26-challenges-ahead-nid-233920-cid-1.html",
    "source": "www.siliconindia.com",
    "description": "As India gets ready for Budget 2025, HSBC believes that the government would close FY25 with a fiscal deficit of 4.8% of GDP, better than the budgeted estimate of 4.9%. A downturn in capex, primarily on account of delayed project approvals in election years, is the driving force behind this improvem...",
    "category": "Fiscal Policy",
    "country": "Yemen",
    "published_date": "2025-12-01"
  },
  {
    "id": 5036,
    "title": "World Bank Warns Yemen Faces Deepening Economic Crisis Amid Conflict and Blockade",
    "url": "https://www.devdiscourse.com/article/business/3701685-world-bank-warns-yemen-faces-deepening-economic-crisis-amid-conflict-and-blockade",
    "source": "www.devdiscourse.com",
    "description": "Yemen’s economy suffered further deterioration in the first half of 2025, with conflict-driven fragmentation, a blockade on oil exports, rising inflation, and dramatically reduced humanitarian assistance converging to push millions of Yemenis into deeper hardship. These findings come from the World ...",
    "category": "Inflation",
    "country": "Yemen",
    "published_date": "2025-12-01"
  },
  {
    "id": 5040,
    "title": "Why have interest rates fallen, and what does it mean?",
    "url": "https://www.aol.co.uk/news/why-interest-rates-fallen-does-153303830.html",
    "source": "www.aol.co.uk",
    "description": "The Bank of England has cut interest rates for the first time in four years, after inflation fell back to normal levels earlier this year.\n\nRates had been at a 16-year high of 5.25% since last summer – but on Thursday, they finally started to come down.\n\nHere the PA news agency looks at what the dec...",
    "category": "Interest Rates",
    "country": "Yemen",
    "published_date": "2025-12-01"
  }
]