[
  {
    "id": 2859,
    "title": "Beware of ‘No Down Payment’ Loan Scams in Kuwait",
    "url": "https://www.arabtimesonline.com/news/beware-of-no-down-payment-loan-scams-in-kuwait/",
    "source": "www.arabtimesonline.com",
    "description": "KUWAIT CITY, Nov 30: Kuwait’s Central Bank and banking authorities have issued a strong warning to the public about the growing circulation of fraudulent advertisements on social media platforms. These ads often lure individuals with phrases such as “quick loan” or “no down payment,” targeting those...",
    "category": "Central Bank",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2860,
    "title": "S&P raises Kuwait’s sovereign credit rating to AA- with stable outlook",
    "url": "https://www.arabtimesonline.com/news/sp-raises-kuwaits-sovereign-credit-rating-to-aa-with-stable-outlook/",
    "source": "www.arabtimesonline.com",
    "description": "KUWAIT CITY, Nov 22: Standard & Poor’s (S&P) Global Ratings raised Kuwait’s sovereign credit rating from A+ to AA- on Friday while maintaining a stable outlook, citing progress in public finance reforms, the Central Bank of Kuwait announced.\n\nIn a statement to Kuwait News Agency (KUNA), the Central ...",
    "category": "Central Bank",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2868,
    "title": "Gulf homes are 'creativity platforms' for promising projects: Kuwait minister",
    "url": "https://www.arabtimesonline.com/news/gulf-homes-are-creativity-platforms-for-promising-projects-kuwait-minister/",
    "source": "www.arabtimesonline.com",
    "description": "KUWAIT CITY, Nov 30: Gulf homes have become “creativity platforms” for promising projects, Kuwaiti Minister of Social Affairs, Family and Childhood Affairs Dr. Amthal Al-Huwailah said Sunday, affirming that Gulf youth “no longer wait for opportunities, but create them with their own hands and turn t...",
    "category": "Economic Growth",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2869,
    "title": "GCC moves closer to forming unified civil aviation authority, says Kuwait official",
    "url": "https://www.arabianbusiness.com/industries/transport/gcc-moves-closer-to-forming-unified-civil-aviation-authority-kuwait-confirms",
    "source": "www.arabianbusiness.com",
    "description": "The Gulf Cooperation Council (GCC) is moving towards establishing a unified civil aviation authority following a recommendation by the GCC Executive Committee for Civil Aviation, according to Sheikh Humoud Mubarak Al-Sabah, Chief of Kuwait’s Directorate General of Civil Aviation.\n\nSpeaking to the Ku...",
    "category": "Economic Growth",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2851,
    "title": "Key economic figures define Kuwait’s 2025–2026 outlook",
    "url": "https://www.arabtimesonline.com/news/key-economic-figures-define-kuwaits-20252026-outlook/",
    "source": "www.arabtimesonline.com",
    "description": "Six essential figures define the Kuwaiti economy and shape our economic situation, thereby explaining our 2025–2026 budget. These figures indicate the breakdown, borrowing needs and available options. Our budget calls for total expenses of KD24 billion, with a deficit of KD6 billion. The budget is b...",
    "category": "Economy",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2852,
    "title": "New Digital Commerce Law Set to Transform Kuwait’s Online Economy",
    "url": "https://www.arabtimesonline.com/news/new-digital-commerce-law-set-to-transform-kuwaits-online-economy/",
    "source": "www.arabtimesonline.com",
    "description": "KUWAIT CITY, Nov 18: The Kuwaiti Cabinet convened its weekly meeting on Tuesday morning at Bayan Palace, chaired by His Highness the Prime Minister Sheikh Ahmed Al-Abdullah. Following the session, Deputy Prime Minister and Minister of State for Cabinet Affairs Shereed Al-Maousherji issued a detailed...",
    "category": "Economy",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2858,
    "title": "Kuwait doubles residency fees, introduces 15-year golden visa",
    "url": "https://english.mathrubhumi.com/news/world/kuwait-doubles-residency-fees-introduces-15-year-golden-visa-q2l6iqbd",
    "source": "english.mathrubhumi.com",
    "description": "Kuwait’s immigration system overhaul represent one of the most extensive revisions to the country’s residency framework in years, affecting hundreds of thousands of expatriates who comprise the majority of the Gulf nation's workforce.\n\nKuwait has unveiled a sweeping overhaul of its immigration syste...",
    "category": "Economy",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2850,
    "title": "5 key figures driving Kuwait’s fiscal policy",
    "url": "https://www.arabtimesonline.com/news/5-key-figures-driving-kuwaits-fiscal-policy/",
    "source": "www.arabtimesonline.com",
    "description": "Here are five important figures shaping Kuwait’s current fiscal policy, which directly affect our daily lives through spending and expenses. Over the past 10 years, the country has faced ongoing annual budget deficits, which are increasing year by year due to population growth, rising daily expendit...",
    "category": "Fiscal Policy",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2848,
    "title": "Investors coming to Kuwait examine legal patronage",
    "url": "https://www.arabtimesonline.com/news/investors-coming-to-kuwait-examine-legal-patronage/",
    "source": "www.arabtimesonline.com",
    "description": "Global inflation has reached critical levels, affecting economies worldwide. Some countries have managed to cope, thanks to prudent policies, which mitigated the impact of rising prices while boosting GDP and reducing local inflation rates. These countries are also utilizing their national wealth to...",
    "category": "Inflation",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2863,
    "title": "Gold prices surge to $4,218 an ounce on US interest rate cut hopes",
    "url": "https://www.arabtimesonline.com/news/gold-prices-surge-to-4218-an-ounce-on-us-interest-rate-cut-hopes/",
    "source": "www.arabtimesonline.com",
    "description": "KUWAIT CITY, Nov 30: Gold prices rose to USD 4,218 per ounce at the close of last week’s trading, supported by expectations that the US Federal Reserve will cut interest rates in December, according to a report issued Sunday by Kuwaiti company Dar Al-Sabaik.\n\nThe report noted that limited economic d...",
    "category": "Interest Rates",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  },
  {
    "id": 2864,
    "title": "PM outlines Vietnam’s development vision, strategic ties with Kuwait in policy address",
    "url": "https://en.vietnamplus.vn/pm-outlines-vietnams-development-vision-strategic-ties-with-kuwait-in-policy-address-post332762.vnp",
    "source": "en.vietnamplus.vn",
    "description": "Kuwait City (VNA) – Vietnamese Prime Minister Pham Minh Chinh delivered a policy speech at the Kuwait Diplomatic Institute on November 18 as part of his official visit to Kuwait, stressing that Vietnam–Kuwait relations are entering a period of dynamic transformation and hold the potential to become ...",
    "category": "Trade Policy",
    "country": "Kuwait",
    "published_date": "2025-11-01"
  }
]