[
  {
    "id": 4334,
    "title": "Appeal to President Kiir to restore South Sudan’s roads for economic recovery",
    "url": "https://www.radiotamazuj.org/en/news/article/appeal-to-president-kiir-to-restore-south-sudans-roads-for-economic-recovery",
    "source": "www.radiotamazuj.org",
    "description": "Dear Gen. Salva Kiir Mayardit,\n\nYour Excellency,\n\nI write with utmost respect and patriotism to draw your attention to the critical state of our national infrastructure, particularly the major road networks that are essential for the economic stability and the well-being of our people. As the countr...",
    "category": "Economy",
    "country": "South Sudan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4324,
    "title": "South Sudan should adopt Chinese experience as a guide to prosperity - Radio Tamazuj",
    "url": "https://www.radiotamazuj.org/en/news/article/opinion-south-sudan-should-adopt-chinese-experience-as-a-guide-to-prosperity",
    "source": "www.radiotamazuj.org",
    "description": "Since the Communist Party of China embarked on reform and opening up to the outside world in 1978, the Chinese modernization has been an iconic phrase whose connotation is largely associated, not only with the economic miracle of the People’s Republic of China, but also with cultural advancement, in...",
    "category": "GDP",
    "country": "South Sudan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4325,
    "title": "Why South Sudan needs a copyright law now - Radio Tamazuj",
    "url": "https://www.radiotamazuj.org/en/news/article/opinion-why-south-sudan-needs-a-copyright-law-now",
    "source": "www.radiotamazuj.org",
    "description": "South Sudan’s creative community, musicians, writers, filmmakers, designers and broadcasters, is growing in talent and ambition. Yet many creators still work without the legal framework that turns creative labor into enforceable rights, predictable income and investments.\n\nThe result: lost revenue, ...",
    "category": "GDP",
    "country": "South Sudan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4332,
    "title": "Sudan: New SDG 2,000 Banknote 'Reflects Contradictory Policy By Central Bank of Sudan'",
    "url": "https://allafrica.com/stories/202511070008.html",
    "source": "allafrica.com",
    "description": "Khartoum — The announcement by the Central Bank of Sudan (CBoS) that it is issuing a new SDG 2,000 banknote - and entirely new denomination - , as well as the issuance of a new SDG 500 banknote, reflects \"a dual and contradictory monetary policy\", says financial analyst Ahmed Ben Omar in an intervie...",
    "category": "Monetary Policy",
    "country": "South Sudan",
    "published_date": "2025-11-01"
  }
]