[
  {
    "id": 3760,
    "title": "NPCI International and the Central Reserve Bank of Peru Partner to Develop UPI-Like Real-Time Payments System in Peru",
    "url": "https://www.aninews.in/news/business/npci-international-and-the-central-reserve-bank-of-peru-partner-to-develop-upi-like-real-time-payments-system-in-peru20240606105118/",
    "source": "www.aninews.in",
    "description": "PRNewswire\n\nMumbai (Maharashtra) [India], June 6: NPCI International Payments Limited (NIPL) and the Central Reserve Bank of Peru (BCRP) have announced a partnership to enable the deployment of a UPI-like real-time payments system in Peru. This collaboration marks a significant milestone, making Per...",
    "category": "Central Bank",
    "country": "Peru",
    "published_date": "2025-12-01"
  },
  {
    "id": 3763,
    "title": "NPCI & Central Reserve Bank of Peru Partners to expand Online Payment system",
    "url": "https://www.siliconindia.com/news/startups/npci--central-reserve-bank-of-peru-partners-to-expand-online-payment-system-nid-230006-cid-19.html",
    "source": "www.siliconindia.com",
    "description": "NPCI International Payments Limited (NIPL) and the Central Reserve Bank of Peru (BCRP) has recently joined hands to introduce their India's UPI-like real-time payments system in Peru.\n\nThis union will make Peru the first country in South America to adopt the renowned UPI technology from India.This p...",
    "category": "Central Bank",
    "country": "Peru",
    "published_date": "2025-12-01"
  },
  {
    "id": 3768,
    "title": "Peru accelerates highway project on USD 3.4 bn deal with Spanish firms",
    "url": "https://auto.economictimes.indiatimes.com/news/industry/peru-accelerates-highway-project-on-usd-3-4-bn-deal-with-spanish-firms/109064046",
    "source": "auto.economictimes.indiatimes.com",
    "description": "Advt\n\nUntitled Carousel\n\n'One Vehicle, One FASTag' norm comes into force The National Highways Authority of India (NHAI) has implemented the 'One Vehicle, One FASTag' rule to deter the use of a single FASTag for multiple vehicles. Effective from April 1, users with multiple FASTags for one vehicle w...",
    "category": "Economic Growth",
    "country": "Peru",
    "published_date": "2025-12-01"
  },
  {
    "id": 3753,
    "title": "Peru budget watchdog flags risks posed by 'out of control' deficit",
    "url": "https://www.livemint.com/news/peru-budget-watchdog-flags-risks-posed-by-out-of-control-deficit-11728501362619.html",
    "source": "www.livemint.com",
    "description": "LIMA, Oct 9 (Reuters) - The management of Peru's public finances has led to an \"out of control\" increase in the government's budget deficit, which has surpassed its own target, an autonomous state watchdog said on Wednesday.\n\nPeru's mining-dependent economy, for years a standout performer in South A...",
    "category": "Economy",
    "country": "Peru",
    "published_date": "2025-12-01"
  },
  {
    "id": 3755,
    "title": "India, Peru to begin sixth round of FTA talks today",
    "url": "https://www.financialexpress.com/policy/economy-india-peru-to-begin-sixth-round-of-fta-talks-today-3390982/",
    "source": "www.financialexpress.com",
    "description": "As negotiators from India and Peru start the next round of talks on a bilateral Free Trade Agreement in Lima today, the tariff concessions on gold would be the most challenging issue for New Delhi.\n\nNegotiators will meet for the sixth round of talks from February 12 to 15 and from the Indian side di...",
    "category": "Economy",
    "country": "Peru",
    "published_date": "2025-12-01"
  },
  {
    "id": 3757,
    "title": "NIPL ties up with Central Bank of Peru for UPI-like payment system in Peru",
    "url": "https://www.zeebiz.com/economy-infra/world-economy/news-nipl-ties-up-with-central-bank-of-peru-for-upi-like-payment-system-in-peru-294344",
    "source": "www.zeebiz.com",
    "description": "NPCI International Payments Limited (NIPL) and the Central Reserve Bank of Peru (BCRP) have announced a partnership on Wednesday to enable the deployment of a UPI-like real-time payments system in Peru.\n\nThis collaboration makes Peru the first country in South America to adopt Unified Payment Interf...",
    "category": "Economy",
    "country": "Peru",
    "published_date": "2025-12-01"
  },
  {
    "id": 3758,
    "title": "Talks on India-Peru trade pact from Oct 10: Govt",
    "url": "https://www.financialexpress.com/policy/economy-talks-on-india-peru-trade-pact-from-oct-10-govt-3267796/",
    "source": "www.financialexpress.com",
    "description": "The next round of negotiations for a trade agreement between India and South American nation Peru will start from October 10, an official statement said on Monday.The agreement is aimed at promoting bilateral trade and investments between the two countries. With the pact, the two trading partners wi...",
    "category": "Economy",
    "country": "Peru",
    "published_date": "2025-12-01"
  },
  {
    "id": 3765,
    "title": "Critical minerals central to FTAs with Chile, Peru",
    "url": "https://www.financialexpress.com/policy/economy/critical-minerals-central-to-ftas-with-chile-peru/4034647/",
    "source": "www.financialexpress.com",
    "description": "In the latest round of negotiations for free trade agreements (FTAs) with Peru and Chile, New Delhi made substantial progress, with discussions on critical minerals supplies figuring prominently.\n\nA team of negotiators from India visited Lima from November 3-5, for the 9th round of discussions on th...",
    "category": "Trade Policy",
    "country": "Peru",
    "published_date": "2025-12-01"
  },
  {
    "id": 3767,
    "title": "Australia Appoints New Ambassador To Peru 30 November",
    "url": "https://www.miragenews.com/australia-appoints-new-ambassador-to-peru-30-1580186/",
    "source": "www.miragenews.com",
    "description": "Department of Foreign Affairs and Trade\n\nToday I announce the appointment of Mr James Yeomans as Australia's next Ambassador to Peru, with non-resident accreditation to Bolivia.\n\nAustralia and Peru cooperate on a range of issues of mutual interest and have a strong and growing trading relationship, ...",
    "category": "Trade Policy",
    "country": "Peru",
    "published_date": "2025-12-01"
  }
]