[
  {
    "id": 275,
    "title": "Afghani weakens as US dollar surges despite Taliban’s efforts",
    "url": "https://amu.tv/168196/",
    "source": "amu.tv",
    "description": "KABUL — The Afghani has sharply depreciated against the U.S. dollar over the past week, with the exchange rate rising by nearly 300 Afghanis per hundred dollars in just three days, despite continued efforts by the Taliban-run central bank to stabilize the currency.\n\nDa Afghanistan Bank, the country’...",
    "category": "Currency Exchange Rates",
    "country": "Afghanistan",
    "published_date": "2025-04-01"
  },
  {
    "id": 270,
    "title": "Afghanistan’s Economic Growth Lags Behind Population Increase, Says World Bank",
    "url": "https://www.afintl.com/en/202504238617",
    "source": "www.afintl.com",
    "description": "In its latest report released on Wednesday, the World Bank stated that Afghanistan’s economy is projected to grow by 2.5 percent in the fiscal year 2024–2025, slower than the country’s population growth rate.\n\nThe Bank further forecasts that economic growth will average just 2.2 percent in the fisca...",
    "category": "Economic Growth",
    "country": "Afghanistan",
    "published_date": "2025-04-01"
  },
  {
    "id": 258,
    "title": "Afghanistan’s socioeconomic crisis deepens amid crackdown on women’s rights",
    "url": "https://news.un.org/en/story/2025/04/1162841",
    "source": "news.un.org",
    "description": "As the Afghan economy faces stalled local production and weak job creation, Afghanistan continues to heavily rely on imports and international assistance.\n\n“UNDP’s current analysis and new data indicate the continuation of a deeply troubling trajectory for the Afghan people, who have been grappling ...",
    "category": "Economy",
    "country": "Afghanistan",
    "published_date": "2025-04-01"
  },
  {
    "id": 245,
    "title": "IMF projects Afghanistan’s GDP growth at 2.6% in 2025 amid global slowdown",
    "url": "https://amu.tv/170291/",
    "source": "amu.tv",
    "description": "Afghanistan’s economy is projected to grow by 2.6 percent in 2025, according to the International Monetary Fund’s latest World Economic Outlook released this week. This forecast places Afghanistan near the bottom of regional growth expectations, reflecting both internal economic constraints and the ...",
    "category": "GDP",
    "country": "Afghanistan",
    "published_date": "2025-04-01"
  },
  {
    "id": 720,
    "title": "RBI April 9 Repo Rate Highlights: 'These are episodes, not failures - RBI Guv Sanjay Malhotra on IndusInd crisis",
    "url": "https://www.moneycontrol.com/news/business/rbi-monetary-policy-mpc-meet-meeting-live-updates-rbi-repo-rate-cut-news-governor-sanjay-malhotra-reserve-bank-of-india-liveblog-12989140.html",
    "source": "www.moneycontrol.com",
    "description": "RBI Repo Rate News Live: 'This reduction is expected to improve home loan affordability'\n\n\"We welcome the RBI’s decision to cut the repo rate by 25 basis points to 6.00%. In the face of global economic uncertainty driven by rising tariffs and geopolitical tensions, this move signals a continued tilt...",
    "category": "Monetary Policy",
    "country": "Afghanistan",
    "published_date": "2025-04-01"
  }
]