[
  {
    "id": 1292,
    "title": "Brazil's Central Bank Holds Rates Again as Inflation Sticks — Update",
    "url": "https://www.morningstar.com/news/dow-jones/2025110518061/brazils-central-bank-holds-rates-again-as-inflation-sticks-update",
    "source": "www.morningstar.com",
    "description": "By Paulo Trevisani\n\nBrazil's central bank on Wednesday kept its benchmark rate at one of the highest levels in the world for a third consecutive time, as inflation remains above target.\n\nThe monetary policy committee, known as Copom, kept its Selic short-term rate at 15% and indicated it could remai...",
    "category": "Central Bank",
    "country": "Brazil",
    "published_date": "2025-11-01"
  },
  {
    "id": 1312,
    "title": "Global South to write 21st century's growth story",
    "url": "https://www.thedailystar.net/opinion/views/news/global-south-write-21st-centurys-growth-story-4042706",
    "source": "www.thedailystar.net",
    "description": "As the impacts of climate change become more severe with deadly heatwaves, eroding coastlines, rising food prices, and increasing social and economic instability, affected countries, particularly poor ones, are getting concerned about having to slow their development while addressing climate change....",
    "category": "Economic Growth",
    "country": "Brazil",
    "published_date": "2025-11-01"
  },
  {
    "id": 1287,
    "title": "MercadoLibre tries to woo Brazil’s online shoppers as Amazon, Shein close in",
    "url": "https://www.batimes.com.ar/news/economy/amazon-and-shopee-are-challenging-mercadolibres-e-commerce-market-dominance.phtml",
    "source": "www.batimes.com.ar",
    "description": "MercadoLibre Inc has long dominated the online-shopping market in Latin America, but this holiday season, it finds itself in a fight to fend off rivals from both ends of the Pacific Ocean.\n\nOn one side, there’s Amazon.com Inc, a global behemoth with seemingly endless resources. On the other, Asian p...",
    "category": "Economy",
    "country": "Brazil",
    "published_date": "2025-11-01"
  },
  {
    "id": 1299,
    "title": "Brazil offers lesson in winning in Trump’s economic ‘Taco’ trade style",
    "url": "https://www.irishtimes.com/business/2025/11/29/brazil-offers-lesson-in-winning-in-trumps-economic-taco-trade-style/",
    "source": "www.irishtimes.com",
    "description": "US president Donald Trump (right) with Brazil's president Lula da Silva of Brazil during a bilateral meeting in Kuala Lumpur in October. Photograph: Haiyun Jiang/The New York Times\n\nHow do you say “Taco” – as in “Trump Always Chickens Out” – in Portuguese? It is a question some Brazilians might ask ...",
    "category": "Trade Policy",
    "country": "Brazil",
    "published_date": "2025-11-01"
  },
  {
    "id": 1300,
    "title": "Trump removes 40pc tariff on Brazilian beef in latest major shift to US trade settings",
    "url": "https://www.beefcentral.com/news/trump-removes-40-percent-tariff-on-brazilian-beef-in-latest-major-shift-to-us-trade-settings/",
    "source": "www.beefcentral.com",
    "description": "The United States has this morning (Australian time) formally removed a 40 percent tariff previously imposed on Brazilian beef, in a development that represents another significant shift in US agricultural trade policy.\n\nAt one point this year beef sold from Brazil to the US had faced tariff imposts...",
    "category": "Trade Policy",
    "country": "Brazil",
    "published_date": "2025-11-01"
  }
]