[
  {
    "id": 3110,
    "title": "Women, older people drive Maltese employment to record highs despite surge in foreign workers",
    "url": "https://www.maltatoday.com.mt/news/national/138347/women_older_people_drive_maltese_employment_to_record_highs_despite_surge_in_foreign_workers",
    "source": "www.maltatoday.com.mt",
    "description": "The increase in Maltese workers over the past decade was the strongest ever recorded— equal in absolute terms to the previous three decades combined.\n\nNonetheless, foreign workers still accounted for around three-quarters of employment growth since 2013.\n\nThis emerges from a Central Bank of Malta re...",
    "category": "Central Bank",
    "country": "Malta",
    "published_date": "2025-12-01"
  },
  {
    "id": 3108,
    "title": "Nationalist Party says Malta Vision 2050 could be more ambitious and people-focused",
    "url": "https://www.maltatoday.com.mt/news/national/138161/nationalist_party_says_malta_vision_2050_could_be_more_ambitious_and_peoplefocused",
    "source": "www.maltatoday.com.mt",
    "description": "The Nationalist Party has called for a more ambitious and people-focused Malta Vision 2050, saying the plan should prioritise quality of life over quantity-driven growth.\n\nThe PN said it should set a clear path toward a sustainable, inclusive future that genuinely improves lives across Malta and Goz...",
    "category": "Economy",
    "country": "Malta",
    "published_date": "2025-12-01"
  },
  {
    "id": 3106,
    "title": "PN warns Malta risks losing fiscal autonomy after EU flags concerns on Budget 2026",
    "url": "https://www.maltatoday.com.mt/news/national/138437/pn_warns_malta_risks_losing_fiscal_autonomy_after_eu_flags_concerns_on_budget_2026",
    "source": "www.maltatoday.com.mt",
    "description": "The Nationalist Party has warned that Malta risks losing autonomy over its public finances after the European Commission cautioned that the government’s 2026 budget may not comply with EU fiscal rules.\n\n“The financial mismanagement of Robert Abela’s government, which has severely missed its own fisc...",
    "category": "Fiscal Policy",
    "country": "Malta",
    "published_date": "2025-12-01"
  },
  {
    "id": 3103,
    "title": "Malta needs to trim expenditure in 2026, European Commission warns",
    "url": "https://www.maltatoday.com.mt/news/national/138417/malta_needs_to_trim_expenditure_in_2026_european_commission_warns",
    "source": "www.maltatoday.com.mt",
    "description": "Malta’s 2026 budget risks being non-compliant with European Council recommendations to be able to exit the excessive deficit procedure, the European Commission has warned.\n\nMalta’s cumulative expenditure growth is beyond what was agreed with the council, the commission said in its opinion published ...",
    "category": "GDP",
    "country": "Malta",
    "published_date": "2025-12-01"
  },
  {
    "id": 3104,
    "title": "Malta cuts taxes for parents in bid to revive native birth rate",
    "url": "https://au.news.yahoo.com/malta-cuts-taxes-parents-bid-183427551.html",
    "source": "au.news.yahoo.com",
    "description": "VALLETTA (Reuters) -Malta announced tax cuts for parents of two or more children on Monday, in a government bid ​to counter its demographic decline.\n\nFinance Minister Clyde Caruana told parliament that the ‌rock-bottom fertility rate of the Mediterranean island's native population was the \"biggest c...",
    "category": "GDP",
    "country": "Malta",
    "published_date": "2025-12-01"
  },
  {
    "id": 3105,
    "title": "October inflation in Malta edges up to 2.5%",
    "url": "https://www.maltatoday.com.mt/news/national/138278/october_inflation_in_malta_edges_up_to_25",
    "source": "www.maltatoday.com.mt",
    "description": "Annual inflation in October stood at 2.5%, an increase of 0.1 points over September, according to the Harmonised Index of Consumer Prices (HICP).\n\nThe figures released on Wednesday by the National Statistics Office (NSO) show that the highest annual inflation rates were recorded in education (4.3%) ...",
    "category": "Inflation",
    "country": "Malta",
    "published_date": "2025-12-01"
  },
  {
    "id": 3112,
    "title": "Trader jailed for 14 years for rigging Libor interest rates",
    "url": "https://www.maltatoday.com.mt/news/world/55788/trader_jailed_for_14_years_for_rigging_libor_interest_rates",
    "source": "www.maltatoday.com.mt",
    "description": "Former City trader Tom Hayes was sentenced to 14 years in prison after a London court found him guilty of rigging global Libor interest rates.\n\nThe 35-year-old from Hampshire became the first person to be convicted by a jury of manipulating the London interbank offered rate (Libor)- a benchmark for ...",
    "category": "Interest Rates",
    "country": "Malta",
    "published_date": "2025-12-01"
  }
]