[
  {
    "id": 3699,
    "title": "Israeli settlers assault foreign activists in West Bank, leaving one critically wounded",
    "url": "https://www.tehrantimes.com/news/521027/Israeli-settlers-assault-foreign-activists-in-West-Bank-leaving",
    "source": "www.tehrantimes.com",
    "description": "The Israeli military launched a large-scale arrest campaign in the occupied West Bank as illegal settlers attacked foreign activists and Palestinians on Sunday, Anadolu reported, citing local sources.\n\nThree Italian and one Canadian activists were injured by illegal Israeli settlers in Ein ad-Duyuk ...",
    "category": "Central Bank",
    "country": "Palestine",
    "published_date": "2025-11-01"
  },
  {
    "id": 3700,
    "title": "UNSC resolution drafters Ignored UN central role on Palestine",
    "url": "https://en.mehrnews.com/news/238950/UNSC-resolution-drafters-Ignored-UN-central-role-on-Palestine",
    "source": "en.mehrnews.com",
    "description": "According to Mehr News Agency,the full text of the statement of the Ministry of Foreign Affairs of the Islamic Republic of Iran regarding the UN Security Council resolution on Gaza is as follows:\n\n1-The Ministry of Foreign Affairs of the Islamic Republic of Iran, while supporting any regional or int...",
    "category": "Central Bank",
    "country": "Palestine",
    "published_date": "2025-11-01"
  },
  {
    "id": 3694,
    "title": "Gaza Economy at 13 Percent of Pre-Genocide Level, With Worst Collapse on Record",
    "url": "https://truthout.org/articles/gaza-economy-at-13-percent-of-pre-genocide-level-with-worst-collapse-on-record/",
    "source": "truthout.org",
    "description": "“Multidimensional poverty now engulfs all Gazans,” one UN official said.\n\nHonest, paywall-free news is rare. Please support our boldly independent journalism with a donation of any size.\n\nIsrael’s genocide has destroyed nearly 90 percent of Gaza’s economy, causing the worst economic collapse ever re...",
    "category": "Economy",
    "country": "Palestine",
    "published_date": "2025-11-01"
  },
  {
    "id": 3696,
    "title": "Malaysia commits to Palestine rebuilding efforts with digital aid",
    "url": "https://www.thestar.com.my/news/nation/2025/11/21/malaysia-commits-to-palestine-rebuilding-efforts-with-digital-aid",
    "source": "www.thestar.com.my",
    "description": "BAKU (Azerbaijan): Malaysia has committed to supporting Palestine’s reconstruction, particularly in digital infrastructure, and sharing its telecommunications experience with South Africa, says Datuk Fahmi Fadzil (pic).\n\nThe Communications Minister said the matter was discussed in a meeting with the...",
    "category": "Economy",
    "country": "Palestine",
    "published_date": "2025-11-01"
  },
  {
    "id": 3691,
    "title": "Gaza's economy shrinks 83%: Inside the unprecedented collapse of Palestinian economy",
    "url": "https://www.theweek.in/news/middle-east/2025/11/27/gaza-s-economy-shrinks-83-inside-the-unprecedented-collapse-of-palestinian-economy.html",
    "source": "www.theweek.in",
    "description": "The Palestinian economy is currently facing its deepest economic crisis ever recorded, marked by an \"unprecedented and catastrophic\" collapse in Gaza, according to a report presented by the UN Conference on Trade and Development. UNCTAD Deputy Secretary-General Pedro Manuel Moreno said years of rest...",
    "category": "GDP",
    "country": "Palestine",
    "published_date": "2025-11-01"
  },
  {
    "id": 3693,
    "title": "Palestinian Territories Economy in Near-Total Collapse",
    "url": "https://havanatimes.org/news/palestinian-territories-economy-in-near-total-collapse/",
    "source": "havanatimes.org",
    "description": "In the Gaza Strip, 174,500 structures, the majority of the built environment, were destroyed or damaged by the two-year war. The economy collapsed, and the population was plunged into multidimensional poverty and made dependent on international aid, which remains urgently needed, according to a UN T...",
    "category": "GDP",
    "country": "Palestine",
    "published_date": "2025-11-01"
  }
]