[
  {
    "id": 1714,
    "title": "The case of women’s political visibility in Costa Rica",
    "url": "https://www.financialexpress.com/world-news/the-case-of-womens-political-visibility-in-costa-rica/2695629/",
    "source": "www.financialexpress.com",
    "description": "By Hoimi Mukherjee\n\nIn evaluating Costa Rica’s political legacy after two hundred and one years of independence, one of its notable achievements has been ensuring women’s representation. Currently, there is an elected woman Vice President and more than 47 percent are women in Parliament.\n\nIn a conte...",
    "category": "Central Bank",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1715,
    "title": "Central America, Mexico Pledge to Boost Refugee Protections",
    "url": "https://www.miragenews.com/central-america-mexico-pledge-to-boost-refugee-1578655/",
    "source": "www.miragenews.com",
    "description": "OAS\n\nThe seven countries of the Comprehensive Regional Protection and Solutions Framework (MIRPS) — Belize, Costa Rica, El Salvador, Guatemala, Honduras, Mexico, and Panama — concluded the VIII MIRPS Annual Meeting yesterday with the adoption of the Heredia Declaration, an agreement that reaffirms t...",
    "category": "Central Bank",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1726,
    "title": "UAE, Costa Rica seal economic partnership agreement to boost investment ties",
    "url": "https://www.aninews.in/news/world/middle-east/uae-costa-rica-seal-economic-partnership-agreement-to-boost-investment-ties20240418133545/",
    "source": "www.aninews.in",
    "description": "Abu Dhabi [UAE], April 18 (ANI): United Arab Emirates and Costa Rica have signed the UAE-Costa Rica Comprehensive Economic Partnership Agreement (CEPA) on Wednesday with the aim of enhancing bilateral relations, Al Arabiya News reported citing Emirates News Agency.\n\nFurther, the implementation of th...",
    "category": "Economic Growth",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1727,
    "title": "Chinese embassy criticizes Costa Rica for 5G company restrictions",
    "url": "https://telecom.economictimes.indiatimes.com/news/industry/chinese-embassy-criticizes-costa-rica-for-5g-company-restrictions/104459634",
    "source": "telecom.economictimes.indiatimes.com",
    "description": "Advt\n\nJoin the community of 2M+ industry professionals. Subscribe to Newsletter to get latest insights & analysis in your inbox. All about ETTelecom industry right on your smartphone! Download the ETTelecom App and get the Realtime updates and Save your favourite articles.\n\nSAN JOSE: Costa Rican off...",
    "category": "Economic Growth",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1729,
    "title": "Costa Rica's digital identity reflects its international growth",
    "url": "https://www.prnewswire.co.uk/news-releases/costa-ricas-digital-identity-reflects-its-international-growth-302323145.html?gclid=EAIaIQobChMI-&gclid=EAIaIQobChMI-",
    "source": "www.prnewswire.co.uk",
    "description": "A study by the international firm Bloom Consulting indicates a remarkable growth in searches in both sectors.\n\nSAN JOSÉ, Costa Rica, Dec. 4, 2024 /PRNewswire/ -- A new analysis of Costa Rica's identity and digital footprint reveals that the country has consolidated its position by showing significan...",
    "category": "Economic Growth",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1703,
    "title": "Costa Rica to accept deported Indians, Central Asians in new repatriation agreement with US",
    "url": "https://timesofindia.indiatimes.com/india/costa-rica-to-accept-deported-indians-central-asians-in-new-repatriation-agreement-with-us/articleshow/118348326.cms",
    "source": "timesofindia.indiatimes.com",
    "description": ".\n\nCosta Rica on Monday said it will accept migrants who have been deported from the United States.\"The government of Costa Rica agreed to collaborate with the United States in the repatriation of 200 illegal immigrants to their country,\" the Costa Rican president's office said in a statement, addin...",
    "category": "GDP",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1705,
    "title": "Costa Rica accepts deportees, including Indians, under its Immigration Law 8764",
    "url": "https://www.financialexpress.com/india-news/costa-rica-accepts-deportees-including-indians-under-its-immigration-law-8764/3753182/",
    "source": "www.financialexpress.com",
    "description": "As part of a major campaign to tackle illegal immigration, the US is deporting hundreds of undocumented migrants, including a small group from India, to Central American nations. A flight carrying 200 deported individuals, which includes migrants from various countries in Central Asia and India, is ...",
    "category": "Inflation",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1706,
    "title": "Costa Rica opens doors to Indian migrants deported from US, first group to arrive on Wednesday",
    "url": "https://www.financialexpress.com/world-news/costa-rica-opens-doors-to-indian-migrants-deported-from-us-first-group-to-arrive-on-wednesday/3752983/",
    "source": "www.financialexpress.com",
    "description": "Costa Rica has agreed to act as a “bridge” for the repatriation of illegal immigrants in the US, including individuals from India and Central Asia, according to an official release on Tuesday.\n\nThe first group of 200 migrants is set to arrive at Juan Santamaria International Airport on a commercial ...",
    "category": "Inflation",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1717,
    "title": "Fixed Deposits Latest Interest Rates: SBI vs PNB vs HDFC vs ICICI: COMPARISON - Want to do 1 year FD? Which bank will offer more money? Know here",
    "url": "https://www.zeebiz.com/personal-finance/news-fixed-deposits-latest-interest-rates-sbi-vs-pnb-vs-hdfc-vs-icici-comparison-want-to-do-1-year-fd-which-bank-will-offer-more-money-know-here-158359",
    "source": "www.zeebiz.com",
    "description": "Fixed Deposit (FD) is a traditional and reliable investment option in India. Even today most people prefer investing money in Bank FD. One of the specialties of FD is that in this, customers get the option of deposits from 7 days to 10 years. This means you can park your money in a safe place for as...",
    "category": "Interest Rates",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1719,
    "title": "Will mortgage interest rates drop after this week's Fed meeting?",
    "url": "https://www.cbsnews.com/news/will-mortgage-interest-rates-drop-october-29-2025-fed-meeting/",
    "source": "www.cbsnews.com",
    "description": "Mortgage interest rates have been dropping recently and may continue to fall after this week's Fed meeting. BangWan/Abu Hanifah/Getty Images\n\nAll eyes will turn toward the Federal Reserve this week as the central bank holds its penultimate meeting of 2025 to determine monetary policy and the future ...",
    "category": "Interest Rates",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1720,
    "title": "RBI move good news for homebuyers but ‘historic low’ interest rates may not continue for long, say developers",
    "url": "https://www.financialexpress.com/money/rbi-move-good-news-for-homebuyers-but-historic-low-interest-rates-may-not-continue-for-long-say-developers-2430397/",
    "source": "www.financialexpress.com",
    "description": "Contrary to market expectations, the Reserve Bank of India maintained status quo on key policy rates as well as its accommodative policy stance in the MPC meet on Thursday in a bid to revive and sustain growth.\n\nWelcoming the policy announcement, industry experts and developers said the RBI MPC has ...",
    "category": "Interest Rates",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1721,
    "title": "Bitrue Unveils Major Boost to Stablecoin Earnings, Delivering Higher Returns to Global Users",
    "url": "https://markets.businessinsider.com/news/stocks/bitrue-unveils-major-boost-to-stablecoin-earnings-delivering-higher-returns-to-global-users-1035600036",
    "source": "markets.businessinsider.com",
    "description": "JACÓ, Costa Rica, Nov. 27, 2025 (GLOBE NEWSWIRE) -- Bitrue has today unveiled a major expansion of its passive-earnings suite, introducing significantly boosted interest rates across leading stablecoins — including RLUSD from Ripple and PYUSD from PayPal. Users can now access the updated programme d...",
    "category": "Interest Rates",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1722,
    "title": "India and Costa Rica Forge Strategic Pathways: Unlocking New Trade and Investment Opportunities Across Key Sectors",
    "url": "https://www.financialexpress.com/business/industry-india-and-costa-rica-forge-strategic-pathways-unlocking-new-trade-and-investment-opportunities-across-key-sectors-3606839/",
    "source": "www.financialexpress.com",
    "description": "The bilateral relationship between Costa Rica and India is undergoing a significant transformation, with a steady growth in trade and investment across multiple sectors. As global economies look towards diversification, Costa Rica has emerged as a strategic partner for India in Central America, offe...",
    "category": "Trade Policy",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1723,
    "title": "Costa Rica’s new Ambassador to India charts path for stronger bilateral ties",
    "url": "https://www.financialexpress.com/india-news/costa-ricas-new-ambassador-to-india-charts-path-for-stronger-bilateral-ties/3768552/",
    "source": "www.financialexpress.com",
    "description": "In an effort to strengthen Costa Rica’s diplomatic, economic, and cultural ties with India, Néstor Gabriel Baltodano, the newly appointed Ambassador of the Central American nation to India, has outlined a clear roadmap to enhance collaboration in several key sectors. His vision revolves around promo...",
    "category": "Trade Policy",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  },
  {
    "id": 1724,
    "title": "Costa Rica promotes diversification and high-quality food at the PLMA trade show in Europe",
    "url": "https://www.prnewswire.co.uk/news-releases/costa-rica-promotes-diversification-and-high-quality-food-at-the-plma-trade-show-in-europe-301834942.html?gclid=EAIaIQobChMIh&gclid=EAIaIQobChMIh",
    "source": "www.prnewswire.co.uk",
    "description": "ÁMSTERDAM, May 25, 2023 /PRNewswire/ -- In addition to being recognized as a tourist destination and for its commitment to sustainability and democracy, Costa Rica also enjoys an international position for the quality and diversity of its export products. It is precisely these characteristics that t...",
    "category": "Trade Policy",
    "country": "Costa Rica",
    "published_date": "2025-12-01"
  }
]