[
  {
    "id": 4588,
    "title": "Thursday’s exchange rates for the Tanzania Shilling",
    "url": "https://www.panapress.com/Thursday-s-exchange-rates-for-th-a_630785267-lang2.html",
    "source": "www.panapress.com",
    "description": "Dar es Salaam, Tanzania (PANA) – The following are the exchange rates for the Tanzania Shilling on Thursday as issued by the Bank of Tanzania,Currency Buying SellingBurundi Franc 0",
    "category": "Currency Exchange Rates",
    "country": "Tanzania",
    "published_date": "2025-11-01"
  },
  {
    "id": 4574,
    "title": "Tanzania records strong growth in fish exports",
    "url": "https://dailynews.co.tz/tanzania-records-strong-growth-in-fish-exports/",
    "source": "dailynews.co.tz",
    "description": "DAR ES SALAAM: TANZANIA’S fisheries sector has posted strong export growth, highlighting renewed investment and rising momentum in the country’s blue economy drive.\n\nThis was announced by the Permanent Secretary in the Ministry of Livestock and Fisheries, Agnes Kisaka Meena, during the closing cerem...",
    "category": "Economy",
    "country": "Tanzania",
    "published_date": "2025-11-01"
  },
  {
    "id": 4576,
    "title": "Tanzania's fisheries export surge boosts blue economy momentum",
    "url": "https://www.thestar.com.my/news/world/2025/11/23/tanzania039s-fisheries-export-surge-boosts-blue-economy-momentum",
    "source": "www.thestar.com.my",
    "description": "DAR ES SALAAM, Nov. 22 (Xinhua) -- Tanzania's fisheries sector has recorded a sharp increase in exports, signaling renewed investment and growing momentum in the country's blue economy, officials have said.\n\nSpeaking at the closing ceremony of World Fisheries Day in Dar es Salaam on Friday, Agnes Ki...",
    "category": "Economy",
    "country": "Tanzania",
    "published_date": "2025-11-01"
  },
  {
    "id": 4571,
    "title": "Tanzania bets on LNG ahead of deadline",
    "url": "https://dailynews.co.tz/tanzania-bets-on-lng-ahead-of-deadline/",
    "source": "dailynews.co.tz",
    "description": "LINDI: IN a global race where capital is chasing shorter-cycle energy returns, Tanzania is sprinting to close a decade-long negotiation on its 42 billion US dollars Liquefied Natural Gas (LNG) project led by Shell (NYSE: SHEL, LSE: SHEL) and Equinor (NYSE/Oslo: EQNR) at Lindi.\n\nThe government wants ...",
    "category": "GDP",
    "country": "Tanzania",
    "published_date": "2025-11-01"
  },
  {
    "id": 4572,
    "title": "BoT’s new monetary policy stabilizes the Tanzanian shilling",
    "url": "https://dailynews.co.tz/bots-new-monetary-policy-stabilizes-the-tanzanian-shilling/",
    "source": "dailynews.co.tz",
    "description": "DODOMA: TANZANIA’S new monetary policy, which uses the Central Bank interest rate, has begun to show significant achievements in the country’s economy, including the strengthening of the shilling and the maintenance of price stability.\n\nPendaeli Chamicha, the Assistant Manager for Economics and Stat...",
    "category": "Monetary Policy",
    "country": "Tanzania",
    "published_date": "2025-11-01"
  },
  {
    "id": 4583,
    "title": "Tanzania sees wheat, edible oil production as a solution to reliance on imports",
    "url": "https://dailynews.co.tz/tanzania-sees-wheat-edible-oil-production-as-a-solution-to-reliance-on-imports/",
    "source": "dailynews.co.tz",
    "description": "DAR ES SALAAM: THE Minister for Agriculture, Daniel Chongolo, has asked the Cereals and Other Produce Regulatory Authority (COPRA) to explore additional strategic areas to broaden the scope of results.\n\nThe minister gave the instructions today, November 25, 2025, while citing the example of wheat an...",
    "category": "Trade Policy",
    "country": "Tanzania",
    "published_date": "2025-11-01"
  },
  {
    "id": 4584,
    "title": "Stability returns to Tanzania",
    "url": "https://guardian.ng/opinion/stability-returns-to-tanzania/",
    "source": "guardian.ng",
    "description": "Since gaining independence in 1961, Tanzania had, until October 2025, never struggled with any form of internal strife or violence. For over six decades, its common sense of national identity and lack of ethnic divides have marked it out in a region which is otherwise beset with violence and conflic...",
    "category": "Trade Policy",
    "country": "Tanzania",
    "published_date": "2025-11-01"
  }
]