[
  {
    "id": 1813,
    "title": "European Metals Receives Czech Government Grant Approval for Strategic Cinovec Build-Out",
    "url": "https://smallcaps.com.au/article/european-metals-receives-czech-government-grant-approval-for-strategic-cinovec-build-out",
    "source": "smallcaps.com.au",
    "description": "European Metals (ASX: EMH) has received confirmation that its Cinovec lithium project in the Czech Republic has been approved for a government grant of up to €360 million.\n\nThe grant falls under the nation’s Strategic Investments for a Climate-Neutral Economy program and remains subject to final adm...",
    "category": "Economy",
    "country": "Czech Republic",
    "published_date": "2025-11-01"
  },
  {
    "id": 1814,
    "title": "Czech Senate President urges stronger business cooperation with Vietnam",
    "url": "https://english.vov.vn/en/economy/czech-senate-president-urges-stronger-business-cooperation-with-vietnam-post1247650.vov",
    "source": "english.vov.vn",
    "description": "President of the Senate of the Parliament of the Czech Republic Milos Vystrcil on November 20 meets with Czech and Vietnamese enterprises in Hanoi as part of his official visit to Vietnam. (Photo: VNA)\n\nThe event was organised by the Czech Embassy in Hanoi, in coordination with the Czech Chamber of ...",
    "category": "Economy",
    "country": "Czech Republic",
    "published_date": "2025-11-01"
  },
  {
    "id": 1796,
    "title": "Czech GDP growth surges: Consumer spending affirms economic health",
    "url": "https://www.expats.cz/czech-news/article/czech-gdp-growth-surges-as-consumer-spending-drives-healthy-economy",
    "source": "www.expats.cz",
    "description": "“Quarter-on-quarter growth of 0.8 percent is strong and suggests the Czech economy is heating up above its potential. Household consumption dominates, but investments are also developing steadily,” said Vít Hradil, chief economist at Investika. He also noted that foreign trade contributed positively...",
    "category": "GDP",
    "country": "Czech Republic",
    "published_date": "2025-11-01"
  }
]