[
  {
    "id": 2902,
    "title": "Laos vows stronger action on bank misconduct",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/11/18/laos-vows-stronger-action-on-bank-misconduct",
    "source": "www.thestar.com.my",
    "description": "VIENTIANE: The Bank of the Lao PDR (BOL) has pledged stronger action to address corruption, weak internal controls and loan violations that continue to affect the banking system.\n\nThe Governor of the BOL, Bounkham Vorachit, presented this update to the 10th Ordinary Session of the 9th National Assem...",
    "category": "Central Bank",
    "country": "Laos",
    "published_date": "2025-11-01"
  },
  {
    "id": 2906,
    "title": "Laos accelerates infrastructure upgrades to boost growth",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/11/19/laos-accelerates-infrastructure-upgrades-to-boost-growth",
    "source": "www.thestar.com.my",
    "description": "VIENTIANE: The Lao government continues to advance infrastructure development, particularly road upgrades and the rapid repair of damaged routes, to facilitate transportation and tourism and support national socio-economic growth.\n\nDuring a press conference on Monday (Nov 17), Vice President of the ...",
    "category": "Economic Growth",
    "country": "Laos",
    "published_date": "2025-11-01"
  },
  {
    "id": 2907,
    "title": "Laos finalises blueprint for national development",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/11/25/laos-finalises-blueprint-for-national-development",
    "source": "www.thestar.com.my",
    "description": "VIENTIANE: The 11th Central Committee of the Lao People’s Revolutionary Party is making strides in finalising the country’s political and economic development blueprint, issuing forward-looking guidance to address the real challenges facing Laos as preparations advance for the 12th National Party Co...",
    "category": "Economic Growth",
    "country": "Laos",
    "published_date": "2025-11-01"
  },
  {
    "id": 2898,
    "title": "Lao economy predicted to grow by 4.5% in 2026: IMF",
    "url": "https://en.vietnamplus.vn/lao-economy-predicted-to-grow-by-45-in-2026-imf-post333285.vnp",
    "source": "en.vietnamplus.vn",
    "description": "Vientiane (VNA) – The International Monetary Fund (IMF) has projected that the Lao economy will expand by 4.5% in 2026, supported by stronger exports, rising tourism, foreign direct investment, and an accommodative fiscal stance.\n\nDespite the encouraging indicators, the IMF warned that several risks...",
    "category": "Economy",
    "country": "Laos",
    "published_date": "2025-11-01"
  },
  {
    "id": 2899,
    "title": "Laos prioritises agriculture to boost economy, community livelihoods",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/11/23/laos-prioritises-agriculture-to-boost-economy-community-livelihoods",
    "source": "www.thestar.com.my",
    "description": "VIENTIANE: Laos continues to boost agricultural production by promoting modern techniques, quality standards, and sustainable practices, aiming to strengthen the economy and community livelihoods.\n\nThe Lao government is intensifying efforts to boost agricultural production, strengthen competitivenes...",
    "category": "Economy",
    "country": "Laos",
    "published_date": "2025-11-01"
  },
  {
    "id": 2901,
    "title": "ADB backs Laos' drive for climate-resilient development",
    "url": "http://www.chinaview.cn/20251128/9f5a3dc2996e4eb2a3f5f16cee99894f/c.html",
    "source": "www.chinaview.cn",
    "description": "VIENTIANE, Nov. 28 (Xinhua) -- The Asian Development Bank (ADB) is assisting Laos in developing a sustainable, inclusive, and climate-resilient economy through its Climate Adaptation Investment Planning (CAIP) technical assistance program.\n\nThe CAIP initiative aims to strengthen the Lao government's...",
    "category": "Economy",
    "country": "Laos",
    "published_date": "2025-11-01"
  }
]