[
  {
    "id": 4573,
    "title": "China signals closer ties with Zambia, Tanzania in bid to create new economic hub",
    "url": "https://news.az/news/china-signals-closer-ties-with-zambia-tanzania-in-bid-to-create-new-economic-hub",
    "source": "news.az",
    "description": "+ ↺ − 16 px\n\nChinese Premier Li Qiang has affirmed his country's readiness to work with Zambia and Tanzania to advance the development of a “prosperity belt” along the Tanzania-Zambia Railway and to jointly build a new hub of economic growth.\n\nSpeaking in Lusaka at the ground-breaking ceremony for t...",
    "category": "Economy",
    "country": "Tanzania",
    "published_date": "2025-12-01"
  },
  {
    "id": 4575,
    "title": "India allows export of 30,000 tonnes of non-basmati white rice to Tanzania",
    "url": "https://www.financialexpress.com/policy/economy-india-allows-export-of-30000-tonnes-of-non-basmati-white-rice-to-tanzania-3412873/",
    "source": "www.financialexpress.com",
    "description": "The government has permitted exports of 30,000 tonne of non-basmati white rice to Tanzania and 80,000 tonne of broken rice to Djibouti and Guinea Bissau. The export is permitted through National Cooperative Exports Limited (NCEL), the Directorate General of Foreign Trade (DGFT) has said in a notific...",
    "category": "Economy",
    "country": "Tanzania",
    "published_date": "2025-12-01"
  },
  {
    "id": 4570,
    "title": "Tanzania’s livestock sector emerges as economic powerhouse",
    "url": "https://dailynews.co.tz/tanzanias-livestock-sector-emerges-as-economic-powerhouse/",
    "source": "dailynews.co.tz",
    "description": "DAR ES SALAAM: THE livestock sector continues to be a vital pillar of Tanzania’s economic and social development.\n\nIn recent years, the government, under the leadership of President Samia Suluhu Hassan, has implemented deliberate and strategic measures to strengthen livestock production, enhance ani...",
    "category": "GDP",
    "country": "Tanzania",
    "published_date": "2025-12-01"
  }
]