[
  {
    "id": 2929,
    "title": "Lebanese Bank Hit With Civil Suit for Failing to Cash Check Following Financial Meltdown",
    "url": "https://www.occrp.org/en/news/lebanese-bank-hit-with-civil-suit-for-failure-to-honor-check-following-financial-meltdown",
    "source": "www.occrp.org",
    "description": "Société Générale de Banque au Liban, a major lender in the Middle East, is facing a civil lawsuit in the U.S. for refusing to cash a check owed to a Lebanese-American businessman.\n\nIn a legal complaint, Joseph Zoghaib claims the institution, known as SGBL, issued checks it “knew could not be honored...",
    "category": "Central Bank",
    "country": "Lebanon",
    "published_date": "2025-12-01"
  },
  {
    "id": 2931,
    "title": "Lebanon cracks down on cash transfers amid US push to cut Hezbollah funding",
    "url": "https://www.israelnationalnews.com/news/417802",
    "source": "www.israelnationalnews.com",
    "description": "Lebanon’s central bank announced Friday a series of new restrictions on money changers and transfer companies, in a move widely seen as a response to mounting US pressure to dismantle Hezbollah’s financial lifelines, AFP reported.\n\nThe decision comes days after a visiting American official declared ...",
    "category": "Central Bank",
    "country": "Lebanon",
    "published_date": "2025-12-01"
  },
  {
    "id": 2926,
    "title": "Under US pressure, Lebanon tightens screws on money transfers",
    "url": "https://www.newarab.com/news/under-us-pressure-lebanon-tightens-screws-money-transfers",
    "source": "www.newarab.com",
    "description": "Lebanon announced on Friday that money changers and transfer companies must comply with stricter rules as the country faces heavy US pressure to regulate its cash economy and cut off Hezbollah funding.\n\nThe move comes days after a visiting US official said his country was determined to cut off Tehra...",
    "category": "Economy",
    "country": "Lebanon",
    "published_date": "2025-12-01"
  },
  {
    "id": 2927,
    "title": "Aoun calls on investors to return to Lebanon at conference",
    "url": "https://www.newarab.com/news/aoun-calls-investors-return-lebanon-conference",
    "source": "www.newarab.com",
    "description": "Lebanon is seeking to attract foreign investors with the launch of the 'Beirut One' economic conference on Tuesday, as the new government seeks to stabilise the economy and increase transparency.\n\nKey to this is rebuilding relations with Saudi Arabia, historically one of Lebanon's main financial bac...",
    "category": "Economy",
    "country": "Lebanon",
    "published_date": "2025-12-01"
  },
  {
    "id": 2922,
    "title": "Lebanon PEST Analysis Report 2025: Analysis of Current and Future Issues, Supplemented with Relevant Quantitative Data to Support Trend Analysis.",
    "url": "https://finance.yahoo.com/news/lebanon-pest-analysis-report-2025-154300638.html",
    "source": "finance.yahoo.com",
    "description": "Company Logo\n\nLebanon presents opportunities in expanding the tech industry, driven by advancements in IT and telecommunications. Growth in sectors like healthcare and education indicates potential for investment. Political and fiscal reforms could enhance business environments, attracting internati...",
    "category": "GDP",
    "country": "Lebanon",
    "published_date": "2025-12-01"
  },
  {
    "id": 2924,
    "title": "China, inflation could pop Japan PM's bubble",
    "url": "https://www.lebanondemocrat.com/news/national/china-inflation-could-pop-japan-pms-bubble/article_a01edfb4-e32a-54b4-a9eb-6a01ec4cc510.html",
    "source": "www.lebanondemocrat.com",
    "description": "We have used your information to see if you have a subscription with us, but did not find one. Please use the button below to verify an existing account or to purchase a new subscription.",
    "category": "Inflation",
    "country": "Lebanon",
    "published_date": "2025-12-01"
  },
  {
    "id": 2936,
    "title": "Protests in Lebanon against unemployment, cabinet's policies",
    "url": "https://www.prokerala.com/news/articles/a1036517.html",
    "source": "www.prokerala.com",
    "description": "BEIRUT, Oct. 20, 2019 (Xinhua) -- People take part in a protest in downtown Beirut, Lebanon, Oct. 20, 2019. Nationwide demonstrations continued in Lebanon for the fourth consecutive day calling for major changes in the country's political system. Dem. Image Source: IANS News\n\nBeirut, May 2 : Thousan...",
    "category": "Unemployment",
    "country": "Lebanon",
    "published_date": "2025-12-01"
  }
]