[
  {
    "id": 4784,
    "title": "SVR: The main customer of the war in Ukraine is Britain, London wants to blackmail Trump — EADaily, November 25th, 2025 — Politics, Russia",
    "url": "https://eadaily.com/en/news/2025/11/25/svr-the-main-customer-of-the-war-in-ukraine-is-britain-london-wants-to-blackmail-trump",
    "source": "eadaily.com",
    "description": "Britain, despite the deplorable situation of the Armed Forces of Ukraine at the front, seeks to continue hostilities and convinces partners of the possibility of inflicting a strategic defeat on Russia. The reasons are reported today, November 25, by the SVR press bureau.\n\nThe proceeds from the war ...",
    "category": "Economy",
    "country": "Ukraine",
    "published_date": "2025-11-01"
  },
  {
    "id": 4775,
    "title": "Most Americans disapprove of Trump on economy, immigration, crime and Ukraine and blame him for inflation, new poll suggests",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-poll-approval-ukraine-shutdown-b2856986.html?ref=cupure",
    "source": "www.independent.co.uk",
    "description": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Get our free Inside Washington email Email * SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our Privacy notice\n...",
    "category": "Inflation",
    "country": "Ukraine",
    "published_date": "2025-11-01"
  },
  {
    "id": 4776,
    "title": "Trump says no inflation this Thanksgiving but Floridians feel squeezed",
    "url": "https://www.jsonline.com/story/news/trump/2025/11/24/trump-mar-a-lago-thanksgiving-inflation-epstein/87354366007/",
    "source": "www.jsonline.com",
    "description": "Nov. 24, 2025 Updated Nov. 27, 2025, 1:36 p.m. CT\n\nAI-assisted summary President Trump is facing challenges including a low approval rating and criticism over the economy.\n\nTrump is pushing for a peace deal to end the war in Ukraine, a key foreign policy objective.\n\nThe administration's immigration ...",
    "category": "Inflation",
    "country": "Ukraine",
    "published_date": "2025-11-01"
  }
]