[
  {
    "id": 1083,
    "title": "BB board clears winding up of nine non-banks",
    "url": "https://www.thedailystar.net/business/news/bb-board-clears-winding-nine-non-banks-4047616",
    "source": "www.thedailystar.net",
    "description": "Governor says govt verbally approved Tk 5,000cr to pay depositors; Sammilito Islami Bank gets licence\n\nBB approves liquidation of nine NBFIs\n\nTk 5,000 crore earmarked for depositors\n\nLargest Islamic bank formed through merger\n\nSector clean-up signals aggressive regulatory intervention\n\nThe Banglades...",
    "category": "Central Bank",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1085,
    "title": "Share/Stock Market News - Latest NSE, BSE, Business News, Stock/Share Tips, Sensex Nifty, Commodity, Global Market News & Analysis",
    "url": "https://www.moneycontrol.com/news/bangladesh-central-bank/",
    "source": "www.moneycontrol.com",
    "description": "You are already a Moneycontrol Pro user.\n\nOK",
    "category": "Central Bank",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1105,
    "title": "Bangladesh to drop Sheikh Mujibur Rahman’s image from currency notes amid political overhaul: Report",
    "url": "https://timesofindia.indiatimes.com/world/south-asia/bangladesh-to-drop-sheikh-mujibur-rahmans-image-from-currency-notes-amid-political-overhaul-report/articleshow/116016108.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Bangladesh has initiated the removal of country’s founding leader Sheikh Mujibur Rahman from its currency notes. The move comes months after the ouster of Prime Minister Sheikh Hasina , Rahman’s daughter, who fled the country following a student-led uprising in July.Bangladesh Bank confirmed that it...",
    "category": "Currency Exchange Rates",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1108,
    "title": "Delhi police recover counterfeit currency racket operating from bangladesh through bihar",
    "url": "https://timesofindia.indiatimes.com/city/delhi/delhi-police-recover-counterfeit-currency-racket-operating-from-bangladesh-through-bihar/articleshow/121699814.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "New Delhi: In the first seizure of Fake Indian Currency Notes (FICN) this year, Delhi Police Special Cell recovered counterfeit notes with a face value of Rs 4 lakh. The high-quality fake notes, all in Rs 500 denomination, were smuggled into Delhi via Bangladesh. The courier was traced to Datia in B...",
    "category": "Currency Exchange Rates",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1078,
    "title": "America’s Tariffs Jolted the Global Economy. Its AI Spending Is Helping Save It.",
    "url": "https://www.hindustantimes.com/world-news/americas-tariffs-jolted-the-global-economy-its-ai-spending-is-helping-save-it-101764564984578.html",
    "source": "www.hindustantimes.com",
    "description": "SINGAPORE—When President Trump announced his “Liberation Day” tariffs in April, economists predicted a global shock: The U.S. would buy less from the world, cutting exports and jobs.\n\nNow some of those economists are revising their global growth predictions upward.\n\nOne big reason: What the U.S. gov...",
    "category": "Economy",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1071,
    "title": "Bangladesh embrace agroecology to combat chemical overuse: Experts",
    "url": "https://www.bssnews.net/news/334950",
    "source": "www.bssnews.net",
    "description": "Photo : Palli Karma-Sahayak Foundation\n\nDHAKA, Nov 23, 2025 (BSS) – An important policy dialogue was held today in the city, addressing the unsustainable dependency of Bangladesh’s food production system on chemical fertilizers and pesticides.\n\nOrganized by the Palli Karma-Sahayak Foundation (PKSF),...",
    "category": "Fiscal Policy",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1073,
    "title": "Fiscal deficit contained at targeted 4.8% despite revenue shortfall",
    "url": "https://www.financialexpress.com/policy/economy-fiscal-deficit-contained-at-targeted-4-8-despite-revenue-shortfall-3863191/",
    "source": "www.financialexpress.com",
    "description": "The Centre’s fiscal deficit came in at 4.77% of GDP for 2024-25, marginally lower than the 4.84% projected in the revised estimate (RE) for the year, despite a shortfall in revenues, especially tax receipts.\n\nThe fiscal deficit stood at Rs 15.77 lakh crore, 100.5% of FY25RE. Yet the fiscal deficit/G...",
    "category": "Fiscal Policy",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1074,
    "title": "Bangladesh eases visa policy for Pak bizmen",
    "url": "https://www.tribuneindia.com/news/world/bangladesh-eases-visa-policy-for-pak-bizmen/",
    "source": "www.tribuneindia.com",
    "description": "Bangladesh is easing its visa policy for Pakistani business leaders, the country’s top envoy in Islamabad has said, adding that the move aims to foster economic growth between the two countries and across the region.\n\nAdvertisement\n\nSpeaking at a reception hosted by the Gujarat Chamber of Commerce a...",
    "category": "Fiscal Policy",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1051,
    "title": "Reserves, remittances lift Bangladesh’s external sector outlook: GED Report",
    "url": "https://www.thedailystar.net/business/news/reserves-remittances-lift-bangladeshs-external-sector-outlook-ged-report-4047981",
    "source": "www.thedailystar.net",
    "description": "Bangladesh's external sector improved last year as reserves and remittances grew, though trade remained unstable.\n\nExports dipped in April and June before recovering, while garment shipments and imports showed mid‑year declines followed by modest rebounds later in 2025, according to a government rep...",
    "category": "GDP",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1052,
    "title": "BNP aims for transforming Bangladesh into trillion dollar economy: Khasru",
    "url": "https://www.bssnews.net/news/336953",
    "source": "www.bssnews.net",
    "description": "BNP Standing Committee member Amir Khasru Mahmud Chowdhury addressed at a session of the “Fourth Bangladesh Economic Conference 2025\" held at a hotel in the capital today. Photo: BSS\n\nDHAKA, Nov 29, 2025 (BSS) - BNP Standing Committee member Amir Khasru Mahmud Chowdhury today said that BNP’s economi...",
    "category": "GDP",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1054,
    "title": "‘Fuel security now a make-or-break factor for Bangladesh’s industrial growth’",
    "url": "https://www.jagonews24.com/en/business/news/87519",
    "source": "www.jagonews24.com",
    "description": "Bangladesh’s industrial sector is facing a mounting crisis rooted in fuel insecurity, threatening production, investment and long-term economic stability, warned Dhaka Chamber of Commerce and Industry (DCCI) President Taskin Ahmed on Saturday.\n\nSpeaking at a discussion titled “Energy Efficiency Poli...",
    "category": "GDP",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1055,
    "title": "India's GDP In Terms Of PPP In 2019 Was 11 Times More Than Bangladesh: Govt Sources",
    "url": "https://www.businessworld.in/article/indias-gdp-in-terms-of-ppp-in-2019-was-11-times-more-than-bangladesh-govt-sources-331641",
    "source": "www.businessworld.in",
    "description": "India's Gross Domestic Product (GDP) in terms of Purchasing power parity (PPP) in 2019 was 11 times more than Bangladesh, said government sources.\n\nIn 2019, India's GDP in purchasing parity terms was 11 times more of Bangladesh while the population was 8 times more. In purchasing power parity terms,...",
    "category": "GDP",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1057,
    "title": "Policy rates hold as Bangladesh eyes inflation ahead of elections, Ramadan",
    "url": "https://www.jagonews24.com/en/business/news/87233",
    "source": "www.jagonews24.com",
    "description": "In a widely anticipated decision, Bangladesh Bank has opted to keep its key policy interest rates unchanged, citing cautious optimism over slowing inflation while acknowledging emerging risks tied to the upcoming national elections, the holy month of Ramadan, and structural economic uncertainties.\n\n...",
    "category": "Inflation",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1059,
    "title": "Rice and fish drive food inflation in October, while vegetables help ease price pressures: Report",
    "url": "https://www.tbsnews.net/economy/rice-and-fish-drive-food-inflation-october-while-vegetables-help-ease-price-pressures-report",
    "source": "www.tbsnews.net",
    "description": "Rice and fish remained the major drivers of food inflation in Bangladesh in October, although sharply lower vegetable prices helped counterbalance the overall upward pressure, according to the latest Economic Update and Outlook released today (1 December).\n\nAccording to the report, by the Planning C...",
    "category": "Inflation",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1061,
    "title": "Bangladesh Bank Loans: Record Defaults, Low Investment",
    "url": "https://money.rediff.com/news/market/bangladesh-bank-loans-record-defaults-low-investment/37621820251126",
    "source": "money.rediff.com",
    "description": "Bangladesh sees record-high default bank loans, reaching 35.7% of credit. Investment inflow at lowest ever. Details inside.\n\nDhaka, Nov 26 (PTI) Non-performing loans in Bangladesh's banking sector jumped to Tk 6.44 lakh crore at the end of September, which amounts to 35.7 per cent of all banking cre...",
    "category": "Inflation",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1089,
    "title": "BCB elections set for early October amid conflict of interest concerns",
    "url": "https://www.cricbuzz.com/cricket-news/135464/bangladesh-cricket-board-news-bcb-elections-set-for-early-october-amid-conflict-of-interest-concerns-cricbuzzcom",
    "source": "www.cricbuzz.com",
    "description": "\"The BCB election will be held in the first week of October. The election commission will confirm the exact date,\" BCB vice-president Nazmul Abedin told reporters following the meeting. \"The Election Commission has not yet been formed by name. The responsibility of recommending names has been left t...",
    "category": "Interest Rates",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1065,
    "title": "Bangladesh faces mounting macro-financial challenges despite progress: IMF",
    "url": "https://asianews.network/bangladesh-faces-mounting-macro-financial-challenges-despite-progress-imf/",
    "source": "asianews.network",
    "description": "November 14, 2025\n\nDHAKA – Bangladesh’s economy continues to face mounting macro-financial challenges stemming from weak tax revenue, financial sector vulnerabilities, and elevated inflation, although the authorities have made progress in maintaining macroeconomic stability and advancing reforms.\n\nT...",
    "category": "Monetary Policy",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1067,
    "title": "IMF satisfied with Bangladesh's economic reform measures: Dr Salehuddin",
    "url": "https://www.justnewsbd.com/en/business/news/27610",
    "source": "www.justnewsbd.com",
    "description": "Finance Adviser Dr Salehuddin Ahmed on Tesday said the International Monetary Fund (IMF) has expressed overall satisfaction with Bangladesh's economic reform measures.\n\n\"The IMF said the situation is overall good, but they are looking at the challenges. We are moving under a plan, but they think if ...",
    "category": "Monetary Policy",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1091,
    "title": "Bangladesh, Pakistan boost trade ties after two decades: Dhaka gets access to Karachi Port; move amid frayed ties with India",
    "url": "https://timesofindia.indiatimes.com/world/south-asia/bangladesh-pakistan-boost-trade-ties-after-two-decades-dhaka-gets-access-to-karachi-port-move-amid-frayed-ties-with-india/articleshow/124869541.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "India on Alert: Terror Mastermind Hafiz Saeed Ally’s Bangladesh Border Visit Raises Security Concern\n\nIndia-Bangladesh trade tensions :\n\n\n\n\n\n\n\nPakistan has granted Bangladesh access to Karachi Port in an effort to revitalize bilateral trade, marking a notable outcome of the 9th Pak–Bangladesh Joint ...",
    "category": "Trade Policy",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  },
  {
    "id": 1102,
    "title": "'Misplaced': MEA rejects Yunus govt claim; clarifies 'no-anti Bangladesh acts from Indian soil'",
    "url": "https://timesofindia.indiatimes.com/india/misplaced-mea-rejects-yunus-govt-claim-clarifies-no-anti-bangladesh-acts-from-indian-soil/articleshow/123412963.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "MEA spokesperson Randhir Jaiswal (PTI)\n\n‘India Profiting From Russian Oil’: Scott Bessent Hits Out Again Over Arbitrage, But Backs China\n\nNEW DELHI: The ministry of external affairs on Wednesday dismissed concerns raised by Bangladesh's interim government led by Muhammad Yunus , clarifying that Indi...",
    "category": "Unemployment",
    "country": "Bangladesh",
    "published_date": "2025-12-01"
  }
]