[
  {
    "id": 4696,
    "title": "Tunisia: MMR stabilizes at 7.49% in November for third consecutive month",
    "url": "https://en.africanmanager.com/tunisia-mmr-stabilizes-at-7-49-in-november-for-third-consecutive-month/",
    "source": "en.africanmanager.com",
    "description": "The average money market rate (MMR) remained stable at 7.49% in November 2025, for the third consecutive month, according to the latest data published by the Central Bank of Tunisia (BCT).\n\nThis stability reflects a certain calming in the money market, without signaling an immediate drop in the cost...",
    "category": "Central Bank",
    "country": "Tunisia",
    "published_date": "2025-12-01"
  },
  {
    "id": 4697,
    "title": "Tunisia: Net foreign exchange reserves cover 105 days of imports",
    "url": "https://en.africanmanager.com/tunisia-net-foreign-exchange-reserves-cover-105-days-of-imports/",
    "source": "en.africanmanager.com",
    "description": "Net foreign exchange reserves reached 24.6 billion dinars as of November 28, representing 105 days of import coverage.\n\nCompared to the same period last year, foreign currency reserves have slightly decreased by 1.3%, according to the monetary and financial indicators published by the Central Bank o...",
    "category": "Central Bank",
    "country": "Tunisia",
    "published_date": "2025-12-01"
  },
  {
    "id": 4701,
    "title": "Over ten million tourists this year — Tunisia is riding high",
    "url": "https://en.africanmanager.com/over-ten-million-tourists-this-year-tunisia-is-riding-high/",
    "source": "en.africanmanager.com",
    "description": "Tunisia’s tourism sector experienced remarkable growth in 2025, with more than 10.03 million tourists visiting the country between January 1 and November 20, an increase of 10.3% compared to the previous year.\n\nThis trend is expected to help the country reach its ambitious target of 11 million visit...",
    "category": "Economic Growth",
    "country": "Tunisia",
    "published_date": "2025-12-01"
  },
  {
    "id": 4692,
    "title": "Tunisia economy grows by 2.4% in third quarter of 2025",
    "url": "https://www.zawya.com/en/economy/north-africa/tunisia-economy-grows-by-24-in-third-quarter-of-2025-t6e0bh4d",
    "source": "www.zawya.com",
    "description": "TUNIS: Tunisia's economy grew slightly by 2.4% year-on-year in the third quarter of 2025, driven by a growth in agricultural activity, the National Institute of Statistics showed on Saturday.\n\nIn the same quarter last year, the economy grew by 2.1%.\n\nThe agriculture sector rose in the first month of...",
    "category": "Economy",
    "country": "Tunisia",
    "published_date": "2025-12-01"
  },
  {
    "id": 4694,
    "title": "Tunisia can fast-track its green transition through renewable energy - EU Commission President",
    "url": "https://www.zawya.com/en/economy/north-africa/tunisia-can-fast-track-its-green-transition-through-renewable-energy-eu-commission-president-unsr3dcz",
    "source": "www.zawya.com",
    "description": "Tunis –The African Union (AU) and the European Union (EU) are celebrating in November 25 years of a “unique” partnership and strengthened economic, political, and social ties.\n\nThe 7th AU–EU Summit, taking place on November 24-25 in Luanda, Angola, will mark a quarter-century of “unique and fruitful...",
    "category": "Economy",
    "country": "Tunisia",
    "published_date": "2025-12-01"
  },
  {
    "id": 4690,
    "title": "Boosting Social Safety Nets to Aid Tunisia's Recovery",
    "url": "https://www.miragenews.com/boosting-social-safety-nets-to-aid-tunisias-1578338/",
    "source": "www.miragenews.com",
    "description": "TUNIS, November 26, 2025 - Tunisia's economy is showing signs of recovery, supported by stronger agricultural production, a revival in the construction sector, and improving tourism, according to the World Bank 's latest economic update, \"Strengthening Social Safety Nets for Increased Efficiency and...",
    "category": "GDP",
    "country": "Tunisia",
    "published_date": "2025-12-01"
  },
  {
    "id": 4691,
    "title": "Tunisian inflation falls again in September, to 5.8 percent",
    "url": "https://uk.news.yahoo.com/news/tunisian-inflation-falls-again-september-5-8-percent-125840627--sector.html",
    "source": "uk.news.yahoo.com",
    "description": "TUNIS, Oct 4 (Reuters) - Tunisia's annual inflation rate fell to 5.8 percent in September, its third consecutive monthly decline, official data showed on Friday. Inflation was 6 percent in August and 6.2 percent in July, having fallen from 6.5 percent in March, the highest rate in at least five year...",
    "category": "Inflation",
    "country": "Tunisia",
    "published_date": "2025-12-01"
  }
]