[
  {
    "id": 493,
    "title": "Armenia’s GDP Grew by 5.1% in the First Quarter of 2025 and 5.9% in the Second • MassisPost",
    "url": "https://massispost.com/2025/08/armenias-gdp-grew-by-5-1-in-the-first-quarter-of-2025-and-5-9-in-the-second/",
    "source": "massispost.com",
    "description": "YEREVAN — The National Statistical Committee reported that Armenia’s GDP in the second quarter of 2025 increased by 5.9% compared to the same period in 2024.\n\nIn nominal terms, GDP at current prices reached 2,397,624.6 million drams by the end of the reporting period. GDP per capita at market prices...",
    "category": "GDP",
    "country": "Armenia",
    "published_date": "2025-08-01"
  },
  {
    "id": 511,
    "title": "5 International High Yield Savings Account Options",
    "url": "https://www.investasian.com/economy/high-yield-savings-account/",
    "source": "www.investasian.com",
    "description": "For those looking to grow their wealth while keeping it secure, high-yield savings accounts have become a popular option.\n\nUnlike traditional savings accounts that offer meager interest rates, high-yield accounts provide far higher returns – especially if you’re willing to explore international bank...",
    "category": "Interest Rates",
    "country": "Armenia",
    "published_date": "2025-08-01"
  },
  {
    "id": 501,
    "title": "Armenia’s Central Bank keeps refinancing rate unchanged at 6.75% – Public Radio of Armenia",
    "url": "https://en.armradio.am/2025/08/05/armenias-central-bank-keeps-refinancing-rate-unchanged-at-6-75-2/",
    "source": "en.armradio.am",
    "description": "The Board of the Central Bank of Armenia (CBA) has decided to keep the refinancing rate unchanged at 6.75%, citing a complex mix of domestic growth and persistent global uncertainties.\n\nIn its latest Executive Monetary Policy Statement, the CBA noted that annual inflation in Armenia accelerated to 3...",
    "category": "Monetary Policy",
    "country": "Armenia",
    "published_date": "2025-08-01"
  },
  {
    "id": 517,
    "title": "Unemployment rate in Armenia falls: statistics and commentary",
    "url": "https://jam-news.net/unemployment-rate-in-armenia/",
    "source": "jam-news.net",
    "description": "Unemployment rate in Armenia\n\nIn the first three months of 2025, Armenia’s unemployment rate fell to 14%, down from 15.5% a year earlier. According to the latest data from the Statistical Committee, employment also rose over the same period – from 48.7% last year to 50.1% – while economic activity i...",
    "category": "Unemployment",
    "country": "Armenia",
    "published_date": "2025-08-01"
  }
]