[
  {
    "id": 3683,
    "title": "Pakistan restricts foreign currency sales to digital channels",
    "url": "https://www.arabianbusiness.com/industries/banking-finance/pakistan-restricts-foreign-currency-sales-to-digital-channels",
    "source": "www.arabianbusiness.com",
    "description": "Pakistan’s central bank has ordered foreign exchange dealers to process all foreign currency sales for residents exclusively through account-to-account digital transfers, part of a wider effort to promote a cashless economy and tighten oversight of money flows, according to a Bloomberg report .\n\nThe...",
    "category": "Currency Exchange Rates",
    "country": "Pakistan",
    "published_date": "2025-11-01"
  },
  {
    "id": 3656,
    "title": "Pakistan, Egypt agree to boost economic and defence ties after years of stagnation",
    "url": "https://www.firstpost.com/world/pakistan-egypt-agree-to-boost-economic-and-defence-ties-after-years-of-stagnation-13955338.html",
    "source": "www.firstpost.com",
    "description": "Pakistan and Egypt agreed on Sunday to deepen ties in economic, commercial, cultural and defence sectors after years of stagnant relationship.\n\nIn a push to revive a relationship that has remained largely inactive for years, Pakistan and Egypt on Sunday agreed to strengthen cooperation across econom...",
    "category": "Economy",
    "country": "Pakistan",
    "published_date": "2025-11-01"
  },
  {
    "id": 3657,
    "title": "Pakistan's Economic Crisis Worsens After Prolonged Border Closure With Afghanistan",
    "url": "https://www.republicworld.com/world-news/pakistan-s-economic-crisis-worsens-after-prolonged-border-closure-with-afghanistan",
    "source": "www.republicworld.com",
    "description": "Karachi, Pakistan: The ongoing closure of the Pakistan-Afghanistan border since October 11 has dealt a severe blow to Pakistan's trade, manufacturing, and export sectors, worsening the country's already fragile economic situation.\n\nThe standoff has not only halted two-way trade but also triggered sh...",
    "category": "Economy",
    "country": "Pakistan",
    "published_date": "2025-11-01"
  },
  {
    "id": 3639,
    "title": "How Corruption Is Bleeding 6% of Pakistan’s GDP Every Year: 'Economically Brittle, Politically Unstable, Bailout-Dependent'",
    "url": "https://www.timesnownews.com/business-economy/economy/economically-brittle-politically-unstable-bailout-dependent-how-corruption-is-bleeding-6-of-pakistans-gdp-every-year-article-153205773",
    "source": "www.timesnownews.com",
    "description": "\"Economically brittle, politically unstable, and chronically dependent on bailouts …,\" these were the words used by the International Monetary Fund (IMF) to describe Pakistan's state of affairs. The 186-page Governance and Corruption Diagnostic Report released by IMF exposes Pakistan's policy failur...",
    "category": "GDP",
    "country": "Pakistan",
    "published_date": "2025-11-01"
  },
  {
    "id": 3677,
    "title": "Pakistan’s Unemployment Rate Hits 7.1% as Average Wages Surge",
    "url": "https://www.techjuice.pk/pakistans-unemployment-rate-hits-7-1-as-average-wages-surge/",
    "source": "www.techjuice.pk",
    "description": "The Pakistan Bureau of Statistics (PBS) released its latest Labor Force Survey yesterday, revealing a challenging shift in the country’s job market. Pakistan’s unemployment rate has climbed to 7.1% over the past four years. This marks a notable rise from the 6.3% recorded during the 2020-21 period.\n...",
    "category": "Unemployment",
    "country": "Pakistan",
    "published_date": "2025-11-01"
  },
  {
    "id": 3681,
    "title": "Pakistan’s Unemployment Rate Rises to 7% Under New Labour Survey",
    "url": "https://www.techjuice.pk/pakistans-unemployment-rate-rises-to-7-under-new-labour-survey/",
    "source": "www.techjuice.pk",
    "description": "Pakistan’s unemployment rate is expected to rise to nearly 7% in 2024–25, according to preliminary findings of the latest Labour Force Survey, marking a significant shift from the previously recorded 6.3%. The increase comes after Pakistan adopted a new international labour measurement system that c...",
    "category": "Unemployment",
    "country": "Pakistan",
    "published_date": "2025-11-01"
  }
]