[
  {
    "id": 2135,
    "title": "Gabon Introduces KIMBA to Drive Demand-Supply Matching in Digital Services",
    "url": "https://www.ecofinagency.com/news-digital/3011-50977-gabon-introduces-kimba-to-drive-demand-supply-matching-in-digital-services",
    "source": "www.ecofinagency.com",
    "description": "News Digital\n\nPlatform matches corporate needs with local tech solutions in real time\n\n\n\n\n\nAims to boost national innovation, digital transition, and competitiveness\n\n\n\nGabon's Minister of Digital Economy launched the KIMBA platform on Friday, presenting it as an instrument for the digital transform...",
    "category": "Economy",
    "country": "Gabon",
    "published_date": "2025-12-01"
  },
  {
    "id": 2137,
    "title": "Gabon introduces digital services platform for businesses",
    "url": "https://developingtelecoms.com/telecom-technology/enterprise-ecosystems/19427-gabon-introduces-digital-services-platform-for-businesses.html",
    "source": "developingtelecoms.com",
    "description": "Gabon has introduced a new platform. Called Kimba, its aim is to drive demand and supply matching in digital services.\n\nGabon's Minister of Digital Economy, Mark Alexandre Doumba, launched the Kimba platform late last week. In the local Nzebi language, Kimba apparently means to move, go, move forwar...",
    "category": "Economy",
    "country": "Gabon",
    "published_date": "2025-12-01"
  },
  {
    "id": 2134,
    "title": "Subcontractor Unrest Threatens Stability of Gabon’s Oil Sector",
    "url": "https://www.ecofinagency.com/news-industry/2711-50902-subcontractor-unrest-threatens-stability-of-gabon-s-oil-sector",
    "source": "www.ecofinagency.com",
    "description": "News Industry\n\nSubcontracted workers in Gabon’s oil industry threaten to strike before December 31 over precarious working conditions.\n\nThe extractive sector accounts for over 30% of Gabon’s GDP and crude oil represented 67% of exports in 2023.\n\nThe government plans to address job insecurity in the ...",
    "category": "GDP",
    "country": "Gabon",
    "published_date": "2025-12-01"
  }
]