[
  {
    "id": 2505,
    "title": "There Has Been Denomination In Iran",
    "url": "https://charter97.org/en/news/2025/11/22/663996/",
    "source": "charter97.org",
    "description": "There Has Been Denomination In Iran 8 22.11.2025, 18:09\n\n6,446\n\nReal lost four zeros.\n\nIranian President Masoud Pezeshkian signed a decree on currency denomination and notified the Central Bank, the Iranian leader's administration said.\n\n\"Pezeshkian notified the Central Bank of the entry into force ...",
    "category": "Central Bank",
    "country": "Iran",
    "published_date": "2025-11-01"
  },
  {
    "id": 2519,
    "title": "BRICS, SCO, EAEU Opening Major Economic Opportunities for Iran: President",
    "url": "https://www.tasnimnews.com/en/news/2025/11/22/3454003/brics-sco-eaeu-opening-major-economic-opportunities-for-iran-president",
    "source": "www.tasnimnews.com",
    "description": "Speaking at an annual conference on Iranian capital market, titled “Resilience, Innovation, Growth,” Pezeshkian referred to Iran’s active presence in BRICS, the SCO, and the EAEU, saying these diplomatic engagements have led to the strengthening of constructive relations with the neighboring countri...",
    "category": "Economic Growth",
    "country": "Iran",
    "published_date": "2025-11-01"
  },
  {
    "id": 2501,
    "title": "‘Iran is going to face the fate of Soviet Union’: Experts on why the Islamic Republic may be nearing collapse",
    "url": "https://www.theweek.in/news/middle-east/2025/11/19/iran-is-going-to-face-the-fate-of-soviet-union-experts-on-why-the-islamic-republic-may-be-nearing-collapse.html",
    "source": "www.theweek.in",
    "description": "The Islamic Republic of Iran appears to be in a weak situation, similar to how the Soviet Union was before it collapsed. US experts Norman Roule and Mark Dubowitz believe that Iran, which is facing a slew of economic and military failures, isn’t far from collapse.\n\nRoule, a former CIA official in ch...",
    "category": "Economy",
    "country": "Iran",
    "published_date": "2025-11-01"
  },
  {
    "id": 2496,
    "title": "Inflation rate rises 1.5%",
    "url": "https://www.tehrantimes.com/news/520909/Inflation-rate-rises-1-5",
    "source": "www.tehrantimes.com",
    "description": "TEHRAN - The Statistical Center of Iran (SCI) has put the average inflation rate in the twelve-month period ended on October 22, which marks the end of the eighth Iranian calendar month Aban, at 40.4 percent, rising 1.5 percent from the figure for the twelve-month ended to the seventh month.\n\nThe ce...",
    "category": "Inflation",
    "country": "Iran",
    "published_date": "2025-11-01"
  }
]