[
  {
    "id": 1845,
    "title": "Uganda’s golden smokescreen: The real cost of conflict in the Democratic Republic of the Congo",
    "url": "https://globalvoices.org/2025/10/20/ugandas-golden-smokescreen-the-real-cost-of-conflict-in-the-democratic-republic-of-the-congo/",
    "source": "globalvoices.org",
    "description": "By Sam Irving\n\nIn eastern parts of the Democratic Republic of the Congo (DRC), conflict creates more than just human tragedy and a breakdown in governance; it also blurs the trail of the country’s most valuable natural resources, namely gold. In neighboring Uganda, gold exports have risen sharply ov...",
    "category": "Economy",
    "country": "Democratic Republic of the Congo",
    "published_date": "2025-10-01"
  },
  {
    "id": 1829,
    "title": "Inside the rebel-held mines in eastern Congo that help power your smartphone",
    "url": "https://www.channel4.com/news/inside-the-rebel-held-mines-in-eastern-congo-that-help-power-your-smartphone",
    "source": "www.channel4.com",
    "description": "Rebels have captured vast areas of eastern Democratic Republic of the Congo.\n\nThat land, controlled by the M23 movement, is rich in critical minerals which the rest of the world is desperate to get its hands on.\n\nIt’s a scramble involving the US, China and tech giants which is helping fuel a devasta...",
    "category": "GDP",
    "country": "Democratic Republic of the Congo",
    "published_date": "2025-10-01"
  },
  {
    "id": 1830,
    "title": "US Energy Investor HYDRO-LINK and the Government of the Democratic Republic Of Congo Sign Major Agreement to Deliver Excess Hydropower from Angola to the DRC through $1.5 Billion Power Cross-Border Tr",
    "url": "https://allafrica.com/stories/202510150472.html",
    "source": "allafrica.com",
    "description": "Paul Hinks, Chairman and CEO of New York-based energy investor HYDRO-LINK, and Aimé Sakombi Molendo, Minister of Hydraulic Resources and Electricity, Democratic Republic of the Congo (DRC) sign a Memorandum of Understanding to build a 1,150-kilometer (720 miles), $1.5 billion electricity transmissio...",
    "category": "GDP",
    "country": "Democratic Republic of the Congo",
    "published_date": "2025-10-01"
  }
]