[
  {
    "id": 4993,
    "title": "Inflation, currency woes worsen Venezuela's complex crisis as Maduro declares 'economic emergency'",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/inflation-currency-woes-worsen-venezuelas-complex-crisis-as-maduro-declares-economic-emergency/articleshow/120302559.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Inflation, currency woes worsen Venezuela's complex crisis as Maduro declares 'economic emergency' Inflation, currency woes worsen Venezuela's complex crisis as Maduro declares 'economic emergency' (AP Photo/Ariana Cubillos) Inflation, currency woes worsen Venezuela's complex crisis as Maduro declar...",
    "category": "Economic Growth",
    "country": "Venezuela",
    "published_date": "2025-12-01"
  },
  {
    "id": 4995,
    "title": "ASX Preview: Australian Shares Set to Rise on Strong Economic Data, Higher Oil Prices; Collins Foods Posts Higher Fiscal H1 Underlying Earnings, Revenue",
    "url": "https://au.finance.yahoo.com/news/asx-preview-australian-shares-set-231236396.html",
    "source": "au.finance.yahoo.com",
    "description": "MT Newswires -Shutterstock\n\nAustralian shares are poised to rise on Tuesday as investors eye stronger-than-expected economic growth and robust consumer and business activity, amid speculation the Reserve Bank may consider a future interest-rate hike.\n\n\n\nThe market is also buoyed by climbing global o...",
    "category": "Economic Growth",
    "country": "Venezuela",
    "published_date": "2025-12-01"
  },
  {
    "id": 4985,
    "title": "Venezuela oil: Trump is threatening to attack a country with more oil than Iraq",
    "url": "https://edition.cnn.com/2025/12/02/business/venezuela-oil-trump",
    "source": "edition.cnn.com",
    "description": "The United States appears ready for war with Venezuela, a prospect that Venezuelan President Nicolás Maduro this weekend attributed to America’s desire to control the country’s vast oil reserves.\n\nThe US State Department has denied that oil played a central role in America’s military sending more th...",
    "category": "Economy",
    "country": "Venezuela",
    "published_date": "2025-12-01"
  },
  {
    "id": 4990,
    "title": "Live updates: Trump presidency, Venezuela news, Witkoff and Kushner meet with Putin for Ukraine talks",
    "url": "https://edition.cnn.com/world/live-news/trump-ukraine-russia-venezuela-12-02-2025?post-id=cmiox9pvf00003b6nstva0n9q",
    "source": "edition.cnn.com",
    "description": "President Donald Trump said Tuesday he will soon begin striking targets inside Venezuela, an escalation of his administration’s offensive against alleged drug traffickers.\n\n“We’re going to start doing those strikes on land too,” he said during a Cabinet meeting. “We know where they live. We know whe...",
    "category": "Economy",
    "country": "Venezuela",
    "published_date": "2025-12-01"
  },
  {
    "id": 4980,
    "title": "'Affordability is a con job by the Democrats,' Trump says",
    "url": "https://www.usatoday.com/story/news/politics/2025/12/02/trump-cabinet-meeting-venezuela-live-updates/87566205007/",
    "source": "www.usatoday.com",
    "description": "Updated Dec. 2, 2025, 6:09 p.m. ET\n\nWASHINGTON − President Donald Trump blasted Democrats during his ninth Cabinet meeting for complaining about inflation after prices have fallen for products such as gasoline and groceries, part of a broader lament that his administration wasn't getting the credit ...",
    "category": "Inflation",
    "country": "Venezuela",
    "published_date": "2025-12-01"
  },
  {
    "id": 4981,
    "title": "Amid tensions with US, high inflation is back on Venezuela’s streets",
    "url": "https://uk.news.yahoo.com/amid-tensions-us-high-inflation-050101416.html",
    "source": "uk.news.yahoo.com",
    "description": "As Venezuelan President Nicolas Maduro faces growing US military pressure and calls for his resignation, an old foe is returning to haunt him in his own backyard: Inflation, one of Venezuela’s chronic economic maladies, is on the rise again.\n\n“Prices are growing every day,” said Yon Michael Hernande...",
    "category": "Inflation",
    "country": "Venezuela",
    "published_date": "2025-12-01"
  },
  {
    "id": 4984,
    "title": "Trump and Hegseth provide new details on controversial strikes on alleged drug boat",
    "url": "https://www.cbsnews.com/live-updates/trump-cabinet-meeting-venezuela/",
    "source": "www.cbsnews.com",
    "description": "",
    "category": "Inflation",
    "country": "Venezuela",
    "published_date": "2025-12-01"
  }
]