[
  {
    "id": 3331,
    "title": "Nepal Issues New 100 Rupees Note With Revised Map Showing Indian Territories",
    "url": "https://swarajyamag.com/news-brief/nepal-issues-new-100-rupees-note-with-revised-map-showing-indian-territories",
    "source": "swarajyamag.com",
    "description": "Nepal’s central bank on Thursday (27 November) released new Rs 100 currency notes carrying a revised national map that includes Kalapani, Lipulekh and Limpiyadhura, territories India asserts fall within its borders, the Indian Express reported.\n\nThe Nepal Rastra Bank's (NRB) new note bears the signa...",
    "category": "Central Bank",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3355,
    "title": "Nepal Police thwarts foreign currency smuggling attempt to China, confiscate thousands of USD, Euro",
    "url": "https://www.aninews.in/news/world/asia/nepal-police-thwarts-foreign-currency-smuggling-attempt-to-china-confiscate-thousands-of-usd-euro20250318173923/",
    "source": "www.aninews.in",
    "description": "Kathmandu [Nepal], March 18 (ANI): The Kathmandu Valley Crime Investigation Office has thwarted an attempt to smuggle thousands of US dollars and Euros to China, a record seizure in the history of the Himalayan country, as per officials.\n\nCrime Investigation Office under the Nepal Police on Tuesday ...",
    "category": "Currency Exchange Rates",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3357,
    "title": "Breaking news live updates, March 18: EAM Dr S Jaishankar meets Nepal's foreign minister Arzu Rana Deuba",
    "url": "https://timesofindia.indiatimes.com/india/breaking-news-live-updates-march-18/liveblog/119137979.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "07:00 (IST) Mar 18\n\nIsrael carried out airstrikes in the Gaza Strip, southern Lebanon and southern Syria on Monday, killing at least 10 people, including a child, according to local authorities. The Israeli military said it was targeting militants plotting attacks.\n\nThe airstrikes were the latest in...",
    "category": "Currency Exchange Rates",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3344,
    "title": "Finance Minister calls for review of slow economic growth",
    "url": "https://thehimalayantimes.com/nepal/finance-minister-calls-for-review-of-slow-economic-growth",
    "source": "thehimalayantimes.com",
    "description": "KATHMANDU, DECEMBER 1\n\nFinance Minister Rameshwor Khanal has called for a serious assessment of why Nepal has failed to achieve expected levels of economic growth, citing political instability as a major cause.\n\nSpeaking at the 29th anniversary event of the Society of Economic Journalists Nepal (SEJ...",
    "category": "Economic Growth",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3345,
    "title": "CareEdge Says Nepal’s Growth Slows Sharply As Unrest Hits Tourism, Trade",
    "url": "https://www.businessworld.in/article/careedge-says-nepal-s-growth-slows-sharply-as-unrest-hits-tourism-trade-577957",
    "source": "www.businessworld.in",
    "description": "Nepal’s economy is facing a sharp slowdown as political unrest, weak tourism activity and a widening trade deficit weigh on recovery prospects, CareEdge Ratings said in its Nepal economy update.\n\nThe World Bank has cut Nepal’s growth forecast for FY2025/26 to 2.1 per cent from over 5 per cent earlie...",
    "category": "Economic Growth",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3346,
    "title": "Nepal Eyes India-centric Growth Model Built On Energy, Youth And Integration",
    "url": "https://www.businessworld.in/article/nepal-eyes-india-centric-growth-model-built-on-energy-youth-and-integration-579177",
    "source": "www.businessworld.in",
    "description": "Nepal sees India as pivotal to its economic transformation, with hydropower, tourism, youthful labour, and tighter supply-chain linkages forming the pillars of a new growth vision. Ambassador Shankar Sharma, Nepal’s envoy to India, outlined a roadmap that places institutional reform, capital mobilis...",
    "category": "Economic Growth",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3326,
    "title": "FDI pledges surge, but Nepal still struggles to cash in",
    "url": "https://myrepublica.nagariknetwork.com/news/fdi-commitments-swell-while-realization-is-pathetic-25-45.html",
    "source": "myrepublica.nagariknetwork.com",
    "description": "KATHMANDU, Nov 21: The gap between foreign direct investment (FDI) commitments and actual inflows has continued to widen as Nepal struggles to convert pledged investments into real projects.\n\nData from the Department of Industry (DoI) and Nepal Rastra Bank (NRB) show a significant mismatch between c...",
    "category": "Economy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3320,
    "title": "Nepal’s gold imports soar fivefold amid turmoil",
    "url": "https://asianews.network/nepals-gold-imports-soar-fivefold-amid-turmoil/",
    "source": "asianews.network",
    "description": "November 27, 2025\n\nKATHMANDU – Amid a global surge in bullion prices, Nepal’s gold imports in the first four months of the current fiscal year soared more than fivefold compared to the same period last year, with analysts attributing the spike to deepening political uncertainty and a gloomy investme...",
    "category": "Fiscal Policy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3321,
    "title": "NRB eases rules to boost lending amid excess liquidity",
    "url": "https://myrepublica.nagariknetwork.com/news/nrb-flexible-to-facilitate-increasing-banks-loans-to-individual-persons-96-95.html",
    "source": "myrepublica.nagariknetwork.com",
    "description": "KATHMANDU, Dec 2: With banks holding surplus liquidity and interest rates at historic lows, Nepal Rastra Bank (NRB) has moved to relax several provisions to encourage greater credit flow into the economy. The central bank’s first review of the Monetary Policy 2025/26 announced on Monday signals a mo...",
    "category": "Fiscal Policy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3314,
    "title": "Meltdown in Nepal",
    "url": "https://www.financialexpress.com/opinion/meltdown-in-nepal/3973604/",
    "source": "www.financialexpress.com",
    "description": "There is a sense of déjà vu regarding the massive anti-government student protests in Nepal that toppled the government headed by Prime Minister KP Sharma Oli. Last August, weeks of student protests in Bangladesh forced PM Sheikh Hasina to flee to India. Three years ago, escalating nationwide protes...",
    "category": "Inflation",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3315,
    "title": "Nepal’s Gen Z unrest wipes billions off economy as multinationals report mixed first-quarter results",
    "url": "https://asianews.network/nepals-gen-z-unrest-wipes-billions-off-economy-as-multinationals-report-mixed-first-quarter-results/",
    "source": "asianews.network",
    "description": "November 24, 2025\n\nKATHMANDU – The September Gen Z violent protest against corruption and the social media ban has not only inflicted economic losses running into billions but also dented the profits of multinational companies operating in Nepal.\n\nUnilever Nepal, the country’s largest fast-moving co...",
    "category": "Inflation",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3332,
    "title": "Commercial banks further reduce interest rates for Mangsir",
    "url": "https://myrepublica.nagariknetwork.com/news/commercial-banks-further-reduce-interest-rates-for-mangsir-55-95.html",
    "source": "myrepublica.nagariknetwork.com",
    "description": "KATHMANDU, Nov 16: Commercial banks have lowered their average interest rates for the month of Mangsir (mid-November to mid-December), according to the latest data published by 20 commercial banks. The newly released rate sheets show that interest rates have declined compared to those offered in Kar...",
    "category": "Interest Rates",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3317,
    "title": "Monetary policy cautiously flexible: NRB",
    "url": "https://thehimalayantimes.com/business/monetary-policy-cautiously-flexible-nrb",
    "source": "thehimalayantimes.com",
    "description": "KATHMANDU, DECEMBER 1\n\nThe central bank has continued a cautious flexibility of the monetary policy through its first quarterly review of the current fiscal year.\n\nNepal Rastra Bank made public the first quarterly review (monetary) of the fiscal year, 2082/83. It has brought flexible provisions in t...",
    "category": "Monetary Policy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3334,
    "title": "UK Comments on Nepal's WTO Trade Policy Review",
    "url": "https://www.miragenews.com/uk-comments-on-nepals-wto-trade-policy-review-1572684/",
    "source": "www.miragenews.com",
    "description": "Chair, let me welcome the Nepalese delegation, led by Commerce and Industry Secretary Dr. Ghimire, to its 3rd Trade Policy Review and thank both the government of Nepal and the WTO Secretariat for their Reports. I would also like to convey my appreciation to our discussant, the Ambassador of Japan, ...",
    "category": "Trade Policy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3336,
    "title": "Indo-Nepal border returns to normal, trade resumes",
    "url": "https://timesofindia.indiatimes.com/city/lucknow/indo-nepal-border-returns-to-normal-trade-resumes/articleshow/123887409.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "1\n\n2\n\n3\n\nIndia-Nepal Border On High Alert As PM Oli Resigns Amid Violent Protests; MEA Issues Advisory\n\n\n\n\n\nLucknow: The Indo-Nepal border is gradually returning to normalcy following the establishment of an interim government in Nepal. The sealed borders between Uttar Pradesh and Nepal were reopene...",
    "category": "Trade Policy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3337,
    "title": "Why Nepal Must Complete Its WTO Obligations",
    "url": "https://myrepublica.nagariknetwork.com/news/why-nepal-must-complete-its-wto-obligations-27-62.html",
    "source": "myrepublica.nagariknetwork.com",
    "description": "The essence of the WTO accession protocol rested on transparency, predictability and the rule of law, which are key pillars of good governance. A major purpose of the accession commitments was to help strengthen governance within the state.\n\nThe Government of Nepal recognised that technical integrat...",
    "category": "Trade Policy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3338,
    "title": "Nepal unrest disrupts travel and trade at Bihar-Nepal border",
    "url": "https://timesofindia.indiatimes.com/city/patna/nepal-unrest-disrupts-travel-and-trade-at-bihar-nepal-border/articleshow/123792121.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Demonstrators carry weapons, taken from the Supreme Court, take part in a protest against Monday's killing of 19 people after anti-corruption protests that were triggered by a social media ban, in Kathmandu, Nepal\n\nMotihari/Bettiah:\n\nIndia Issues Preventive Alert Along Nepal Border Amid Widespread K...",
    "category": "Trade Policy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  },
  {
    "id": 3340,
    "title": "Nepal: Oli's UML's policy convention calls India, China to withdraw agreement on Lipulekh",
    "url": "https://www.aninews.in/news/world/asia/nepal-olis-umls-policy-convention-calls-india-china-to-withdraw-agreement-on-lipulekh20250908002422/",
    "source": "www.aninews.in",
    "description": "Lalitpur [Nepal], September 8 (ANI): The CPN-UML (Communist Party of Nepal- Unified Marxist Leninist) has expressed serious disagreement with the agreement between India and China to use Nepal's Lipulekh for trade.\n\nEndorsing the special document that concluded on Sunday, the UML has called on both ...",
    "category": "Trade Policy",
    "country": "Nepal",
    "published_date": "2025-12-01"
  }
]