[
  {
    "id": 3701,
    "title": "At least 90 arrests at major Palestine Action protest in London",
    "url": "https://uk.news.yahoo.com/least-90-arrests-major-palestine-164955750.html",
    "source": "uk.news.yahoo.com",
    "description": "AT least 90 people have been arrested at a protest in London against the banning of Palestine Action as a terror group.\n\nAround 100 people gathered in Tavistock Square Gardens, central London, on Saturday afternoon for the Defend Our Juries protest, as police officers formed a queue to methodically ...",
    "category": "Central Bank",
    "country": "Palestine",
    "published_date": "2025-12-01"
  },
  {
    "id": 3704,
    "title": "Business News: Importance of critical minerals",
    "url": "https://ca.news.yahoo.com/business-news-importance-critical-minerals-174343665.html",
    "source": "ca.news.yahoo.com",
    "description": "In political and resource circles, the term critical minerals is all rage. What are they and can they play an important role in boosting economic growth? Financial analyst, Michael Campbell joins Global News Morning with Business news.",
    "category": "Economic Growth",
    "country": "Palestine",
    "published_date": "2025-12-01"
  },
  {
    "id": 3695,
    "title": "Spain, Palestine will hold first summit this year: PM Sanchez",
    "url": "https://www.zeebiz.com/economy-infra/world-economy/news-spain-palestine-will-hold-first-bilateral-summit-this-year-to-strengthen-ties-prime-minister-pedro-sanchez-313064",
    "source": "www.zeebiz.com",
    "description": "Spanish Prime Minister Pedro Sanchez announced that Spain and Palestine will hold their first bilateral summit this year to strengthen ties.\n\n\"Before the end of this year we are going to hold the first bilateral summit between Spain and Palestine in which we hope to sign several collaboration agreem...",
    "category": "Economy",
    "country": "Palestine",
    "published_date": "2025-12-01"
  },
  {
    "id": 3703,
    "title": "Stormont: DUP bid to overturn minister's Israel trade block fails",
    "url": "https://www.bbc.com/news/articles/cn8eg40jz92o",
    "source": "www.bbc.com",
    "description": "Executive rejects DUP bid to overturn minister's Israel trade block\n\n7 days ago Share Save Enda McClafferty Northern Ireland political editor Share Save\n\nPA Media Caoimhe Archibald ordered her department not to fund companies providing weapons for the Israeli government\n\nA DUP move to block a decisi...",
    "category": "Trade Policy",
    "country": "Palestine",
    "published_date": "2025-12-01"
  }
]