[
  {
    "id": 3154,
    "title": "Mauritius police issue arrest order for former central bank governor",
    "url": "https://www.deccanherald.com/world/mauritius-police-issue-arrest-order-for-former-central-bank-governor-2-3318433",
    "source": "www.deccanherald.com",
    "description": "Mauritius police issue arrest order for former central bank governor\n\nThe action, by the police anti-money laundering unit, is the first significant one from the government of Prime Minister Navin Ramgoolam, who said last week the outgoing government had falsified the country's gross domestic produc...",
    "category": "Central Bank",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3155,
    "title": "India, Mauritius join hands to trade in local currencies",
    "url": "https://www.zeebiz.com/world/news-india-mauritius-join-hands-to-trade-in-local-currencies-351433",
    "source": "www.zeebiz.com",
    "description": "The agreement was to establish a framework to promote trade in the local currencies of both countries.\n\nThe MoU documents were exchanged in the presence of Prime Minister Narendra Modi and Mauritius counterpart Navinchandra Ramgoolam on March 12, 2025. PM Modi was on a state visit to the island nati...",
    "category": "Central Bank",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3156,
    "title": "Mauritius Arrests Former Central Bank Governor, Finance Minister in Embezzlement Case",
    "url": "https://www.deccanherald.com/world/mauritius-arrests-ex-central-bank-governor-finance-minister-in-embezzlement-case-2-3486770",
    "source": "www.deccanherald.com",
    "description": "Mauritius arrests ex-central bank governor, finance minister in embezzlement case\n\nFormer central bank governor Harvesh Seegolam and former finance minister Renganaden Padayachy have denied wrongdoing and did not respond to requests for comment on Wednesday.",
    "category": "Central Bank",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3149,
    "title": "\"Not assistance but investment in shared future...\": PM Modi announces Special Economic Package for Mauritius",
    "url": "https://www.aninews.in/news/world/asia/not-assistance-but-investment-in-shared-future-pm-modi-announces-special-economic-package-for-mauritius20250911141923/",
    "source": "www.aninews.in",
    "description": "Varanasi (Uttar Pradesh) [India], September 11 (ANI): Prime Minister Narendra Modi on Thursday held delegation-level talks with his Mauritian counterpart Navinchandra Ramgoolam in Varanasi and announced India's special economic package for the Indian Ocean country that supports infrastructure, emplo...",
    "category": "Economy",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3150,
    "title": "India in talks with 50 nations for trade deals: Goyal",
    "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-in-talks-with-50-nations-for-trade-deals-goyal/articleshow/125632607.cms",
    "source": "economictimes.indiatimes.com",
    "description": "Live Events\n\n\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n(You can now subscribe to our\n\n(You can now subscribe to our Economic Times WhatsApp channel\n\nIndia is in talks with 50 countries for trade agreements through 14 groups, Union Commerce and Industr...",
    "category": "Economy",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3151,
    "title": "Q2 equity FDI down 11% as tech, services lose steam",
    "url": "https://www.financialexpress.com/policy/economy/q2-equity-fdi-down-11-as-tech-services-lose-steam/4062183/",
    "source": "www.financialexpress.com",
    "description": "Foreign Direct Investment (FDI) inflows through the equity route fell 11% to $16.5 billion in the July-September quarter compared with the preceding quarter, largely due to softer performance in services and computer hardware and software — sectors that traditionally attract the most overseas invest...",
    "category": "Economy",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3152,
    "title": "India to benchmark performance against 26 global indices under new GIRG framework",
    "url": "https://www.moneycontrol.com/news/business/economy/india-to-benchmark-performance-against-26-global-indices-under-new-girg-framework-13705246.html",
    "source": "www.moneycontrol.com",
    "description": "The Development Monitoring and Evaluation Office (DMEO) at NITI Aayog will serve as the central coordinating body for this exercise.\n\nIndia will benchmark its performance against 26 global indices to identify gaps and strengthen the country’s position in international rankings, Minister of State for...",
    "category": "Economy",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3148,
    "title": "What is 'Mahasagar' vision? New policy for Global South unveiled by PM Modi in Mauritius",
    "url": "https://timesofindia.indiatimes.com/india/what-is-mahasagar-vision-new-policy-for-global-south-unveiled-by-pm-modi-in-mauritius/articleshow/118942589.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Photo/PTI\n\nNEW DELHI: India and Mauritius on Wednesday strengthened their relationship by elevating ties to an 'enhanced strategic partnership' and signing eight agreements to cooperate in various sectors, including maritime security and trade in local currencies. Prime Minister Narendra Modi also i...",
    "category": "Fiscal Policy",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3146,
    "title": "Mauritius Tax Treaty: Sensex Falls 793 Pts As Fpis Weigh Mauritius Tax Issue",
    "url": "https://timesofindia.indiatimes.com/city/mumbai/sensex-falls-793-pts-as-fpis-weigh-mauritius-tax-issue/articleshow/109258571.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "We also published the following articles recently\n\nIndia, Mauritius tighten scrutiny on investments\n\nIndia and Mauritius amend DTAA with a principal purpose test to scrutinize foreign investors' eligibility for treaty benefits, potentially impacting investments via Mauritius. Scrutiny may increase, ...",
    "category": "Inflation",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3147,
    "title": "Sensex falls 793 points as FPIs weigh Mauritius tax issue",
    "url": "https://timesofindia.indiatimes.com/business/india-business/sensex-falls-793-points-as-fpis-weigh-mauritius-tax-issue/articleshow/109258491.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "MUMBAI: Concerns over the likely fallout of changes to a tax treaty between India and Mauritius weighed on investor sentiment on Friday, along with rising inflation in the US and escalating tensions in West Asia. These factors dragged the sensex down by 793 points or 1.1% to close at 74,245. On the ...",
    "category": "Inflation",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3159,
    "title": "India, Mauritius move closer to implementing trade in local currencies as central banks discuss technical details: MEA",
    "url": "https://news.webindia123.com/news/Articles/World/20250911/4360192.html",
    "source": "news.webindia123.com",
    "description": "India and Mauritius have reached an understanding on conducting trade in local currencies, with discussions now taking place between the central banks of both countries, said MEA foreign secretary Vikram Misri during a special briefing on Thursday. \"This is something on which an understanding has al...",
    "category": "Trade Policy",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  },
  {
    "id": 3161,
    "title": "India, Mauritius to Boost Trade in Local Currencies: PM Modi",
    "url": "https://www.deccanherald.com/india/india-mauritius-to-work-towards-facilitating-bilateral-trade-in-local-currencies-pm-narendra-modi-3722956",
    "source": "www.deccanherald.com",
    "description": "India, Mauritius to work towards facilitating bilateral trade in local currencies: PM Narendra Modi\n\nThe prime minister said that a free, open, secure, stable and prosperous Indian Ocean is a shared priority of both India and Mauritius.",
    "category": "Trade Policy",
    "country": "Mauritius",
    "published_date": "2025-12-01"
  }
]