[
  {
    "id": 5137,
    "title": "Partner in crime: Couple makes fake currency notes, caught with ₹24 lakh cash after cheating 1,000 victims",
    "url": "https://www.livemint.com/news/trends/partner-in-crime-couple-makes-fake-currency-notes-caught-with-rs-24-lakh-cash-after-cheating-1-000-victims-11747730541960.html",
    "source": "www.livemint.com",
    "description": "In a true “partner in crime” moment, a couple has been accused of printing fake currency notes and was arrested with counterfeit currency worth at least ₹24 lakh.\n\nAccording to the South China Morning Post (SCMP), a couple from China's Jiangxi province was arrested for cheating over 1,000 victims at...",
    "category": "Currency Exchange Rates",
    "country": "China",
    "published_date": "2025-05-01"
  },
  {
    "id": 1592,
    "title": "Global news wrap: Monetary policies, US-China truce, CATL’s debut",
    "url": "https://www.livemint.com/news/global-news-wrap-monetary-policies-us-china-truce-catl-s-debut/amp-11748007393335.html",
    "source": "www.livemint.com",
    "description": "The US Federal Reserve is expected to hold rates steady as it weighs the potential economic fallout from the tariffs against the inflationary risks. The Bank of England, having eased rates in May to address growth concerns and softening inflation, may hold steady now but could resume easing by Augus...",
    "category": "Monetary Policy",
    "country": "China",
    "published_date": "2025-05-01"
  },
  {
    "id": 1597,
    "title": "Global news wrap: Monetary policies, US-China truce, CATL’s debut",
    "url": "https://www.livemint.com/news/global-news-wrap-monetary-policies-us-china-truce-catl-s-debut-11748007393335.html?showGiftPopup=true",
    "source": "www.livemint.com",
    "description": "Every month, Mint’s Plain Facts section brings out an update on key global data to thread together the biggest developments in the world that are worth paying attention to. The accompanying analysis and charts explain how each story is creating ripples on the global stage, where it is headed in the ...",
    "category": "Monetary Policy",
    "country": "China",
    "published_date": "2025-05-01"
  },
  {
    "id": 1633,
    "title": "US-China trade deal: What transpired in two-day talks? Here's what to expect next",
    "url": "https://www.livemint.com/news/world/uschina-trade-deal-what-transpired-in-two-day-talks-heres-what-to-expect-next-donald-trump-tariff-war-geneva-11747010644768.html",
    "source": "www.livemint.com",
    "description": "Following two days of trade negotiations in Switzerland, the lead US negotiator expressed optimism about resolving tensions between the world's two largest economies, praising the talks as “a great deal of productivity.”\n\nAccording to Reuters, this comes after US President Donald Trump’s imposition ...",
    "category": "Trade Policy",
    "country": "China",
    "published_date": "2025-05-01"
  },
  {
    "id": 1634,
    "title": "Asia stocks rise on trade talks, China cuts key rates",
    "url": "https://www.moneycontrol.com/news/business/markets/asia-stocks-rise-on-trade-talks-china-cuts-key-rates-13015302.html",
    "source": "www.moneycontrol.com",
    "description": "A gauge of the dollar’s strength advanced 0.3%, snapping three days of declines. Gold dropped as much as 2.1% and Treasuries fell\n\nAsian stocks rose and the dollar strengthened as China cut rates and confirmed plans to have talks with the US, spurring optimism trade tensions between the world’s two ...",
    "category": "Trade Policy",
    "country": "China",
    "published_date": "2025-05-01"
  }
]