[
  {
    "id": 2154,
    "title": "CENTRAL GEORGIAN SENTENCED TO PRISON FOR BANK FRAUD IN INSURANCE SCHEME",
    "url": "https://insurancenewsnet.com/oarticle/central-georgian-sentenced-to-prison-for-bank-fraud-in-insurance-scheme",
    "source": "insurancenewsnet.com",
    "description": "States News Service\n\nThe following information was released by the United States Attorney's Office for the Middle District of Georgia :\n\n\"Agent of the Year\" Schemed to Pay Other Premiums to Earn Title for Additional Consecutive Year\n\nMACON, Ga. The former owner and repeat winner of \"Insurance Agent ...",
    "category": "Central Bank",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2155,
    "title": "India Blockchain Forum collaborates with National Bank of Georgia",
    "url": "https://www.financialexpress.com/business/digital-transformation-india-blockchain-forum-collaborates-with-national-bank-of-georgia-3265317/",
    "source": "www.financialexpress.com",
    "description": "According to an official release, The National Bank of Georgia (NBG) has onboarded Sharat Chandra, co-founder, India Blockchain Forum, as a member of its technical partner selection committee for the CBDC Digital GEL project. This development is expected to showcase Chandra’s role in advancing block...",
    "category": "Central Bank",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2150,
    "title": "Georgia’s economy growing rapidly but still trails EU peers - PM",
    "url": "https://news.az/news/georgias-economy-growing-rapidly-but-still-trails-eu-peers-pm",
    "source": "news.az",
    "description": "+ ↺ − 16 px\n\nGeorgia’s Prime Minister Irakli Kobakhidze has said that despite high growth rates, the country’s economy still lags significantly behind even the poorest European Union nations, News.Az reports, citing Georgian media.\n\n“Our economy is developing very rapidly. Over the past four years, ...",
    "category": "Economy",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2151,
    "title": "This website is unavailable in your location. – WSB-TV Channel 2",
    "url": "https://www.wsbtv.com/news/local/atlanta/georgia-hospitals-contribute-more-than-130-billion-state-economy/MXDOBQOGSVFVXPTV7427UUVACU/",
    "source": "www.wsbtv.com",
    "description": "We’re Sorry!\n\nThis website is unavailable in your location.\n\nError 451\n\nIt appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.",
    "category": "Economy",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2153,
    "title": "India strengthens Textile and Sericulture Cooperation with Georgia",
    "url": "https://www.ibef.org/news/india-strengthens-textile-and-sericulture-cooperation-with-georgia",
    "source": "www.ibef.org",
    "description": "India strengthens Textile and Sericulture Cooperation with Georgia\n\nA high-level delegation from the Ministry of Textiles, Government of India, led by Member Secretary of the Central Silk Board (CSB) and Secretary General of the International Sericultural Commission (ISC), Mr. P. Sivakumar, successf...",
    "category": "Economy",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2146,
    "title": "Georgia on track for rapid economic growth - PM",
    "url": "https://news.az/news/georgia-on-track-for-rapid-economic-growth-pm",
    "source": "news.az",
    "description": "“By the end of 2025, Georgia’s economy will exceed 100 billion lari, and nominal GDP per capita will surpass 10,000 dollars,” Kobakhidze said at a cabinet meeting, News.Az reports, citing Georgian media.\n\nHe added that it is “highly likely” Georgia will outperform the IMF’s economic growth forecast ...",
    "category": "GDP",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2156,
    "title": "Mortgage Rates Today: December 1, 2025 – Rates Hold Firm",
    "url": "https://www.forbes.com/advisor/mortgages/mortgage-rates-12-01-25/",
    "source": "www.forbes.com",
    "description": "Editorial Note: We earn a commission from partner links on Forbes Advisor. Commissions do not affect our editors' opinions or evaluations.\n\nToday’s average mortgage rate on a 30-year fixed-rate mortgage is 6.19%, down 1.45% from the previous week, according to the Mortgage Research Center.\n\nBorrower...",
    "category": "Interest Rates",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2157,
    "title": "US Fed Meeting outcome on Wednesday: Jerome Powell likely to lower rates by 25 bps — Are markets already pricing it in?",
    "url": "https://www.livemint.com/market/stock-market-news/us-fed-meeting-outcome-on-wednesday-jerome-powell-likely-to-lower-rates-by-25-bps-are-markets-already-pricing-it-in-11761675462403.html",
    "source": "www.livemint.com",
    "description": "US Fed meeting outcome: The US Federal Reserve is set to announce its two-day policy outcome on Wednesday, 29 October 2025, where the Federal Open Market Committee (FOMC) will determine the path of the key interest rates in the US economy.\n\nIn its September 2025 policy outcome, the US Federal Reserv...",
    "category": "Interest Rates",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2164,
    "title": "TCS bags order from Georgia Department of Labor to modernise state’s unemployment insurance system",
    "url": "https://www.financialexpress.com/business/industry-tcs-bags-order-from-georgia-department-of-labor-to-modernise-states-unemployment-insurance-system-3263690/",
    "source": "www.financialexpress.com",
    "description": "Tata Consultancy Services (TCS) on Thursday announced that it has been selected by the Georgia Department of Labor (GDOL) to replace its 1980s-era legacy platform with a cloud-based unemployment insurance system that streamlines the claims process and ensures that eligible individuals receive prompt...",
    "category": "Unemployment",
    "country": "Georgia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2165,
    "title": "Sarke Information Agency: Daily News: Economics (November 19, 2025)",
    "url": "http://www.sarke.com/cgi/search/news.asp?Code=10074480",
    "source": "www.sarke.com",
    "description": "Daily News: Economics\n\nNovember 19, 2025 IN Q3, UNEMPLOYMENT RATE IN GEORGIA DECREASED SLIGHTLY Y-O-Y In the 3rd quarter, Georgia’s unemployment rate made up 13.3%, decreasing by 0.5 percentage points (pp) compared to the same period of 2024, Sakstat reported. The number of unemployed decreased ...",
    "category": "Unemployment",
    "country": "Georgia",
    "published_date": "2025-12-01"
  }
]