[
  {
    "id": 440,
    "title": "Antigua and Barbuda Strengthens Tourism Ties with UAE: What You Need to Know",
    "url": "https://www.travelandtourworld.com/news/article/antigua-and-barbuda-strengthens-tourism-ties-with-uae-what-you-need-to-know/",
    "source": "www.travelandtourworld.com",
    "description": "Antigua and Barbuda Strengthens Tourism Ties with UAE: What You Need to Know\n\nAntigua and Barbuda has advanced its strategic international tourism diplomacy by engaging with the United Arab Emirates at the highest levels, with discussions focused on expanding air connectivity, developing joint trave...",
    "category": "Economy",
    "country": "Antigua and Barbuda",
    "published_date": "2025-11-01"
  },
  {
    "id": 443,
    "title": "Delayed jobs report shows U.S. employers added a surprisingly solid number of jobs in September",
    "url": "https://www.pbs.org/newshour/economy/delayed-jobs-report-shows-u-s-employers-added-a-surprisingly-solid-number-of-jobs-in-september",
    "source": "www.pbs.org",
    "description": "WASHINGTON (AP) — U.S. employers added a surprisingly solid 119,000 jobs in September, the government said, issuing a key economic report that had been delayed for seven weeks by the federal government shutdown.\n\nThe unemployment rate rose to 4.4% in September, highest since October 2021 and up from...",
    "category": "Economy",
    "country": "Antigua and Barbuda",
    "published_date": "2025-11-01"
  },
  {
    "id": 426,
    "title": "PM Browne Urges Immediate Overhaul of Global Financial Systems: “GDP Shouldn’t Define Our Future”",
    "url": "https://antigua.news/2025/11/30/pm-browne-urges-immediate-overhaul-of-global-financial-systems-gdp-shouldnt-define-our-future/",
    "source": "antigua.news",
    "description": "Prime Minister Gaston Browne delivered a stark warning to global leaders at the Medays 2025 Forum on Friday, declaring that the world is “tethering on the edge of implosion” as overlapping crises threaten global balance, development, and peace.\n\nSpeaking during the plenary session titled “World on t...",
    "category": "GDP",
    "country": "Antigua and Barbuda",
    "published_date": "2025-11-01"
  },
  {
    "id": 427,
    "title": "Antigua and Barbuda economy projected to grow 4.8% in 2025",
    "url": "https://www.caribbeannationalweekly.com/news/antigua-and-barbuda-economy-projected-to-grow-4-8-in-2025/",
    "source": "www.caribbeannationalweekly.com",
    "description": "Prime Minister Gaston Browne says Antigua and Barbuda’s economy is expected to end the current fiscal year with a real Gross Domestic Product (GDP) expansion of 4.8 per cent.\n\n- Advertisement -\n\n“Antigua and Barbuda’s economy is expected to grow 4.8 per cent by the end of 2025 and five per cent next...",
    "category": "GDP",
    "country": "Antigua and Barbuda",
    "published_date": "2025-11-01"
  },
  {
    "id": 435,
    "title": "Melania Trump Launches Production Company Using Secret Service Code Name Ahead of Documentary Release",
    "url": "https://www.thewrap.com/melania-trump-production-company-muse-films-documentary-release-date/",
    "source": "www.thewrap.com",
    "description": "First Lady Melania Trump launched her new production company, Muse Films, which she named after her former Secret Service code name.\n\nAlong with the production company, Trump said that her documentary “Melania” is set to hit theaters “worldwide” on Jan. 30, 2026. The film is being directed by Brett ...",
    "category": "Monetary Policy",
    "country": "Antigua and Barbuda",
    "published_date": "2025-11-01"
  }
]