[
  {
    "id": 1894,
    "title": "Sudiksha Konanki missing in Dominican Republic: A timeline of her known hours",
    "url": "https://www.hindustantimes.com/world-news/sudiksha-konanki-missing-in-dominican-republic-a-timeline-of-her-known-hours-101741761583757.html",
    "source": "www.hindustantimes.com",
    "description": "Indian student Sudiksha Konanki, who has gone missing from the Dominican Republic while on vacation with her friends, was last seen cuddling up to a man while walking with her other friends before she disappeared, shows surveillance footage accessed by local news outlet Noticias SIN. On early March ...",
    "category": "GDP",
    "country": "Dominican Republic",
    "published_date": "2025-03-01"
  },
  {
    "id": 1909,
    "title": "Sudiksha Konanki disappearance: ‘Person of interest’ Joshua Riibe gives ultimatum to Dominican Republic cops",
    "url": "https://www.hindustantimes.com/world-news/us-news/sudiksha-konanki-disappearance-person-of-interest-joshua-riibe-gives-ultimatum-to-dominican-republic-cops-101742261023878.html",
    "source": "www.hindustantimes.com",
    "description": "Joshua Riibe, the person of interest in the disappearance of University of Pittsburgh student Sudiksha Konanki, has given Dominican Republic cops an ultimatum. His attorney Beatriz Santana said in a motion filed Monday, March 17, that Riibe cannot be detained any longer without being charged, and mu...",
    "category": "Interest Rates",
    "country": "Dominican Republic",
    "published_date": "2025-03-01"
  },
  {
    "id": 1913,
    "title": "Sudiksha Konanki missing case: Person of interest identified in disappearance of Indian student in Dominican Republic",
    "url": "https://www.thehindu.com/news/international/person-of-interest-identified-in-disappearance-of-indian-student-in-dominican-republic-report/article69325358.ece",
    "source": "www.thehindu.com",
    "description": "The U.S. authorities have identified a 24-year-old man as person of interest in the case of a 20-year-old Indian student who has mysteriously gone missing during a spring break visit to the Dominican Republic.\n\nSudiksha Konanki, a citizen of India and a permanent resident of the United States, was l...",
    "category": "Interest Rates",
    "country": "Dominican Republic",
    "published_date": "2025-03-01"
  },
  {
    "id": 1916,
    "title": "Sudiksha Konanki case: Clothes of missing Indian-American found at Dominican Republic beach where she vanished",
    "url": "https://www.livemint.com/news/us-news/sudiksha-konanki-case-clothes-of-missing-indian-american-found-at-dominican-republic-beach-where-she-vanished-11742111880437.html",
    "source": "www.livemint.com",
    "description": "Authorities believe that clothes discovered on a beach in the Dominican Republic belong to Indian-American student Sudiksha Konanki, who mysteriously went missing from the area over a week ago. CDN images show a white netted sarong draped over the beach lounge chair, including flip-flops with sand o...",
    "category": "Unemployment",
    "country": "Dominican Republic",
    "published_date": "2025-03-01"
  }
]