[
  {
    "id": 2102,
    "title": "Finland's Happiness Endures Amid Economic Storm",
    "url": "https://www.devdiscourse.com/article/headlines/3709815-finlands-happiness-endures-amid-economic-storm",
    "source": "www.devdiscourse.com",
    "description": "Amid harsh economic challenges, Finland remarkably retains its status as the world's happiest nation for the eighth consecutive year, according to the World Happiness Report. The country struggles with rising unemployment and ailing public finances, impacting many, including Juho-Pekka Palomaa, who ...",
    "category": "Economic Growth",
    "country": "Finland",
    "published_date": "2025-12-01"
  },
  {
    "id": 2093,
    "title": "Finland's economy to slip into recession",
    "url": "https://www.zeebiz.com/world/news-finlands-economy-to-slip-into-recession-251183",
    "source": "www.zeebiz.com",
    "description": "Finland's economy to slip into recession\n\nZeebiz Web Team Written By\n\nOP Financial Group is made up of 106 OP cooperative banks and the central cooperative which they own, including its subsidiaries and affiliated entities.\n\nThe OP Financial Group said that construction and company profitability are...",
    "category": "Economy",
    "country": "Finland",
    "published_date": "2025-12-01"
  },
  {
    "id": 2072,
    "title": "EU Puts Finland on Notice for Deficit Breach",
    "url": "https://www.devdiscourse.com/article/business/3709602-eu-puts-finland-on-notice-for-deficit-breach",
    "source": "www.devdiscourse.com",
    "description": "The European Commission has proposed initiating disciplinary measures against Finland over its budget deficit, which surpasses the European Union's 3% GDP threshold. The Commission noted that Finland's high deficit cannot be fully attributed to increased defense spending, even after accounting for t...",
    "category": "GDP",
    "country": "Finland",
    "published_date": "2025-12-01"
  },
  {
    "id": 2075,
    "title": "Finland uses tax reform to attract foreign tech investment",
    "url": "https://www.computerweekly.com/news/366634468/Finland-uses-tax-reform-to-attract-foreign-tech-investment",
    "source": "www.computerweekly.com",
    "description": "Finland is poised to further strengthen its global appeal as a Nordic hub for technology innovation and development through tax cuts for businesses.\n\nThe new charm offensive, directly targeted at international investors, is based on the Finnish government’s national budget plan for 2026 that propose...",
    "category": "GDP",
    "country": "Finland",
    "published_date": "2025-12-01"
  },
  {
    "id": 2105,
    "title": "Against the Odds: Finland's Happiness Amid Economic Turmoil",
    "url": "https://www.devdiscourse.com/article/headlines/3708681-against-the-odds-finlands-happiness-amid-economic-turmoil",
    "source": "www.devdiscourse.com",
    "description": "Winds of economic trouble are sweeping across Finland, yet the Nordic nation has defied the odds to remain the world's happiest country for the eighth consecutive year. Despite soaring unemployment and budget deficits, Finland's generous welfare state and resilient citizens help maintain national sa...",
    "category": "Unemployment",
    "country": "Finland",
    "published_date": "2025-12-01"
  }
]