[
  {
    "id": 3541,
    "title": "Central bank warns of potential risks from net surge in foreign assets",
    "url": "https://www.koreatimes.co.kr/economy/20251105/central-bank-warns-of-potential-risks-from-net-surge-in-foreign-assets",
    "source": "www.koreatimes.co.kr",
    "description": "South Korea's high level of overseas assets has bolstered external soundness, but the rapid increase could lead to prolonged capital outflows that may put downward pressure on the local currency and cause other side effects, the central bank said Wednesday.\n\nThe country's net foreign assets (NFA) ha...",
    "category": "Central Bank",
    "country": "North Korea",
    "published_date": "2025-11-01"
  },
  {
    "id": 3565,
    "title": "5 plead guilty in North Korean IT worker schemes in the United States",
    "url": "https://www.upi.com/Top_News/US/2025/11/14/north-korea-it-workers-scheme/2791763158178/",
    "source": "www.upi.com",
    "description": "Four U.S. citizens and a Ukrainian have pleaded guilty to participating in criminal schemes aimed at generating funds for North Korean arms development, the Department of Justice announced on Friday. Photo by KCNA/EPA-EFE\n\nNov. 14 (UPI) -- Four U.S. citizens and a Ukrainian pleaded guilty to partici...",
    "category": "Currency Exchange Rates",
    "country": "North Korea",
    "published_date": "2025-11-01"
  },
  {
    "id": 3558,
    "title": "Why Korea's economic growth has slowed since 1990s",
    "url": "https://www.koreatimes.co.kr/economy/20251112/why-koreas-economic-growth-has-slowed-since-1990s",
    "source": "www.koreatimes.co.kr",
    "description": "Korea's structural growth slowdown since the 1990s has been driven by the prolonged survival of marginal firms during a series of financial crises, the Bank of Korea (BOK) said in a report Wednesday.\n\nThe persistence of these underperforming companies has weakened corporate dynamism and disrupted th...",
    "category": "Economic Growth",
    "country": "North Korea",
    "published_date": "2025-11-01"
  },
  {
    "id": 3518,
    "title": "U.S. Deputy Defense Secretary Praises South Korea as \"Truly an Exemplary Ally\" for 3.5% GDP Defense Spending Commitment",
    "url": "https://www.asiae.co.kr/en/article/2025111512252492159",
    "source": "www.asiae.co.kr",
    "description": "\"Increasing Defense Spending to 3.5% of GDP\" ? Responding to South Korea\n\n\"First Non-NATO Country to Commit to 3.5% of GDP for Defense\"\n\nThird-Highest Ranking Official in the Department of Defense... Previously Refrained from Public Engagements\n\n\"This Is Effectively My First Public Statement\"\n\nElbri...",
    "category": "GDP",
    "country": "North Korea",
    "published_date": "2025-11-01"
  },
  {
    "id": 3525,
    "title": "Possible monetary policy shift depends on data: BOK chief",
    "url": "https://www.koreaherald.com/article/10614905",
    "source": "www.koreaherald.com",
    "description": "Bank of Korea Gov. Rhee Chang-yong said Wednesday that the central bank will continue its monetary easing cycle but the scope and pace of any future rate cuts, as well as a possible policy shift, will depend on incoming economic data.\n\nRhee made the remarks in an interview with Bloomberg TV in Singa...",
    "category": "Monetary Policy",
    "country": "North Korea",
    "published_date": "2025-11-01"
  },
  {
    "id": 3555,
    "title": "AmCham, new FTC chief discuss Korea’s fair trade policy, regulatory challenge",
    "url": "https://www.koreaherald.com/article/10610750",
    "source": "www.koreaherald.com",
    "description": "The American Chamber of Commerce in Korea on Thursday held a roundtable in Seoul with Fair Trade Commission Chair Ju Biung-ghi to discuss on the government’s fair trade policy and regulatory challenges facing global companies operating in Korea.\n\nIn his remarks, AmCham Chair and CEO James Kim unders...",
    "category": "Trade Policy",
    "country": "North Korea",
    "published_date": "2025-11-01"
  },
  {
    "id": 3561,
    "title": "Korea wrestles with rising unemployment payouts, fraud",
    "url": "https://www.koreatimes.co.kr/economy/20251107/korea-wrestles-with-rising-unemployment-payouts-fraud?prnewsidx=76831683-ffaf-11ef-b492-02eed468a967",
    "source": "www.koreatimes.co.kr",
    "description": "Many countries are facing mounting challenges in maintaining a robust labor force, particularly for workers who have faced multiple layoffs or other employment issues.\n\nKorea is no exception. Since 1995, the country has operated an unemployment benefits system that provides up to 60 percent of a wor...",
    "category": "Unemployment",
    "country": "North Korea",
    "published_date": "2025-11-01"
  }
]