[
  {
    "id": 1222,
    "title": "Bolivia plans gold bank to bring order to unruly mining boom",
    "url": "https://www.mining.com/web/bolivia-plans-gold-bank-to-bring-order-to-unruly-mining-boom/",
    "source": "www.mining.com",
    "description": "Bolivia’s new government plans to create a gold bank with public and private capital to ensure sustainable mining and marketing practices, Finance Minister José Gabriel Espinoza said.\n\nThe administration of centrist President Rodrigo Paz, who took office this month following two decades of socialist...",
    "category": "Central Bank",
    "country": "Bolivia",
    "published_date": "2025-12-01"
  },
  {
    "id": 1223,
    "title": "Ex-Central Bank Member Named Bolivia Finance Minister",
    "url": "https://financialpost.com/pmn/business-pmn/ex-central-bank-director-sworn-in-as-bolivias-finance-minister",
    "source": "financialpost.com",
    "description": "FP West: Energy Insider: Go behind the oilpatch's closed doors in our new subscriber-exclusive newsletter. Sign up now >>\n\nFP West: Energy Insider: Go behind the oilpatch's closed doors in our new subscriber-exclusive newsletter. Sign up now >>",
    "category": "Central Bank",
    "country": "Bolivia",
    "published_date": "2025-12-01"
  },
  {
    "id": 1224,
    "title": "Bolivia's Bold Move to Scrap Taxes: Investment Booster or Risk?",
    "url": "https://www.devdiscourse.com/article/headlines/3709533-bolivias-bold-move-to-scrap-taxes-investment-booster-or-risk",
    "source": "www.devdiscourse.com",
    "description": "In a significant policy shift, Bolivia's Economy Minister, Jose Gabriel Espinoza, has announced plans to eliminate taxes for wealthy individuals and financial transactions. The move is intended to foster investment and address issues of economic informality.\n\nThe proposed changes are part of a broad...",
    "category": "Economic Growth",
    "country": "Bolivia",
    "published_date": "2025-12-01"
  },
  {
    "id": 1227,
    "title": "New President Vows to End Bolivia’s Energy Crisis",
    "url": "https://finance.yahoo.com/news/president-vows-end-bolivia-energy-010000847.html",
    "source": "finance.yahoo.com",
    "description": "Rodrigo Paz, the centrist senator who won the presidential election in Bolivia last month, was sworn in this weekend and immediately set to work to undo the policies of 20 years of nearly-uninterrupted socialist rule.\n\nIn the first round of the presidential election on 17 August, the left-wing Movim...",
    "category": "Economic Growth",
    "country": "Bolivia",
    "published_date": "2025-12-01"
  },
  {
    "id": 1216,
    "title": "Bolivia's Bold Economic Reformation Under President Rodrigo Paz",
    "url": "https://www.devdiscourse.com/article/business/3709987-bolivias-bold-economic-reformation-under-president-rodrigo-paz",
    "source": "www.devdiscourse.com",
    "description": "President Rodrigo Paz of Bolivia is making waves with his bold economic reform strategies. In an effort to revive the struggling Bolivian economy, he announced plans to revoke a series of taxes that have hampered growth and investments.\n\nJust weeks into his presidency, Paz further revealed a signifi...",
    "category": "Economy",
    "country": "Bolivia",
    "published_date": "2025-12-01"
  },
  {
    "id": 1217,
    "title": "Bolivia's Marraqueta Crisis: A Political and Economic Turning Point",
    "url": "https://www.devdiscourse.com/article/headlines/3712018-bolivias-marraqueta-crisis-a-political-and-economic-turning-point",
    "source": "www.devdiscourse.com",
    "description": "Bolivia is grappling with a shortage of its iconic marraqueta bread roll, creating a significant challenge for newly elected President Rodrigo Paz. The scarcity is primarily driven by dwindling wheat supplies and escalating costs, placing pressure on bakers and causing frustration among consumers.\n\n...",
    "category": "Economy",
    "country": "Bolivia",
    "published_date": "2025-12-01"
  }
]