[
  {
    "id": 709,
    "title": "Why Major Construction Firms Remain Unfazed Even as the Exchange Rate Nears 1,500 Won",
    "url": "https://www.asiae.co.kr/en/article/2025112716412493060",
    "source": "www.asiae.co.kr",
    "description": "Construction Costs Rise Only 2.0% Annually Even with High Exchange Rates\n\nExchange Rate Sensitivity at 0.86%... Low Import Dependency Limits Impact\n\nRisk Diversification through Currency Hedging and Multi-Currency Contracts\n\nStructural Gaps Le\n\nRecently, concerns have been growing in the constructio...",
    "category": "Currency Exchange Rates",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 662,
    "title": "Cracks In Russia’s War Economy",
    "url": "https://www.forbes.com/sites/arielcohen/2025/11/25/cracks-in-russias-war-economy/",
    "source": "www.forbes.com",
    "description": "Though Russia's war machine is slipping, the proposed peace plan by the United States does not take advantage of the economic pressure on Moscow, asking Ukraine to make several concessions. (Photo by Andrew Harnik/Getty Images) Getty Images\n\nRussia’s war machine is showing unmistakable signs of stra...",
    "category": "Economy",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 632,
    "title": "Russia’s Economy Cracks as War Reaches Daily Life and Sanctions Pressure Deepens",
    "url": "https://www.kyivpost.com/post/65121",
    "source": "www.kyivpost.com",
    "description": "As Russia enters a fourth winter of full-scale war against Ukraine, the invasion is increasingly reshaping daily life across the country, from nightly air raid sirens in central regions to mounting economic strain in households, industries and state finances.\n\nDozens of regions in central and southe...",
    "category": "GDP",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 633,
    "title": "Dalal Street This Week: FII activity, Q2 GDP, India-US trade deal, and Ukraine peace deal among 10 key factors to watch",
    "url": "https://www.moneycontrol.com/news/business/markets/dalal-street-this-week-fii-activity-q2-gdp-india-us-trade-deal-and-ukraine-peace-deal-among-10-key-factors-to-watch-13691815.html",
    "source": "www.moneycontrol.com",
    "description": "The market participants will focus on a series of economic releases, including retail sales, PPI, pending home sales, durable goods orders, and weekly jobs data from the United States, to gauge the potential interest rate decision.\n\nThe market extended its upward journey for the second consecutive w...",
    "category": "GDP",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 638,
    "title": "Bullion eyes further gains amid Russia-Ukraine tensions and dovish sentiment",
    "url": "https://www.moneycontrol.com/news/business/commodities/bullion-eyes-further-gains-amid-russia-ukraine-tensions-and-dovish-sentiment-13703321.html",
    "source": "www.moneycontrol.com",
    "description": "Commodities Outlook for next week\n\nRising expectations of a December rate cut reignited risk appetite this week (ended November 28), reversing the earlier selloff triggered by anxiety over stretched AI valuations.\n\nThe dollar spent most of the week below the 100 mark as a run of softer US economic d...",
    "category": "Inflation",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 640,
    "title": "Booming or breaking? The truth about Russia’s war economy",
    "url": "https://www.channel4.com/news/booming-or-breaking-the-truth-about-russias-war-economy",
    "source": "www.channel4.com",
    "description": "For months after Vladimir Putin’s full-scale invasion of Ukraine, Western leaders predicted Russia’s economy was on the brink of collapse under sanctions – and yet it didn’t. It transformed into a wartime economy, fuelled by military production, redirected trade routes, and deeper ties with China an...",
    "category": "Inflation",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 677,
    "title": "Oil prices settle down at lowest in a month as US seeks Russia-Ukraine peace deal",
    "url": "https://www.moneycontrol.com/news/business/commodities/oil-prices-settle-down-at-lowest-in-a-month-as-us-seeks-russia-ukraine-peace-deal-13690816.html",
    "source": "www.moneycontrol.com",
    "description": "A view of an oil pump jack on the prairies near Claresholm, Alberta, Canada\n\nOil prices eased about 1% on Friday to settle at one-month lows as the U.S. pushed for a Russia-Ukraine peace deal that could boost global oil supplies, while uncertainty over U.S. interest rates curbed investors' risk appe...",
    "category": "Interest Rates",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 680,
    "title": "Oil prices settle up 1% on bets Fed will cut US rates and doubts about Ukraine peace",
    "url": "https://www.moneycontrol.com/news/business/commodities/oil-prices-settle-up-1-on-bets-fed-will-cut-us-rates-and-doubts-about-ukraine-peace-13694044.html",
    "source": "www.moneycontrol.com",
    "description": "A drone view of a pump jack and drilling rig south of Midland, Texas, U.S.\n\nOil prices climbed about 1% on Monday on increased bets of a U.S. interest rate cut in December and mounting doubts about whether Russia will get a peace deal with Ukraine that will boost Moscow's oil exports.\n\nBrent futures...",
    "category": "Interest Rates",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 690,
    "title": "India, China & Russia to ramp up energy trade in local currencies if US dollar becomes less stable: OIES",
    "url": "https://www.thehindubusinessline.com/economy/india-china-russia-to-ramp-up-energy-trade-in-local-currencies-if-us-dollar-becomes-less-stable-oies/article70286663.ece",
    "source": "www.thehindubusinessline.com",
    "description": "Emphasising the impact on energy markets due to the US flexing its Dollar dominance, the Oxford Institute for Energy Studies (OIES) in a recent paper projected that countries such as India, China and Russia will increasingly do business leveraging local currencies if the Greenback becomes less stabl...",
    "category": "Trade Policy",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 691,
    "title": "Paul Murray Live celebrates 15 year sbringing Australians straight-talking and common sense thinking with special anniversary edition",
    "url": "https://www.skynews.com.au/australia-news/politics/reports-claim-ukraine-has-agreed-to-a-peace-deal-with-russia-after-tense-negotiations-between-officials-in-geneva/live-coverage/e00bca36b5c47cef42e7fe8429f2bba3",
    "source": "www.skynews.com.au",
    "description": "Paul Murray Live celebrates 15 year sbringing Australians straight-talking and common sense thinking with special anniversary edition\n\nSky News Australia's longest-running opinion program, Paul Murray Live, has celebrated 15 years of bringing Australians straight-talking and common sense thinking on...",
    "category": "Trade Policy",
    "country": "Russia",
    "published_date": "2025-11-01"
  },
  {
    "id": 702,
    "title": "Russia Wants To Introduce Punishment For Unemployment",
    "url": "https://charter97.org/en/news/2025/11/17/663390/",
    "source": "charter97.org",
    "description": "Russia Wants To Introduce Punishment For Unemployment 16 17.11.2025, 22:10\n\n12,882\n\nThe Russian Federation is going the way of the USSR.\n\nThe head of the Federal Project on Security and Anti-Corruption Vitaly Borodin, known for writing denunciations on Russians, has proposed to punish citizens for i...",
    "category": "Unemployment",
    "country": "Russia",
    "published_date": "2025-11-01"
  }
]