[
  {
    "id": 4609,
    "title": "BoT eyes tougher gold trade rules amid baht swings",
    "url": "https://www.thestar.com.my/business/business-news/2025/11/25/bot-eyes-tougher-gold-trade-rules-amid-baht-swings",
    "source": "www.thestar.com.my",
    "description": "BANGKOK: Thailand’s central bank plans to tighten reporting rules for gold transactions after rising bullion flows contributed to swings in the baht, prompting policymakers to seek better market visibility.\n\nGovernor Vitai Ratanakorn said the Bank of Thailand (BoT) is revising rules to require more ...",
    "category": "Central Bank",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4623,
    "title": "Gold prices rise for the fourth consecutive month, while silver hits an all-time high",
    "url": "https://www.nationthailand.com/business/trading-investment/40058954",
    "source": "www.nationthailand.com",
    "description": "Gold prices continued their upward trend, with spot gold rising 1% to hit a two-week high on Friday, November 28, 2025. This increase was driven by expectations that the U.S. Federal Reserve (Fed) may cut interest rates next month, boosting demand for non-yielding assets like gold. Meanwhile, silver...",
    "category": "Currency Exchange Rates",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4624,
    "title": "Pattaya stands out as affordable haven despite currency surge",
    "url": "https://www.pattayamail.com/news/pattaya-stands-out-as-affordable-haven-despite-currency-surge-527324",
    "source": "www.pattayamail.com",
    "description": "PATTAYA, Thailand – For many long-term visitors across Thailand, the conversation about affordability has become almost ritual. Sit at a beer bar in Pattaya and someone will complain that the city has changed, that prices are up, that it isn’t the same cheap paradise it was 15 or 20 years ago. But i...",
    "category": "Currency Exchange Rates",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4625,
    "title": "Pattaya’s prices aren’t the problem, Samui shows real cost shock",
    "url": "https://www.pattayamail.com/news/pattayas-prices-arent-the-problem-samui-shows-real-cost-shock-526943",
    "source": "www.pattayamail.com",
    "description": "PATTAYA, Thailand – For years, headlines have warned tourists that Thailand is “too expensive” as the baht strengthens, with Pattaya often portrayed as a victim of its own rising costs. But a closer look suggests that the city is still far from overpriced – it’s simply competing in a global tourism ...",
    "category": "Currency Exchange Rates",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4618,
    "title": "People’s party PM candidates meet Keidanren to present economic vision for stable growth",
    "url": "https://www.nationthailand.com/news/politics/40058715",
    "source": "www.nationthailand.com",
    "description": "• Three prime ministerial candidates from the People’s Party met with the Japan Business Federation (Keidanren) to outline their economic vision and investment-promotion policies.\n\n• The party emphasised transparent governance, regulatory reform and large-scale infrastructure investment (“Orange Meg...",
    "category": "Economic Growth",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4621,
    "title": "Thailand's economy expands in October as exports grow",
    "url": "http://www.chinaview.cn/20251128/b3cfdd9518c84546958e3bda8050015d/c.html",
    "source": "www.chinaview.cn",
    "description": "BANGKOK, Nov. 28 (Xinhua) -- Thailand's economy saw a marginal expansion in October on a monthly basis, driven by continued export growth along with increased foreign tourists and private consumption, the central bank said on Friday.\n\nExports, a key driver of the Southeast Asian country's economic g...",
    "category": "Economic Growth",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4604,
    "title": "Thailand’s 2026 economy shaped by 45 key trends, led by digital, electronics, EVs and smart farming",
    "url": "https://www.nationthailand.com/news/general/40058560",
    "source": "www.nationthailand.com",
    "description": "Thailand’s economy remains fragile going into 2026, but key industries—digital, electronics, electric vehicles, energy, agriculture and wellness—are expected to anchor new growth. A comprehensive review by Thansettakij and insights from government agencies reveal 45 trends in investment, exports, ag...",
    "category": "Economy",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4599,
    "title": "Thai budget deficit dips by 8.4% as economy stumbles on",
    "url": "https://thethaiger.com/news/business/thai-budget-deficit-dips-by-8-4-as-economy-stumbles-on",
    "source": "thethaiger.com",
    "description": "Thailand’s Cabinet approved a new fiscal plan projecting reduced budget deficit and increased spending, aiming to stabilise the economy amid weak growth.\n\nThailand’s government has announced an 8.4% reduction in the national budget deficit for the 2027 fiscal year, signalling a cautious step towards...",
    "category": "Fiscal Policy",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4600,
    "title": "Finance Ministry to roll out three-phase flood relief plan for affected regions in Thailand",
    "url": "https://www.nationthailand.com/news/policy/40058820",
    "source": "www.nationthailand.com",
    "description": "The Ministry of Finance is working on a comprehensive three-phase flood relief plan aimed at providing immediate assistance, supporting business recovery, and ensuring long-term economic stability for those affected by the floods in Songkhla and other provinces.\n\nAccording to a source, the plan’s de...",
    "category": "Fiscal Policy",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4590,
    "title": "World Bank: Flooding Threatens Thailand's Economy, Urges Government to Prioritize Action",
    "url": "https://www.nationthailand.com/news/general/40058928",
    "source": "www.nationthailand.com",
    "description": "Melinda Good, Director of the World Bank for Thailand and Myanmar, has warned that flooding represents a serious threat to the foundation of Thailand's economy. She urged the government to treat flood management as an urgent priority, emphasizing that failure to act could result in missed business o...",
    "category": "GDP",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4594,
    "title": "ADFW 2025 to Host Leaders Managing Capital Equivalent to Over 50% of Global GDP",
    "url": "https://www.thailand-business-news.com/pr-news/adfw-2025-to-host-leaders-managing-capital-equivalent-to-over-50-of-global-gdp",
    "source": "www.thailand-business-news.com",
    "description": "ABU DHABI, UAE, Nov. 18, 2025 /PRNewswire/ — This year’s largest-ever edition of Abu Dhabi Finance Week (ADFW) – hosted by ADGM, with ADQ as Headline Partner – will gather the world’s most influential financial institutions, policymakers, investors, market leaders and innovators from 8th to 11th Dec...",
    "category": "GDP",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4595,
    "title": "NESDC flags four major risk signals for Thailand’s 2026 economy",
    "url": "https://www.nationthailand.com/business/economy/40058606",
    "source": "www.nationthailand.com",
    "description": "The National Economic and Social Development Council (NESDC) has released its latest economic assessment, highlighting four major risk signals that could weigh on Thailand’s economic performance in 2026. The council noted that the economy is likely to lose momentum, in line with an expected slowdown...",
    "category": "Inflation",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4610,
    "title": "'Ekniti' urges Thailand to seize opportunities in new global order, highlights foreign interest in key sectors",
    "url": "https://www.nationthailand.com/news/policy/40058919",
    "source": "www.nationthailand.com",
    "description": "To address these challenges, the government has launched the \"Thailand Fast Pass\" project, which has already been approved by the Economic Cabinet and the Cabinet to remove these obstacles and allow investment to proceed. \"This unlocking process does not require any new budget allocation. For the lo...",
    "category": "Interest Rates",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4612,
    "title": "Thailand Privilege Announces Strong Digital Nomad Interest Following TOKEN2049 Singapore Event",
    "url": "https://www.news-press.com/press-release/story/12179/thailand-privilege-announces-strong-digital-nomad-interest-following-token2049-singapore-event/",
    "source": "www.news-press.com",
    "description": "BANGKOK, Thailand – November 04, 2025 – PRESSADVANTAGE –\n\nThailand Privilege reported significant international interest from digital nomads, crypto investors, and technology professionals during TOKEN2049 Singapore, held October 1-2, 2024, as the program continues to attract global professionals se...",
    "category": "Interest Rates",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4596,
    "title": "Stablecoins: Impact and Opportunities for the ASEAN+3 Region",
    "url": "https://www.thailand-business-news.com/cryptocurrencies/259898-stablecoins-impact-and-opportunities-for-the-asean3-region",
    "source": "www.thailand-business-news.com",
    "description": "The US GENIUS Act clarifies dollar stablecoins’ legal status, enhancing regulated financial integration. ASEAN+3 sees benefits in cross-border payments but faces risks, necessitating careful policy management for a resilient monetary system.\n\nIntegration of Stablecoins in the Financial System\n\nThe U...",
    "category": "Monetary Policy",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4614,
    "title": "Why Trump won’t let Thailand keep tariff, border talks separate",
    "url": "https://www.scmp.com/week-asia/politics/article/3333223/why-trump-wont-let-thailand-keep-tariff-border-talks-separate",
    "source": "www.scmp.com",
    "description": "Thailand ’s insistence that trade negotiations with the US can proceed separately from talks over a fractious border dispute with Cambodia has been met with deep scepticism given Washington’s increasing use of economic policy as a political instrument and US President Donald Trump ’s personal stake ...",
    "category": "Trade Policy",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4616,
    "title": "How Baht strength and government moves impact gold trading in Thailand",
    "url": "https://thethaiger.com/news/business/how-baht-strength-and-government-moves-impact-gold-trading-in-thailand",
    "source": "thethaiger.com",
    "description": "Thailand’s gold culture runs deep. From Chinatown shops in Bangkok to family savings across Chiang Mai and Khon Kaen, gold is both a store of value and a trading vehicle. Yet the domestic price you see on the board is not just a reflection of global spot. It is a blend of international gold, the bah...",
    "category": "Trade Policy",
    "country": "Thailand",
    "published_date": "2025-11-01"
  },
  {
    "id": 4622,
    "title": "Opposition leads November political index as national score slips to 3.9",
    "url": "https://www.nationthailand.com/news/politics/40059016",
    "source": "www.nationthailand.com",
    "description": "The November edition of the monthly political index survey by Suan Dusit Poll found that the opposition’s performance continued to top the rankings, while the overall index dropped to 3.9 despite the government’s Let’s Go Halves Plus stimulus package.\n\nSuan Dusit reported that the political index fe...",
    "category": "Unemployment",
    "country": "Thailand",
    "published_date": "2025-11-01"
  }
]