[
  {
    "id": 2122,
    "title": "Gold reserves of global central banks are rising. Should you also accumulate gold?",
    "url": "https://www.financialexpress.com/market/gold-pulse-global-central-banks-are-accumulating-gold-why-not-you-3756595/",
    "source": "www.financialexpress.com",
    "description": "Central banks are on a buying-spree in the gold market. For the third consecutive year, gold buying by central banks topped 1,000 tonnes. In 2024, central banks purchased a record 1,180 tonnes of gold after buying 1,082 tonnes in 2022 and 1,037 tonnes in 2023.\n\nHere’s how much gold countries have in...",
    "category": "Central Bank",
    "country": "France",
    "published_date": "2025-12-01"
  },
  {
    "id": 2133,
    "title": "Edinburgh online currency expert spots holiday money boom despite UK media’s derision of Rachel Reeves’ budget",
    "url": "https://www.prolificnorth.co.uk/news/edinburgh-online-currency-expert-spots-holiday-money-boom-despite-uk-medias-derision-of-rachel-reeves-budget/",
    "source": "www.prolificnorth.co.uk",
    "description": "Last week’s Budget may have received a frosty reception from the UK media, but it turns out it has made it cheaper to go abroad for some winter sun.\n\nThe British Pound has surged in response, meaning that the thousands of British tourists heading abroad over Christmas will get more bang for their bu...",
    "category": "Currency Exchange Rates",
    "country": "France",
    "published_date": "2025-12-01"
  },
  {
    "id": 2127,
    "title": "\"Deepening India-France economic ties\": Piyush Goyal meets French minister Eric Lombard",
    "url": "https://www.aninews.in/news/world/europe/deepening-india-france-economic-ties-piyush-goyal-meets-french-minister-eric-lombard20250602233310/",
    "source": "www.aninews.in",
    "description": "Paris [France], June 2 (ANI): Union Minister of Commerce and Industry Piyush Goyal held a productive meeting with French Minister of Economy, Finance, and Industrial and Digital Sovereignty, Eric Lombard, on Monday (local time), focusing on deepening the India-France economic partnership with an emp...",
    "category": "Economic Growth",
    "country": "France",
    "published_date": "2025-12-01"
  },
  {
    "id": 2129,
    "title": "EU lowers 2026 eurozone growth forecast amid global trade risks",
    "url": "https://news.az/news/eu-lowers-2026-eurozone-growth-forecast-amid-global-trade-risks",
    "source": "news.az",
    "description": "+ ↺ − 16 px\n\nThe eurozone economy is expected to expand less than previously predicted next year, the European Commission said on Monday, citing risks from international trade and geopolitical tensions.\n\nThe EU executive now forecasts growth of 1.2% in 2026 for the 20-country single currency area, d...",
    "category": "Economic Growth",
    "country": "France",
    "published_date": "2025-12-01"
  },
  {
    "id": 2130,
    "title": "France's Thales sees revenue and profit growth after cyber expansion",
    "url": "https://telecom.economictimes.indiatimes.com/news/internet/frances-thales-sees-revenue-and-profit-growth-after-cyber-expansion/115287226",
    "source": "telecom.economictimes.indiatimes.com",
    "description": "Advt\n\nAdvt\n\nJoin the community of 2M+ industry professionals. Subscribe to Newsletter to get latest insights & analysis in your inbox. All about ETTelecom industry right on your smartphone! Download the ETTelecom App and get the Realtime updates and Save your favourite articles.\n\nPARIS: Defence and ...",
    "category": "Economic Growth",
    "country": "France",
    "published_date": "2025-12-01"
  },
  {
    "id": 2115,
    "title": "ECB policy: Rates left unchanged at 2% as eurozone weathers Trump tariffs; Christine Lagarde faces France test",
    "url": "https://timesofindia.indiatimes.com/business/international-business/ecb-policy-rates-left-unchanged-at-2-as-eurozone-weathers-trump-tariffs-christine-lagarde-faces-france-test/articleshow/123832413.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "The European Central Bank (ECB) kept its benchmark deposit rate steady at 2% on Thursday, with inflation back under control and the eurozone economy showing resilience despite US President Donald Trump’s tariff measures.At the post-decision news conference, attention is expected to focus on ECB ...",
    "category": "Fiscal Policy",
    "country": "France",
    "published_date": "2025-12-01"
  },
  {
    "id": 2118,
    "title": "France and Germany are the eurozone’s new basket cases",
    "url": "https://uk.news.yahoo.com/france-germany-eurozone-basket-cases-070000474.html",
    "source": "uk.news.yahoo.com",
    "description": "There is a wonderful moment in Fawlty Towers where the hapless Irish builder Mr O’Reilly tries to calm a highly agitated Basil with the words: “Just remember, Mr Fawlty, there’s always somebody worse off than yourself.”\n\n“Is there? Well, I would love to meet him. I could do with a laugh,” replies an...",
    "category": "Fiscal Policy",
    "country": "France",
    "published_date": "2025-12-01"
  },
  {
    "id": 2123,
    "title": "Stock market today: Global shares are mostly lower as investors pin hopes on rate cuts",
    "url": "https://timesofindia.indiatimes.com/business/international-business/stock-market-today-global-shares-are-mostly-lower-as-investors-pin-hopes-on-rate-cuts/articleshow/108766262.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "TOKYO : Global shares were trading mixed on Monday, as investors awaited further indications the Federal Reserve might begin cutting interest rates. France's CAC 40 was virtually unchanged in early trading at 8,151.94, while Germany's DAX edged up 0.1 per cent to 18,227.53. Britain's FTSE 100 was li...",
    "category": "Interest Rates",
    "country": "France",
    "published_date": "2025-12-01"
  },
  {
    "id": 2124,
    "title": "India, France have shared interest focused on friendship: Macron",
    "url": "https://www.tribuneindia.com/news/india/india-france-have-shared-interest-focused-on-friendship-macron/",
    "source": "www.tribuneindia.com",
    "description": "Ahead of his bilateral meeting with Prime Minister Narendra Modi in France, President Emmanuel Macron has said that the two countries have a “shared interest” focused on friendship.\n\nAdvertisement\n\nPrime Minister Modi on Monday embarked on a two-nation tour that will first take him to France and the...",
    "category": "Interest Rates",
    "country": "France",
    "published_date": "2025-12-01"
  }
]