[
  {
    "id": 1355,
    "title": "Bulgaria's central bank denies it is acting too slowly on troubled Corpbank",
    "url": "https://www.zawya.com/en/business/bulgarias-central-bank-denies-it-is-acting-too-slowly-on-troubled-corpbank-ye37tln4",
    "source": "www.zawya.com",
    "description": "SOFIA, Sept 13 (Reuters) - Bulgaria's central bank denied accusations from politicians that it had been too slow to offer a solution for troubled lender Corporate Commercial Bank (Corpbank), saying on Saturday that it is working to find the best solution.\n\nCorpbank 6C9.BB has been shut down since be...",
    "category": "Central Bank",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1356,
    "title": "Bulgaria: Household Lending Outpaces Deposits in October, Central Bank Reports 21% Growth in Loans",
    "url": "https://www.novinite.com/articles/235625/Bulgaria%3A+Household+Lending+Outpaces+Deposits+in+October%2C+Central+Bank+Reports+21+Growth+in+Loans",
    "source": "www.novinite.com",
    "description": "New BNB figures for October 2025 show that lending to households continues to rise at a noticeably faster pace than deposits. Loans to individuals and NPISHs increased by 21 percent compared to October 2024, while household deposits grew by 13.8 percent over the same period. The data confirms the tr...",
    "category": "Central Bank",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1361,
    "title": "New Year, New Format: How Exchange Offices in Bulgaria Will Show Rates After the Euro Switch",
    "url": "https://www.novinite.com/articles/235562/New+Year%2C+New+Format%3A+How+Exchange+Offices+in+Bulgaria+Will+Show+Rates+After+the+Euro+Switch",
    "source": "www.novinite.com",
    "description": "From the start of 2026, when Bulgaria introduces the euro, currency exchange boards will follow the format used across the eurozone. Tavex notes that the shift may create some confusion at the beginning of the year, since people are used to the current domestic system.\n\nUntil now, Bulgarian exchange...",
    "category": "Currency Exchange Rates",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1362,
    "title": "Bulgaria Outlines New Euro-Based Rates for Night Work and Labour Payments from 2026",
    "url": "https://www.novinite.com/articles/235581/Bulgaria+Outlines+New+Euro-Based+Rates+for+Night+Work+and+Labour+Payments+from+2026",
    "source": "www.novinite.com",
    "description": "From 1 January 2026, when Bulgaria adopts the euro, the Ministry of Labor and Social Policy plans to adjust the Regulation on the Structure and Organization of Wages and several related ordinances so that all fixed minimum payments shift to the new currency at the official exchange rate of 1.95583 l...",
    "category": "Currency Exchange Rates",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1357,
    "title": "Eurozone Entry Set to Transform Bulgaria’s Economy, Analysis Shows",
    "url": "https://www.novinite.com/articles/235654/Eurozone+Entry+Set+to+Transform+Bulgaria%E2%80%99s+Economy%2C+Analysis+Shows",
    "source": "www.novinite.com",
    "description": "The Council for Economic Analysis has released a detailed study on the macroeconomic implications of Bulgaria’s planned adoption of the euro, authored by Assoc. Prof. Plamen Nenov, Secretary of the Council. Bulgaria is set to join the eurozone on January 1, 2026, marking a key milestone in the count...",
    "category": "Economic Growth",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1358,
    "title": "Bulgaria’s 2026 Business Outlook: High Wages, Worker Shortages, and State Rules Challenge Growth",
    "url": "https://www.novinite.com/articles/235555/Bulgaria%E2%80%99s+2026+Business+Outlook%3A+High+Wages%2C+Worker+Shortages%2C+and+State+Rules+Challenge+Growth",
    "source": "www.novinite.com",
    "description": "Bulgaria faces several pressing challenges for business in 2026, with high wage costs, a shortage of qualified workers, and state-imposed financial conditions topping the list. These findings emerge from the 33rd “European Economic Survey 2026” conducted by the Bulgarian Chamber of Commerce and Indu...",
    "category": "Economic Growth",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1351,
    "title": "Bulgaria to expand investment presence in Egypt as 26 firms join December economic talks",
    "url": "https://www.zawya.com/en/economy/north-africa/bulgaria-to-expand-investment-presence-in-egypt-as-26-firms-join-december-economic-talks-y475b9yw",
    "source": "www.zawya.com",
    "description": "Egypt and Bulgaria signalled a renewed push to deepen economic ties on Monday, as Sofia confirmed that 26 Bulgarian companies will participate in next month’s session of the Egyptian–Bulgarian Joint Committee for Economic Cooperation in Cairo—part of a wider effort to expand Bulgarian investment in ...",
    "category": "Economy",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1352,
    "title": "Bulgaria’s Businesses Give Government December 15 Deadline for New Budget",
    "url": "https://www.novinite.com/articles/235677/Bulgaria%E2%80%99s+Businesses+Give+Government+December+15+Deadline+for+New+Budget",
    "source": "www.novinite.com",
    "description": "At a national meeting in Veliko Tarnovo, representatives from multiple sectors of Bulgaria’s economy issued an ultimatum to the government, giving it until December 15 to finalize a new state budget. Should the cabinet fail to act, businesses warned that protests under the slogan “One Hour Without E...",
    "category": "Economy",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1346,
    "title": "Big Changes Ahead: Bulgaria Approves 2026 Budget with Higher Wages, Pensions, and a Tax Hike",
    "url": "https://www.novinite.com/articles/235434/Big+Changes+Ahead%3A+Bulgaria+Approves+2026+Budget+with+Higher+Wages%2C+Pensions%2C+and+a+Tax+Hike",
    "source": "www.novinite.com",
    "description": "The Bulgarian government has approved the draft State Budget Act for 2026, along with the updated Medium-Term Budget Forecast for 2026–2028. According to the official announcement, the document outlines priorities for sustainable fiscal policy, economic stability, and preparation for the adoption of...",
    "category": "Fiscal Policy",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1349,
    "title": "European Commission Flags Bulgaria’s 2026 Budget for Potential EU Non-Compliance",
    "url": "https://www.novinite.com/articles/235631/European+Commission+Flags+Bulgaria%E2%80%99s+2026+Budget+for+Potential+EU+Non-Compliance",
    "source": "www.novinite.com",
    "description": "The European Commission has flagged Bulgaria’s 2026 budget plans as potentially failing to meet the EU’s fiscal requirements. The warning was included in the presentation of the European Commission’s economic priorities for 2026 to member states, highlighting Bulgaria as a country at risk of non-com...",
    "category": "Fiscal Policy",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1336,
    "title": "Bulgaria’s Wealthiest Regions Revealed: Where Income and Investment Soar",
    "url": "https://www.novinite.com/articles/235704/Bulgaria%E2%80%99s+Wealthiest+Regions+Revealed%3A+Where+Income+and+Investment+Soar",
    "source": "www.novinite.com",
    "description": "Sofia remains the leading region in Bulgaria in terms of economic development, according to the 2025 IME study \"Regional Profiles: Development Indicators.\" The data show that the capital consistently outperforms the rest of the country in key measures, including investments, salaries, and the number...",
    "category": "GDP",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1339,
    "title": "October Inflation at 5.3%: Bulgarians Face Steep Price Hikes on Everyday Goods",
    "url": "https://www.novinite.com/articles/235494/October+Inflation+at+5.3%3A+Bulgarians+Face+Steep+Price+Hikes+on+Everyday+Goods",
    "source": "www.novinite.com",
    "description": "The National Statistical Institute (NSI) has released data on inflation and consumer prices in Bulgaria for October 2025, showing a monthly increase of 0.9% and an annual inflation rate of 5.3%. The Consumer Price Index (CPI) measures monthly inflation as the change from September 2025, while annual...",
    "category": "Inflation",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1340,
    "title": "Inflation and Winter Logistics Push Bulgaria’s Wholesale Basket to €51.6 This Week",
    "url": "https://www.novinite.com/articles/235493/Inflation+and+Winter+Logistics+Push+Bulgaria%E2%80%99s+Wholesale+Basket+to+%E2%82%AC51.6+This+Week",
    "source": "www.novinite.com",
    "description": "The price of Bulgaria’s wholesale consumer basket has risen to 101 leva (€51.6) this week, marking an increase of 1 leva (€0.5) compared to last week. This information was shared during a regular briefing by Vladimir Ivanov, Chairman of the State Commission on Commodity Exchanges and Markets (DCSBT)...",
    "category": "Inflation",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1342,
    "title": "Bulgaria's Euro Transition: Navigating Economic Turbulence",
    "url": "https://www.devdiscourse.com/article/politics/3712715-bulgarias-euro-transition-navigating-economic-turbulence",
    "source": "www.devdiscourse.com",
    "description": "Bulgaria's government announced plans to resubmit its 2026 budget to parliament, marking its first outline drafted in euros. This decision follows significant protests in Sofia against proposals to raise social security contributions and taxes, measures intended to boost government spending.\n\nPrime ...",
    "category": "Inflation",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1343,
    "title": "Bulgarian inflation may jump with euro adoption, Lagarde says",
    "url": "https://uk.finance.yahoo.com/news/bulgarian-inflation-may-jump-euro-082237448.html",
    "source": "uk.finance.yahoo.com",
    "description": "SOFIA (Reuters) -Bulgarian inflation may jump when the euro currency is adopted on January 1 as retailers round up prices, but the impact will fade quickly and the benefits will be far greater, ECB President Christine Lagarde said on Tuesday.\n\nAround half of Bulgaria's public oppose euro adoption, f...",
    "category": "Inflation",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1359,
    "title": "Employment Agency Reports Stable Job Market in Bulgaria: 16,000 Hired in October",
    "url": "https://www.novinite.com/articles/235516/Employment+Agency+Reports+Stable+Job+Market+in+Bulgaria%3A+16%2C000+Hired+in+October",
    "source": "www.novinite.com",
    "description": "Bulgaria’s labor market remained stable in October, with the Employment Agency reporting a registered unemployment rate of 5.15 percent.\n\nCurrently, 145,000 people are registered with labor offices across the country. During the month, 16,000 individuals found employment with the support of the stat...",
    "category": "Unemployment",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  },
  {
    "id": 1360,
    "title": "Bulgaria’s Unemployment Falls to 3.5% as EU Job Market Stabilizes at 6%",
    "url": "https://www.novinite.com/articles/235204/Bulgaria%E2%80%99s+Unemployment+Falls+to+3.5+as+EU+Job+Market+Stabilizes+at+6",
    "source": "www.novinite.com",
    "description": "In September 2025, unemployment in the euro area remained steady at 6.3% for the third month in a row, slightly above the historic low of 6.2% recorded in October and November 2024 and just above the pre-euro launch level in January 1999, according to Eurostat. Across the European Union, unemploymen...",
    "category": "Unemployment",
    "country": "Bulgaria",
    "published_date": "2025-12-01"
  }
]