[
  {
    "id": 506,
    "title": "THINK Ahead: Central banks take the spotlight",
    "url": "https://think.ing.com/articles/think-ahead-120925/",
    "source": "think.ing.com",
    "description": "Rate decision (Wed): The Bank of Canada is widely expected to cut interest rates by 25bp. Canada’s economy is heavily exposed to US President Donald Trump’s US tariffs, and the output contracted sharply in the second quarter while employment fell for a second consecutive month in August, pushing the...",
    "category": "Central Bank",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 507,
    "title": "Central Bank of Armenia",
    "url": "https://www.centralbanking.com/central-bank/central-bank-of-armenia",
    "source": "www.centralbanking.com",
    "description": "Sorry, our subscription options are not loading right now\n\nPlease try again later. Get in touch with our customer services team if this issue persists.\n\nNew to Central Banking? View our subscription options\n\nIf you already have an account, please sign in here.",
    "category": "Central Bank",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 508,
    "title": "Central Bank names possible source of Armenian government aid package of 150 billion drams",
    "url": "https://arka.am/en/news/economy/central_bank_names_possible_source_of_armenian_government_aid_package_of_150_billion_drams_/?sphrase_id=15352183",
    "source": "arka.am",
    "description": "In comments on Armenian Prime Minister Nikol Pashinyan’s statement that his government will provide an aid package to businesses worth 150 billion (over $300 million) conditioned by the coronavirus crisis, Central Bank Board member Arthur Stepanyan said today the government is well aware which secto...",
    "category": "Central Bank",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 509,
    "title": "Brazil, Dubai and Armenia lead the way in the global open finance race",
    "url": "https://www.thebanker.com/content/481fe688-1c2d-4543-a4f0-4ecc60bbc1fc",
    "source": "www.thebanker.com",
    "description": "At Open Banking Excellence, Helen Child is spearheading industry-led initiatives, including a proposed UK insurance model to underwrite risks across the open finance value chain. Through its advisory arm, OBE connects regulators, financial institutions and fintech innovators worldwide.\n\nAsked whethe...",
    "category": "Central Bank",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 902,
    "title": "ArCa national payment system, Bank of Georgia, Ameriabank sign Memorandum of Understanding",
    "url": "https://www.panarmenian.net/eng/news/328210/",
    "source": "www.panarmenian.net",
    "description": "PanARMENIAN.Net - Within the framework of the international PLUS Forum held in Yerevan, Armenia, the Arca National Payment System, Bank of Georgia JSC and Ameriabank signed a Memorandum of Understanding.\n\nThe memorandum aims to define the scope of cooperation between the parties to ensure interopera...",
    "category": "Central Bank",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 521,
    "title": "CIS-4 face higher CPI risks despite stronger exchange rates",
    "url": "https://think.ing.com/articles/cis-4-are-facing-higher-cpi-risks-despite-stronger-exchange-rates/",
    "source": "think.ing.com",
    "description": "The appreciation of floating exchange rates across the CIS-4 region since the start of the year should, in theory, exert a disinflationary effect. However, this has been outweighed by mounting pro-inflationary pressures. Consumer price inflation has been trending upward across most of the region sin...",
    "category": "Currency Exchange Rates",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 515,
    "title": "provincial economic growth Armenia",
    "url": "https://www.travelandtourworld.com/news/article/tag/provincial-economic-growth-armenia/",
    "source": "www.travelandtourworld.com",
    "description": "We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies.",
    "category": "Economic Growth",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 503,
    "title": "Armenia’s economic growth accelerates to 10.5% in September, World Bank says",
    "url": "https://www.intellinews.com/armenia-s-economic-growth-accelerates-to-10-5-in-september-world-bank-says-413393/",
    "source": "www.intellinews.com",
    "description": "Armenia’s economy accelerated sharply in September, posting 10.5% year-on-year growth driven by manufacturing and metals production, the World Bank said in its latest monthly update.\n\nThe September result was a rebound from 7.5% growth in August, pushing cumulative expansion for the first nine month...",
    "category": "Economy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 505,
    "title": "Caring for Armenia: Why the Care Economy is Everyone’s Business",
    "url": "https://eca.unwomen.org/en/stories/op-ed/2025/10/caring-for-armenia-why-the-care-economy-is-everyones-business",
    "source": "eca.unwomen.org",
    "description": "Op-Ed by Kaori Ishikawa, UN Women Country Representative in Georgia and Liaison for the South Caucasus, on the occasion of the International Day for Care and Support\n\nOn this International Day for Care and Support, we honor the invisible work that holds our societies together — the care that nurture...",
    "category": "Economy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 895,
    "title": "Economy ministers discussed cooperation between Armenia and Georgia in transport and logistics",
    "url": "https://arka.am/en/news/economy/economy-ministers-discussed-cooperation-between-armenia-and-georgia-in-transport-and-logistics/",
    "source": "arka.am",
    "description": "Armenian Minister of Economy Gevorg Papoyan, currently on an official visit to Tbilisi, engaged in discussions with Georgian Minister of Economy and Sustainable Development Mariam Kvrivishvili on Wednesday.\n\n\n\nYEREVAN, November 20. /ARKA/. Armenian Minister of Economy Gevorg Papoyan, currently on an...",
    "category": "Economy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 896,
    "title": "Official stresses Tehran-Yerevan projects' implementation",
    "url": "https://en.mehrnews.com/news/239375/Official-stresses-Tehran-Yerevan-projects-implementation",
    "source": "en.mehrnews.com",
    "description": "In a meeting held with Iran’s Ambassador to Yerevan Khalil Shir-Gholami in Tehran, the Plan and Budget Organization head stressed the need to pursue implementation of projects such as third electricity transmission line, and gas bartering deal inked between the two countries.\n\nPour-Mohammadi called ...",
    "category": "Economy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 898,
    "title": "Armenia's budget deficit for the first nine months amounted to 0.73% of GDP, compared to the projected 5.5% for 2025 – WB",
    "url": "https://arka.am/en/news/economy/armenia-s-budget-deficit-for-the-first-nine-months-amounted-to-0-73-of-gdp-compared-to-the-projected/",
    "source": "arka.am",
    "description": "Armenia's cumulative budget deficit from the first to third quarters reached 0.73% of the annual projected GDP, compared to the projected 5.5% of GDP for 2025. This is stated in the World Bank's \"Armenia Monthly Economic Update – November 2025.\"\n\nYEREVAN, November 26. /ARKA/. Armenia's cumulative bu...",
    "category": "Economy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 899,
    "title": "Exclusive: India becomes biggest arms exporter to Armenia",
    "url": "https://www.zeebiz.com/economy-infra/news-sukhoi-su-30mki-fighter-jet-india-becomes-biggest-arms-exporter-to-armenia-40-per-cent-of-total-weapons-supplied-india-targets-rs-50000-crore-export-by-2029-356542",
    "source": "www.zeebiz.com",
    "description": "Exclusive: India becomes biggest arms exporter to Armenia\n\nZeeBiz WebTeam Written By\n\nSu-30 fighter jet which Russia use to make earlier, now Indian company Hindustan Aeronautics Limited (HAL) is producing under the name Su-30MKI, a \"Make in India\" initiative.\n\nBy 2029, the country aims to achieve a...",
    "category": "Economy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 900,
    "title": "Armenia and Türkiye explore cooperation within TRIPP project",
    "url": "https://news.az/news/armenia-and-turkiye-explore-cooperation-within-tripp-project",
    "source": "news.az",
    "description": "+ ↺ − 16 px\n\nArmenia’s Minister of Economy Gevorg Papoyan and Türkiye’s Minister of Agriculture and Forestry İbrahim Yumaklı met in Istanbul on Friday to discuss prospects for bilateral cooperation, including new economic, logistical, and trade opportunities under the TRIPP project.\n\nThe ministers u...",
    "category": "Economy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 901,
    "title": "Armenia Digital Awards 2025 Expands Armenia’s Digital Horizon with Record Participation",
    "url": "https://finance.yahoo.com/news/armenia-digital-awards-2025-expands-163900120.html",
    "source": "finance.yahoo.com",
    "description": "The submissions themselves reflect a country in transition. Armenia’s digital sector has been experiencing accelerated growth over the past five years, driven by rising technical expertise, heightened standards for digital product quality, a maturing startup ecosystem, the expansion of engineering a...",
    "category": "Economy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 492,
    "title": "Armenia's Economic Pulse: Fairer Markets for Inclusive Growth",
    "url": "https://www.worldbank.org/en/country/armenia/publication/armenia-economic-pulse-fairer-markets-for-inclusive-growth",
    "source": "www.worldbank.org",
    "description": "After two years of exceptional expansion (2022–2023), economic growth in Armenia normalized in 2024 as GDP eased to 5.9% and to 5.6% in H1 2025, with inflation picking up.\n\nThe earlier surge—driven by temporary re-exports and capital inflows linked to Russia’s invasion of Ukraine—has been unwinding ...",
    "category": "GDP",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 495,
    "title": "Economic developments in European Neighbourhood East countries",
    "url": "https://ec.europa.eu/eurostat/statistics-explained/index.php/Economic_developments_in_European_Neighbourhood_East_countries",
    "source": "ec.europa.eu",
    "description": "Highlights\n\nThe European Neighbourhood East countries Armenia, Azerbaijan, Georgia, Moldova and Ukraine together recorded a GDP of €298.1 billion in 2023, 4.7% higher than in 2022. Ukraine alone contributed more than one half of this total.\n\nIn 2023, Moldova had the lowest economic activity rate amo...",
    "category": "GDP",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 890,
    "title": "Мinister: Armenia’s Q3 GDP grows 6.2% year-on-year",
    "url": "https://www.panarmenian.net/eng/news/328291/",
    "source": "www.panarmenian.net",
    "description": "PanARMENIAN.Net - Deputy Chairman of the Civil Contract Party and Economy Minister of Armenia, Gevorg Papoyan, announced via Facebook that Armenia’s gross domestic product (GDP) increased by 6.2% in the third quarter of 2025, compared to the same quarter in 2024.\n\n“Armenia’s GDP growth for Q3 2025 s...",
    "category": "GDP",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 891,
    "title": "World Bank forecasts 5.2% GDP growth for Armenia in 2025",
    "url": "https://www.panarmenian.net/eng/news/328346/",
    "source": "www.panarmenian.net",
    "description": "PanARMENIAN.Net - The World Bank forecasts Armenia’s GDP to grow by 5.2% in 2025 and 4.9% in 2026, according to its latest Country Economic Update report.\n\nThese projections do not reflect developments following the August 8 Armenia–U.S.–Azerbaijan agreements, such as the new grain transit route thr...",
    "category": "GDP",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 892,
    "title": "Armenia's GDP grew by 6.2% in the third quarter, reaching 3.07 trillion drams – official statistics",
    "url": "https://arka.am/en/news/economy/armenia-s-gdp-grew-by-6-2-in-the-third-quarter-reaching-3-07-trillion-drams-official-statistics/",
    "source": "arka.am",
    "description": "Preliminary data indicates that Armenia's GDP for the third quarter of 2025 experienced a 6.2% increase in comparison to the same quarter in 2024, as reported by the Statistical Committee.\n\n\n\nYEREVAN, August 20. /ARKA/. Preliminary data indicates that Armenia's GDP for the third quarter of 2025 expe...",
    "category": "GDP",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 893,
    "title": "Production of three products from a well-known brand has been discontinued in Yerevan - regulator",
    "url": "https://arka.am/en/news/economy/production-of-three-products-from-a-well-known-brand-has-been-discontinued-in-yerevan-regulator/",
    "source": "arka.am",
    "description": "By decision of the head of the Food Safety Inspectorate of Armenia, production of three types of products in one of the production facilities of Arzni Dairy Products LLC has been suspended due to the detection of pathogenic bacteria and yeast fungi.\n\nYEREVAN, December 1. /ARKA/. By decision of the h...",
    "category": "GDP",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 496,
    "title": "Armenia: WFP VAM | Market Price Monitoring Bulletin Issue No. 43, October 2025 - Armenia",
    "url": "https://reliefweb.int/report/armenia/armenia-wfp-vam-market-price-monitoring-bulletin-issue-no-43-october-2025",
    "source": "reliefweb.int",
    "description": "Highlights\n\nThis bulletin focuses on market prices of the period September 2024 – September 2025․\n\nIn September 2025 the exchange rate of USD vs AMD was AMD 382 per 1 USD, a decrease of AMD 5 compared to September 2024. This indicates a depreciation of the USD against the AMD. Over the same period, ...",
    "category": "Inflation",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 498,
    "title": "CIS-4: fundamentals and sentiment remain largely positive",
    "url": "https://think.ing.com/articles/cis4-update-september-2025/",
    "source": "think.ing.com",
    "description": "Armenia’s economy is normalising after the 2023-24 surge, with first half 2025 GDP growth at 5.6% year-on-year. However, growth is gradually decelerating despite robust lending and a widening fiscal deficit (4.0% of GDP as of mid-2025), highlighting underlying fragility. The central bank has held th...",
    "category": "Inflation",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 894,
    "title": "World Bank indicates \"cooling\" of Armenian economy: growth will slow from 5.2% in 2025 to 4.7% in 2027",
    "url": "https://arka.am/en/news/economy/world-bank-indicates-a-cooling-of-the-armenian-economy-growth-will-slow-from-5-2-in-2025-to-4-7-in-2/",
    "source": "arka.am",
    "description": "By the end of 2025, Armenia's economy is projected to grow by 5.2%, although it may decrease to 4.9% in 2026, as noted by World Bank Senior Economist Vicky Chemutai in response to an inquiry from ARKA.\n\n\n\nYEREVAN, November 21. /ARKA/. By the end of 2025, Armenia's economy is projected to grow by 5.2...",
    "category": "Inflation",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 512,
    "title": "Armenia Holds Key Rate Unchanged at 6.75%",
    "url": "https://www.tradingview.com/news/te_news:498954:0-armenia-holds-key-rate-unchanged-at-6-75/",
    "source": "www.tradingview.com",
    "description": "The Central Bank of Armenia kept its benchmark interest rate unchanged at 6.75% during its November 2025 meeting, maintaining the stance from its previous meeting.\n\nPolicymakers also maintained the deposit rate at 5.25% and the lending rate at 8.25%.\n\nThis decision came as the country’s annual headl...",
    "category": "Interest Rates",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 903,
    "title": "After Armenia order, Philippines, Brazil, Egypt showing interest in Akash air defence missile system",
    "url": "https://www.aninews.in/news/world/asia/after-armenia-order-philippines-brazil-egypt-showing-interest-in-akash-air-defence-missile-system20231219204039/",
    "source": "www.aninews.in",
    "description": "New Delhi [India], December 19 (ANI): Amid Indian efforts to expand the export of indigenous military hardware, many countries, including Philippines, Brazil and Egypt have shown interest in procuring the Akash air defence missile system.\n\nThe missile system has already achieved success in selling t...",
    "category": "Interest Rates",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 500,
    "title": "US foreign policy as it happened: Donald Trump to meet Vladimir Putin in Alaska and signals Ukraine may need to cede land; Armenia and Azerbaijan sign joint peace declaration",
    "url": "https://www.ft.com/content/a237d285-7033-4d46-9718-63e17b481e54",
    "source": "www.ft.com",
    "description": "Try unlimited access Only Rs100 for 4 weeks\n\nThen Rs4335 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial.",
    "category": "Monetary Policy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 904,
    "title": "Armenia, U.S. deepen talks on economic collaboration",
    "url": "https://www.panarmenian.net/eng/news/328235/",
    "source": "www.panarmenian.net",
    "description": "PanARMENIAN.Net - During his working visit to California, Armenia’s Ambassador to the U.S., Narek Mkrtchyan, met with John Shea, President and CEO of the World Trade Center Northern California, and Operations Director Tessa Carter.\n\nAccording to a statement by Armenia’s embassy in the U.S., the meet...",
    "category": "Trade Policy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 907,
    "title": "Armenian government will adopt economic policy doctrine in 2026 – Pashinyan",
    "url": "https://arka.am/en/news/economy/armenian-government-will-adopt-economic-policy-doctrine-in-2026-pashinyan/",
    "source": "arka.am",
    "description": "The Armenian government is set to approve an economic policy doctrine, when it holds its first meeting in 2026, Prime Minister Nikol Pashinyan announced last Saturday while addressing the second conference on improving the business environment through dialogue in the resort town of Jermuk.\n\nYEREVAN,...",
    "category": "Trade Policy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 908,
    "title": "EAEU and India begin negotiations on free trade agreement",
    "url": "https://arka.am/en/news/economy/eaeu-and-india-begin-negotiations-on-free-trade-agreement/",
    "source": "arka.am",
    "description": "The first round of negotiations on a free trade agreement between the Eurasian Economic Union (EAEU), its member states, and the Republic of India took place in New Delhi.\n\n\n\nYEREVAN, December 1. /ARKA/. The first round of negotiations on a free trade agreement between the Eurasian Economic Union (E...",
    "category": "Trade Policy",
    "country": "Armenia",
    "published_date": "2025-12-01"
  },
  {
    "id": 516,
    "title": "Unemployment rate in Armenia fell to 14% in the first quarter - WB",
    "url": "https://arka.am/en/news/economy/unemployment-rate-in-armenia-fell-to-14-in-the-first-quarter-wb/",
    "source": "arka.am",
    "description": "In Q1, the unemployment rate declined to 14 percent, down from 15.5 percent in Q1 2024, while the employment and labor force participation rates stood at 50.1 percent and 58.2 percent, respectively, according to the World Bank's \"Armenia Monthly Economic Update – September 2025.\"\n\n\n\nYEREVAN, Septemb...",
    "category": "Unemployment",
    "country": "Armenia",
    "published_date": "2025-12-01"
  }
]