[
  {
    "id": 1136,
    "title": "'Belgium heading for the largest budget deficit in the Eurozone', European Commission predicts",
    "url": "https://www.vrt.be/vrtnws/en/2025/11/17/belgium-heading-for-the-largest-budget-deficit-in-the-eurozone/",
    "source": "www.vrt.be",
    "description": "If policy remains unchanged, the budget deficit for next year will be 5.5 per cent of national output or GDP, the Commission predicts. This makes Belgium the worst performer among Eurozone countries. In 2027, the deficit is expected to rise further to 5.9 per cent.\n\nThe forecasts are yet another sig...",
    "category": "Economy",
    "country": "Belgium",
    "published_date": "2025-11-01"
  },
  {
    "id": 1139,
    "title": "Belgium hit by 3 days of strike action: what to expect on Monday",
    "url": "https://www.vrt.be/vrtnws/en/2025/11/20/belgium-hit-by-3-days-of-strike-action-what-to-expect-on-monday/",
    "source": "www.vrt.be",
    "description": "On Monday, the strike will mainly affect public transport.\n\nTrain services will be disrupted for three days due to the strike. The railway unions have called on staff at state railway company NMBS to take part in a 72-hour strike, which will start on Sunday 23 November at 10 p.m. and continue until ...",
    "category": "Economy",
    "country": "Belgium",
    "published_date": "2025-11-01"
  },
  {
    "id": 1131,
    "title": "Belgium’s budget deficit on track for record high within the Eurozone",
    "url": "https://euroweeklynews.com/2025/11/17/belgiums-budget-deficit-on-track-for-record-high-within-the-eurozone/",
    "source": "euroweeklynews.com",
    "description": "Belgium’s public finances are expected to deteriorate further over the next two years, according to the European Commission’s latest economic forecast, as financial pressures mount across multiple sectors of the economy. The deficit is projected to reach 5.3% of GDP in 2025 and 5.5% in 2026, extendi...",
    "category": "GDP",
    "country": "Belgium",
    "published_date": "2025-11-01"
  },
  {
    "id": 1154,
    "title": "Belgium grinds to a halt in three-day general strike against austerity measures",
    "url": "https://euobserver.com/labour/ar67918671",
    "source": "euobserver.com",
    "description": "Belgian unions launched a three-day general strike on Monday (24 November), bringing the country to a near standstill as workers protested against the government's austerity plan targeting pensions, unemployment benefits, and labor protections.\n\nBrussels fell strangely silent, with hardly any buses ...",
    "category": "Unemployment",
    "country": "Belgium",
    "published_date": "2025-11-01"
  }
]