[
  {
    "id": 2960,
    "title": "Natty B. Davis Re-elected President of Liberia Chamber of Commerce – Vows Stronger Public-Private Partnership",
    "url": "https://frontpageafricaonline.com/news/natty-b-davis-re-elected-president-of-liberia-chamber-of-commerce-vows-stronger-public-private-partnership/",
    "source": "frontpageafricaonline.com",
    "description": "Monrovia – O. Natty B. Davis has been re-elected as President of the Liberia Chamber of Commerce (LCC), securing a second term with a promise to strengthen collaboration between the private sector and the government to support economic growth and national development.\n\nDavis, who ran unopposed in el...",
    "category": "Economic Growth",
    "country": "Liberia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2961,
    "title": "Rural Women Showcase Transformative Success Under Liberia Women Empowerment Project",
    "url": "https://frontpageafricaonline.com/news/rural-women-showcase-transformative-success-under-liberia-women-empowerment-project/",
    "source": "frontpageafricaonline.com",
    "description": "Todee District, Montserrado County — As part of national activities marking the 16 Days of Activism Against Gender-Based Violence under the theme: “Unite to End Violence: Protecting All Women and Children in Our Communities and Digital Spaces,” the Liberia Women Empowerment Project (LWEP) recently l...",
    "category": "Economic Growth",
    "country": "Liberia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2951,
    "title": "AfDF Approves $7.41m to Complete Liberia’s Gbedin Falls Hydropower Project",
    "url": "https://www.devdiscourse.com/article/business/3710636-afdf-approves-741m-to-complete-liberias-gbedin-falls-hydropower-project",
    "source": "www.devdiscourse.com",
    "description": "The African Development Fund (AfDF)—the concessional financing arm of the African Development Bank Group—has approved an additional US$7.41 million loan to support the completion of Liberia’s Renewable Energy for Electrification Project, a major initiative aimed at expanding energy access, boosting ...",
    "category": "Economy",
    "country": "Liberia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2953,
    "title": "To Transform Liberia’s Financial Sector, CBL Unveils Instant Pay Revolution",
    "url": "https://frontpageafricaonline.com/news/to-transform-liberias-financial-sector-cbl-unveils-instant-pay-revolution/",
    "source": "frontpageafricaonline.com",
    "description": "The Central Bank of Liberia (CBL) has announced the upcoming launch of its Inclusive Instant Payment System (IIPS), a groundbreaking platform designed to deliver fast, secure, and affordable digital payments to all Liberians.\n\nSet to launch on December 16, 2025, the IIPS is expected to bridge the co...",
    "category": "Economy",
    "country": "Liberia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2954,
    "title": "Liberia: Snowe Warns Lawmakers Against Politicizing Legislative Projects, Dedicates New Basketball, Volleyball Courts in Bomi",
    "url": "https://frontpageafricaonline.com/news/liberia-snowe-warns-lawmakers-against-politicizing-legislative-projects-dedicates-new-basketball-volleyball-courts-in-bomi/",
    "source": "frontpageafricaonline.com",
    "description": "Bomi County Senator Edwin Snowe has cautioned his colleagues against using government-funded legislative projects for self-promotion, warning that such actions undermine the intended purpose of national development initiatives.\n\nBy Obediah Johnson\n\nSenator Snowe emphasized that the Government of Lib...",
    "category": "Economy",
    "country": "Liberia",
    "published_date": "2025-12-01"
  },
  {
    "id": 2955,
    "title": "Liberia eyes Tanzania’s TADB model",
    "url": "https://dailynews.co.tz/liberia-eyes-tanzanias-tadb-model/",
    "source": "dailynews.co.tz",
    "description": "DAR ES SALAAM: A HIGH-LEVEL delegation from the Central Bank of Liberia is in Tanzania, to study the operations and governance framework of the Tanzania Agricultural Development Bank (TADB), as Monrovia moves toward establishing its first specialised agricultural development bank to improve accounta...",
    "category": "Economy",
    "country": "Liberia",
    "published_date": "2025-12-01"
  }
]