[
  {
    "id": 2047,
    "title": "Wall Street’s macro traders eye their biggest haul in 16 years",
    "url": "https://www.livemint.com/market/stock-market-news/wall-street-s-macro-traders-eye-their-biggest-haul-in-16-years-11764079530014.html",
    "source": "www.livemint.com",
    "description": "Wall Street’s macro traders are headed for their best year since 2009 as clients rushed to place bets on changing interest rate policies by central banks around the world.\n\nFirms including Goldman Sachs Group Inc., JPMorgan Chase & Co. and Citigroup Inc. are expected to generate $165 billion in reve...",
    "category": "Central Bank",
    "country": "Ethiopia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2049,
    "title": "Ethiopia launches its first Central Securities Depository system",
    "url": "https://www.cnbcafrica.com/media/7764083703230/ethiopia-launches-its-first-central-securities-depository-system",
    "source": "www.cnbcafrica.com",
    "description": "Ethiopia marked a historic milestone in its financial reform journey with the launch of its first fully integrated Central Securities Depository (CSD) and the introduction of the Ts'ega National Investor Portal, which equips Ethiopians with real-time secure access to their securities holdings. This ...",
    "category": "Central Bank",
    "country": "Ethiopia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2056,
    "title": "Deeper M’sia-Ethiopia ties",
    "url": "https://www.thestar.com.my/news/nation/2025/11/20/deeper-msia-ethiopia-ties",
    "source": "www.thestar.com.my",
    "description": "ADDIS ABABA: With vast opportunities for the blossoming of relations between Malaysia and Ethiopia, cooperation between the two countries must not only be meaningful but also courageous, says Datuk Seri Anwar Ibrahim\n\nThe Prime Minister said in a world full of uncertainties, countries need friends t...",
    "category": "Economic Growth",
    "country": "Ethiopia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2057,
    "title": "Ethiopia's Economic Growth Creates Significant Opportunities for Manufacturing Sector - Ministry Says",
    "url": "https://allafrica.com/stories/202511030146.html",
    "source": "allafrica.com",
    "description": "Addis Ababa — The Ministry of Industry has affirmed that Ethiopia's rapid economic growth has been creating significant opportunities for the manufacturing sector.\n\nPrime Minister Abiy Ahmed while addressing at the 2nd regular session of the 5th year of the House of People's Representatives (HPR), w...",
    "category": "Economic Growth",
    "country": "Ethiopia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2044,
    "title": "Air India, Akasa cancel flights after Ethiopia volcano erupts",
    "url": "https://www.thehindubusinessline.com/economy/logistics/air-india-akasa-cancel-flights-after-ethiopia-volcano-erupts/article70320446.ece",
    "source": "www.thehindubusinessline.com",
    "description": "Air India and Akasa Air said on Tuesday they were cancelling some flights after ash plumes from a volcanic eruption in Ethiopia disrupted operations.\n\nAir India said it had cancelled 11 flights on Monday and Tuesday to make precautionary checks on aircraft that had flown over some locations after th...",
    "category": "Economy",
    "country": "Ethiopia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2052,
    "title": "Tengku Zafrul: Malaysia’s G20 presence proves foreign policy remains neutral, sovereign",
    "url": "https://www.malaymail.com/news/malaysia/2025/11/22/tengku-zafrul-malaysias-g20-presence-proves-foreign-policy-remains-neutral-sovereign/199299",
    "source": "www.malaymail.com",
    "description": "JOHANNESBURG, Nov 22 — Malaysia’s presence at a major forum such as the G20 is proof that the nation’s foreign policy remains neutral, sovereign and not tied with any major powers, said Investment, Trade and Industry Minister Tengku Datuk Seri Zafrul Aziz.\n\n“Some have claimed that after signing the ...",
    "category": "Trade Policy",
    "country": "Ethiopia",
    "published_date": "2025-11-01"
  }
]