[
  {
    "id": 4160,
    "title": "Singapore upgrades 2025 growth forecast after stronger-than-expected Q3 GDP",
    "url": "https://www.malaymail.com/news/singapore/2025/11/21/singapore-upgrades-2025-growth-forecast-after-stronger-than-expected-q3-gdp/199184",
    "source": "www.malaymail.com",
    "description": "SINGAPORE, Nov 21 — Singapore today upgraded its economic outlook for 2025 as third-quarter gross domestic product growth beat market expectations and initial estimates.\n\nGDP rose 4.2 per cent in the third quarter from a year earlier, government data showed, faster than the 2.9 per cent official adv...",
    "category": "Economic Growth",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4161,
    "title": "Conditions for Singapore's success have shifted, we must stay 'cautiously optimistic': Jeffrey Siow",
    "url": "https://www.asiaone.com/singapore/conditions-singapores-success-have-shifted-and-we-must-stay-cautiously-optimistic-jeffrey",
    "source": "www.asiaone.com",
    "description": "Singapore needs to remain \"cautiously optimistic\" and adjust its current economic strategies to ensure that it is well-positioned for the future, said Acting Minister for Transport Jeffrey Siow.\n\nSpeaking on the sidelines of a closed-door engagement session between Economic Strategy Review (ESR) mem...",
    "category": "Economic Growth",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4163,
    "title": "Striving to lead in AI to power economic growth",
    "url": "https://www.thestar.com.my/business/business-news/2025/11/21/striving-to-lead-in-ai-to-power-economic-growth",
    "source": "www.thestar.com.my",
    "description": "SINGAPORE: Singapore must find a way to capture investment flows in artificial intelligence (AI) to power its economic growth over the next decade, says acting Transport Minister and Senior Minister of State for Finance Jeffrey Siow while giving an update on the government’s economic strategy review...",
    "category": "Economic Growth",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4164,
    "title": "Batam secures US$10.35 billion investment commitments in Singapore",
    "url": "https://en.antaranews.com/news/392481/batam-secures-us1035-billion-investment-commitments-in-singapore",
    "source": "en.antaranews.com",
    "description": "Batam secures US$10.35 billion investment commitments in Singapore\n\nBatam, Riau Islands (ANTARA) - Batam’s investment authority reported US$10.35 billion in commitments from global companies during the “Second Edition of Islands of Growth” forum in Singapore on Tuesday.Fary Djemy Francis, Deputy for...",
    "category": "Economic Growth",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4135,
    "title": "More companies in Singapore set to freeze wages as economic outlook worsens: SBF survey",
    "url": "https://www.asiaone.com/singapore/more-companies-singapore-set-freeze-wages-economic-outlook-worsens-sbf-survey",
    "source": "www.asiaone.com",
    "description": "More companies in Singapore are set to freeze wages over the next year amid growing pessimism about the economy, according to a Singapore Business Federation (SBF) survey released on Thursday (Nov 27).\n\nThe 2025 National Business Survey, which drew responses from 553 businesses across key sectors, f...",
    "category": "Economy",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4137,
    "title": "Singapore must keep upgrading its economy to stay competitive in a troubled world, says PM Wong",
    "url": "https://www.asiaone.com/singapore/singapore-must-keep-upgrading-its-economy-stay-competitive-troubled-world-says-pm-lawrence-wong-GIC-insights",
    "source": "www.asiaone.com",
    "description": "Singapore must continually upgrade its economy so as to stay competitive in a troubled world, Prime Minister Lawrence Wong said on Tuesday (Nov 18).\n\nIn a keynote address at this year’s GIC Insights dinner, PM Wong, who is also finance minister and deputy chairman of Singapore’s sovereign wealth fun...",
    "category": "Economy",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4138,
    "title": "Jokowi Meets Lee Hsien Loong Ahead of Bloomberg New Economy Forum 2025",
    "url": "https://en.tempo.co/read/2067359/jokowi-meets-lee-hsien-loong-ahead-of-bloomberg-new-economy-forum-2025",
    "source": "en.tempo.co",
    "description": "TEMPO.CO, Jakarta - On the second day of the Bloomberg New Economy Forum 2025 in Singapore on Thursday, November 20, 2025, former Indonesian President Joko Widodo (Jokowi) met with former Prime Minister of Singapore Lee Hsien Loong. Their meeting took place at the Raffles Hotel in Singapore.\n\nJokowi...",
    "category": "Economy",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4141,
    "title": "Singapore Exports Show Weakness Even as Economy Shines",
    "url": "https://www.morningstar.com/news/dow-jones/2025112011683/singapore-exports-show-weakness-even-as-economy-shines",
    "source": "www.morningstar.com",
    "description": "By Fabiana Negrin Ochoa and Amanda Lee\n\nSingapore's economic growth eclipsed expectations in the third quarter, but exports showed some weakness that signal continued headwinds for the city-state.\n\nNon-oil domestic exports declined by 3.3% over the July-September period, reversing from a 7.0% increa...",
    "category": "Economy",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4119,
    "title": "Singapore core inflation hits 1.2% in October 2025",
    "url": "https://www.straitstimes.com/business/economy/singapore-core-inflation-rises-to-1-2-in-october-highest-rate-recorded-in-2025",
    "source": "www.straitstimes.com",
    "description": "Sign up now: Get ST's newsletters delivered to your inbox\n\nHigher inflation in services, food, retail and other goods drove up core inflation in October.\n\nSINGAPORE - Singapore’s rise in consumer prices accelerated in October, driven by higher inflation in services, food, retail and other goods, acc...",
    "category": "Inflation",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4120,
    "title": "Singapore core inflation rises at fastest pace since December",
    "url": "https://www.thestar.com.my/business/business-news/2025/11/25/singaporecore-inflation-rises-at-fastest-pace-since-december",
    "source": "www.thestar.com.my",
    "description": "SINGAPORE: Singapore’s key inflation gauge accelerated at a faster-than-expected pace in October suggesting strong economic momentum may be adding to price pressures.\n\nThe core inflation rate, which excludes housing and private transportation costs, stood at 1.2% from a year earlier, according to a ...",
    "category": "Inflation",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4124,
    "title": "Real median income in Singapore rose 4.3% in 2025 as workers in permanent jobs hit a new high",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/11/28/real-median-income-in-singapore-rose-43-in-2025-as-workers-in-permanent-jobs-hit-a-new-high",
    "source": "www.thestar.com.my",
    "description": "SINGAPORE (The Straits Times/ANN): Workers in Singapore saw their incomes grow in 2025 after taking lower inflation into account, with those in permanent jobs hitting a high of over 90 per cent, according to data released by the Ministry of Manpower (MOM) on Nov 28.\n\nThese trends indicate that Singa...",
    "category": "Inflation",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4126,
    "title": "Singapore Maintains Steady Monetary Outlook as Positive Output Gap Persists into 2025",
    "url": "https://www.econotimes.com/Singapore-Maintains-Steady-Monetary-Outlook-as-Positive-Output-Gap-Persists-into-2025-1726581",
    "source": "www.econotimes.com",
    "description": "Singapore’s monetary policy remains firmly on track, according to central bank chief economist Edward Robinson, who emphasized that current settings continue to support stable, sustainable economic growth. Speaking at a media briefing following the release of the city-state’s third-quarter economic ...",
    "category": "Monetary Policy",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4132,
    "title": "President Tharman to receive MIT award for his leadership in international financial policy",
    "url": "https://www.asiaone.com/singapore/president-tharman-receive-mit-award-his-leadership-international-financial-policy",
    "source": "www.asiaone.com",
    "description": "SINGAPORE — President Tharman Shanmugaratnam will be receiving an award from an American research centre in recognition of his leadership in international financial policy.\n\nThe Massachusetts Institute of Technology (MIT) Golub Center for Finance and Policy is awarding Tharman the Miriam Pozen Prize...",
    "category": "Monetary Policy",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4155,
    "title": "Singapore calls for deeper cooperation with China amid geopolitical shifts and social pressures",
    "url": "https://www.straitstimes.com/singapore/singapore-calls-for-deeper-cooperation-with-china-amid-geopolitical-shifts-and-social-pressures",
    "source": "www.straitstimes.com",
    "description": "Sign up now: Get ST's newsletters delivered to your inbox\n\nCoordinating Minister for Public Services Chan Chun Sing noted that the current era is marked by geopolitical competition.\n\nSINGAPORE - Singapore and China must deepen cooperation and strengthen trusted leadership to navigate a period of pro...",
    "category": "Trade Policy",
    "country": "Singapore",
    "published_date": "2025-11-01"
  },
  {
    "id": 4169,
    "title": "Singapore's Labor Market in Good Shape, But Aging Risks Loom Large",
    "url": "https://www.morningstar.com/news/dow-jones/202511274390/singapores-labor-market-in-good-shape-but-aging-risks-loom-large",
    "source": "www.morningstar.com",
    "description": "By Amanda Lee\n\nSingapore's labor market has held up well this year amid global economic headwinds, but continues to face challenges from an aging population.\n\nIncomes have continued to grow in 2025, while unemployment has remained low, the Ministry of Manpower said Friday.\n\nAlthough labor force part...",
    "category": "Unemployment",
    "country": "Singapore",
    "published_date": "2025-11-01"
  }
]