[
  {
    "id": 3987,
    "title": "São Tomé and Príncipe - African Development Bank Group Approves Additional $8.9 Million Gef Grant to Strengthen Agricultural and Fisheries Sectors Against Climate Shocks",
    "url": "https://allafrica.com/stories/202510080673.html",
    "source": "allafrica.com",
    "description": "The African Development Bank Group's Board of Directors has approved an additional grant of $8.9 million from the Global Environment Facility (GEF) to support São Tomé and Príncipe's efforts to build resilience against climate change and boost agricultural productivity.\n\nThis supplementary funding b...",
    "category": "Central Bank",
    "country": "Sao Tome and Principe",
    "published_date": "2025-10-01"
  },
  {
    "id": 3988,
    "title": "São Tomé and Príncipe - African Development Bank and Government Step Up Delivery of €72 Million Country Portfolio to Drive Economic Diversification",
    "url": "https://allafrica.com/stories/202510140528.html",
    "source": "allafrica.com",
    "description": "The African Development Bank Group and the government of São Tomé and Principe have redoubled efforts to strengthen the Bank's €72 million portfolio in the country and drive the country's economic diversification.\n\n\"The African Development Bank's lending portfolio in São Tomé and Principe represents...",
    "category": "Central Bank",
    "country": "Sao Tome and Principe",
    "published_date": "2025-10-01"
  },
  {
    "id": 3973,
    "title": "Preview: Sao Tome & Principe vs Tunisia",
    "url": "https://www.sportsmole.co.uk/football/sao-tome-principe-football/world-cup/preview/sao-tome-vs-tunisia-prediction-team-news-lineups_583190.html",
    "source": "www.sportsmole.co.uk",
    "description": "By Ademola Adediji | 08 Oct 2025 16:31 , Last updated: 09 Oct 2025 08:46\n\nA dead-rubber fixture in Group H of CAF 2026 World Cup Qualifying will see Sao Tome & Príncipe go head-to-head with Tunisia, who have already booked their place at the Mundial on Friday at Stade Olympique de Rades.\n\nThe hosts ...",
    "category": "GDP",
    "country": "Sao Tome and Principe",
    "published_date": "2025-10-01"
  },
  {
    "id": 3979,
    "title": "Sao Tome and Principe hails partnership with China as model of South-South cooperation",
    "url": "https://www.thestar.com.my/news/world/2025/10/02/sao-tome-and-principe-hails-partnership-with-china-as-model-of-south-south-cooperation",
    "source": "www.thestar.com.my",
    "description": "SAO TOME, Oct. 1 (Xinhua) -- Sao Tome and Principe has called for its growing ties with China to serve as an inspiring example of South-South cooperation, highlighting the historic depth and modern vitality of bilateral relations.\n\nSpeaking on behalf of the government at a reception held by the Chin...",
    "category": "GDP",
    "country": "Sao Tome and Principe",
    "published_date": "2025-10-01"
  },
  {
    "id": 3980,
    "title": "São Tomé and Príncipe: World Bank Boosts Social Protection and Resilience for 27,500 People",
    "url": "https://www.worldbank.org/en/news/press-release/2025/10/14/sao-tome-and-principe-world-bank-boosts-social-protection-and-resilience-for-27500-people",
    "source": "www.worldbank.org",
    "description": "WASHINGTON, October 14, 2025 – The World Bank and the Government of São Tomé and Príncipe signed an agreement for $6 million in additional financing to support the Social Protection, Resilience, and Recovery Project. This collaboration seeks to enhance existing social protection initiatives while in...",
    "category": "GDP",
    "country": "Sao Tome and Principe",
    "published_date": "2025-10-01"
  }
]