[
  {
    "id": 3368,
    "title": "Dutch central bank to cut costs as part of major reorganisation",
    "url": "https://www.dutchnews.nl/2025/11/dutch-central-bank-to-cut-costs-as-part-of-major-reorganisation/",
    "source": "www.dutchnews.nl",
    "description": "The Dutch central bank (DNB) plans to cut its budget by 10% in the coming years as part of a wider push to become more efficient in a period of geopolitical tension and financial uncertainty.\n\nSpeaking at an internal meeting on Monday, bank president Olaf Sleijpen said the savings – around €60 milli...",
    "category": "Central Bank",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3369,
    "title": "Central bank warns Dutch investors over U.S. share value amid possible AI bubble",
    "url": "https://nltimes.nl/2025/11/17/central-bank-warns-dutch-investors-us-share-value-amid-possible-ai-bubble",
    "source": "nltimes.nl",
    "description": "Dutch financial authorities are warning that record-high U.S. stock valuations and global economic uncertainty pose risks to financial stability, according to De Nederlandsche Bank’s (DNB) autumn 2025 financial stability report.\n\nLast week, major U.S. stock indices suffered their largest monthly dec...",
    "category": "Central Bank",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3370,
    "title": "Netherlands Bank aims to cut costs by 10% with spending freeze",
    "url": "https://www.centralbanking.com/central-banks/governance/organisation/7974120/netherlands-bank-aims-to-cut-costs-by-10-with-spending-freeze",
    "source": "www.centralbanking.com",
    "description": "The Netherlands Bank (DNB) is looking to streamline its operations by 10% by freezing its annual budget for the coming five years.\n\nIn a press release on November 17, the bank said its DNB 2030 programme would result in €60 million ($69.5 million) of savings. It also admitted that the plan would inv...",
    "category": "Central Bank",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3371,
    "title": "Delhaize Serbia denies c-bank's tax evasion allegations",
    "url": "https://seenews.com/news/delhaize-serbia-denies-c-banks-tax-evasion-allegations-1285444",
    "source": "seenews.com",
    "description": "",
    "category": "Central Bank",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3364,
    "title": "China, EU push Nexperia and Chinese owner to end ‘corporate dispute’ amid chip concerns",
    "url": "https://www.scmp.com/economy/global-economy/article/3334389/china-eu-push-nexperia-and-chinese-owner-end-corporate-dispute-amid-chip-concerns",
    "source": "www.scmp.com",
    "description": "Both China and the European Union have signalled that a dispute over semiconductor maker Nexperia should be resolved at the corporate level, according to China’s Ministry of Commerce, as affected countries continue to seek a solution to supply-chain disruptions.\n\nThe push for a corporate resolution ...",
    "category": "Economy",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3365,
    "title": "First week of coalition talks end with focus on the economy",
    "url": "https://www.dutchnews.nl/2025/11/first-week-of-coalition-talks-end-with-focus-on-the-economy/",
    "source": "www.dutchnews.nl",
    "description": "The first week of coalition talks between D66 and the CDA has centred on defence, security, nitrogen reduction and the long-term earning capacity of the Dutch economy, with a series of experts brought in by informateur Sybrand Buma to brief the two parties.\n\nOn Friday the talks turned to the future ...",
    "category": "Economy",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3359,
    "title": "Dutch economy more resilient to U.S. import tariffs, inflation than expected: ABN Amro",
    "url": "https://nltimes.nl/2025/11/27/dutch-economy-resilient-us-import-tariffs-inflation-expected-abn-amro",
    "source": "nltimes.nl",
    "description": "The Dutch economy will be in a “stronger” position at the end of 2025 than expected, despite U.S. import tariffs, excessive inflation, and uncertainty, ABN Amro reported. The bank has raised its growth forecasts for the Dutch economy for this year and next.\n\nABN Amro expects the Dutch economy to gro...",
    "category": "Inflation",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3360,
    "title": "Stock Market Today: Sensex Opens Higher, Nifty Slips; Global Cues Mixed, IT Stocks in Focus",
    "url": "https://www.newsx.com/business/stock-market-today-sensex-opens-higher-nifty-slips-global-cues-mixed-it-stocks-in-focus-116579/",
    "source": "www.newsx.com",
    "description": "Global & Asian Markets Asian markets opened mixed as last week’s global rebound lost steam.\n\nNikkei, Hang Seng, and Kospi traded lower; Straits Times moved higher.\n\nUS futures stayed flat as Wall Street remained shut for Thanksgiving.\n\nNasdaq is on track to end its seven-month winning streak. Inflat...",
    "category": "Inflation",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3376,
    "title": "Unemployment in Netherlands remains at four-year peak of 4 percent",
    "url": "https://nltimes.nl/2025/11/20/unemployment-netherlands-remains-four-year-peak-4-percent",
    "source": "nltimes.nl",
    "description": "Unemployment in the Netherlands remained steady in October, with 411,000 people out of work, unchanged from the previous month, the CBS reported. As in September, 4 percent of the labor force was without paid employment — the highest level in four years.\n\nOn average, the number of unemployed people ...",
    "category": "Unemployment",
    "country": "Netherlands",
    "published_date": "2025-11-01"
  }
]