[
  {
    "id": 1873,
    "title": "In a world fighting controls to trigger growth, the economic survey explores the fruits of deregulation",
    "url": "https://www.financialexpress.com/policy/economy-in-a-world-fighting-controls-to-trigger-growth-the-economic-survey-explores-the-fruits-of-deregulation-3732537/",
    "source": "www.financialexpress.com",
    "description": "The Economic Survey, 2025 is a gelignite of alluring possibilities. From its opening words “driving domestic growth and resilience through deregulation,” to the gains to be accrued by “getting out of the way” or even a discussion around changing the operating principle of regulations from “guilty un...",
    "category": "Economic Growth",
    "country": "Denmark",
    "published_date": "2025-12-01"
  },
  {
    "id": 1857,
    "title": "Novo Nordisk Just Saved Denmark's Economy--But for How Long?",
    "url": "https://uk.finance.yahoo.com/news/novo-nordisk-just-saved-denmarks-114503632.html",
    "source": "uk.finance.yahoo.com",
    "description": "This article first appeared on GuruFocus.\n\nDanish GDP didn't just rebound in the third quarterit snapped back with a force the country hasn't seen since late 2021, and the catalyst was unmistakable. A 2.3% quarterly jump, according to Statistics Denmark, was powered almost entirely by the pharmaceut...",
    "category": "Economy",
    "country": "Denmark",
    "published_date": "2025-12-01"
  },
  {
    "id": 1858,
    "title": "India, International Solar Alliance discuss sustainable energy initiatives in Denmark",
    "url": "https://www.zeebiz.com/economy-infra/world-economy/news-india-international-solar-alliance-discuss-sustainable-energy-initiatives-in-denmark-346167",
    "source": "www.zeebiz.com",
    "description": "India, International Solar Alliance discuss sustainable energy initiatives in Denmark\n\nIANS Written By\n\nIndia and Denmark also collaborated in the ISA and during India's G20 presidency. Denmark participated in the working groups on climate, environment and energy transmission as a part of the Green ...",
    "category": "Economy",
    "country": "Denmark",
    "published_date": "2025-12-01"
  },
  {
    "id": 1859,
    "title": "Hoyer acquires Denmark-based Dantra Group",
    "url": "https://www.bulktransporter.com/fleet-management/news/55333203/hoyer-acquires-denmark-based-dantra-group",
    "source": "www.bulktransporter.com",
    "description": "The Hoyer Group recently acquired Danish family-owned company Dantra Group.\n\nThe acquisition is intended to strengthen Hoyer’s position as a leading provider of transport logistics in Scandinavia, covering both road and intermodal operations, the company reported. Hoyer now maintains a strong presen...",
    "category": "Economy",
    "country": "Denmark",
    "published_date": "2025-12-01"
  },
  {
    "id": 1861,
    "title": "Five ways to make the ocean economy more sustainable and just",
    "url": "https://uk.news.yahoo.com/five-ways-ocean-economy-more-145104112.html",
    "source": "uk.news.yahoo.com",
    "description": "The ocean has long been treated as boundless – a frontier for extraction and a sink for waste. This perception has driven decades of exploitation and neglect, pushing marine systems toward irreversible decline. Yet with urgent, collective action, recovery remains within reach, offering renewed globa...",
    "category": "Economy",
    "country": "Denmark",
    "published_date": "2025-12-01"
  },
  {
    "id": 1868,
    "title": "Denmark to strengthen Arctic defence amid US interest in Greenland",
    "url": "https://www.tribuneindia.com/news/world/denmark-to-strengthen-arctic-defence-amid-us-interest-in-greenland/",
    "source": "www.tribuneindia.com",
    "description": "Denmark has unveiled plans to bolster its military presence in the Arctic amid rising concerns over the US interest in acquiring Greenland, a Danish-owned territory.\n\nAdvertisement\n\nDanish Defence Minister Troels Lund Poulsen announced late Monday that the government will allocate 14.6 billion Danis...",
    "category": "Interest Rates",
    "country": "Denmark",
    "published_date": "2025-12-01"
  },
  {
    "id": 1870,
    "title": "Asetek - Mandatory Notification of Trade",
    "url": "https://uk.finance.yahoo.com/news/asetek-mandatory-notification-trade-223100771.html",
    "source": "uk.finance.yahoo.com",
    "description": "AALBORG, Denmark, Nov. 27, 2025 /PRNewswire/ -- According to the Market Abuse Regulation art. 19, Asetek A/S (the \"Company\") announces to have received notifications regarding transactions in the Company's shares and related securities by persons discharging managerial responsibilities and persons c...",
    "category": "Trade Policy",
    "country": "Denmark",
    "published_date": "2025-12-01"
  },
  {
    "id": 1871,
    "title": "India-Denmark hold 8th Foreign Office Consultations, reaffirm commitment to widen scope of ties",
    "url": "https://news.webindia123.com/news/Articles/World/20251117/4384882.html",
    "source": "news.webindia123.com",
    "description": "The 8th India-Denmark Foreign Office Consultations took place in New Delhi on Monday. \"It was co-chaired by Secretary (West) Sibi George and State Secretary for Foreign Policy Lotte Machon. They took stock of the ongoing bilateral cooperation under the India-Denmark Green Strategic Partnership and t...",
    "category": "Trade Policy",
    "country": "Denmark",
    "published_date": "2025-12-01"
  }
]