[
  {
    "id": 1665,
    "title": "This oil producer announced it would move away from oil. Here's what happened next",
    "url": "https://alaskapublic.org/news/economy/energy/2025-11-11/this-oil-producer-announced-it-would-move-away-from-oil-heres-what-happened-next",
    "source": "alaskapublic.org",
    "description": "Updated November 12, 2025 at 9:38 AM AKST\n\nTAGANGA, Colombia – On Colombia's Caribbean coast, a fishing village lies in a cove where green hills meet the turquoise sea.\n\nA few years ago , oil companies found natural gas off the coast and now plan to drill Colombia's deepest gas wells there.\n\nIt's be...",
    "category": "Economy",
    "country": "Colombia",
    "published_date": "2025-11-01"
  },
  {
    "id": 1659,
    "title": "Chainalysis Shows Crypto Acts as Hedge in High-Inflation Economies",
    "url": "https://www.crypto-news-flash.com/chainalysis-data-shows-bitcoin-becoming-default-hedge-in-high-inflation-economies/",
    "source": "www.crypto-news-flash.com",
    "description": "Countries with high inflation are now using Bitcoin and crypto to protect value.\n\nBitcoin seems to be one of the best alternatives for adoption due to its design.\n\nChainalysis 2025 Geography of Crypto Report shows a growing trend in countries struggling with fast-rising prices, as people are turning...",
    "category": "Inflation",
    "country": "Colombia",
    "published_date": "2025-11-01"
  },
  {
    "id": 1670,
    "title": "Colombia pushes for talks – to include China – over US military build-up near Venezuela",
    "url": "https://www.scmp.com/news/us/diplomacy/article/3333166/colombia-pushes-talks-include-china-over-us-military-build-near-venezuela",
    "source": "www.scmp.com",
    "description": "Colombian President Gustavo Petro called for a high-level security meeting with the United States, China and regional partners, arguing that recent US military deployments and strikes on suspected drug-smuggling boats in the Caribbean and eastern Pacific are escalating tensions in the region.\n\nJoini...",
    "category": "Trade Policy",
    "country": "Colombia",
    "published_date": "2025-11-01"
  }
]