[
  {
    "id": 4742,
    "title": "Ashgabat Takes Lead In Turkmenistan's Digital Commerce For Nov. 2025",
    "url": "https://menafn.com/1110408483/Ashgabat-Takes-Lead-In-Turkmenistans-Digital-Commerce-For-Nov-2025",
    "source": "menafn.com",
    "description": "MENAFN - Trend News Agency)A total of 36,944 POS terminals were operating across Turkmenistan as of November 1, 2025.\n\nThe data obtained by Trend from the country's Central Bank indicates that Ashgabat hosts the largest number of terminals, with 12,339 units, representing roughly one-third of the na...",
    "category": "Central Bank",
    "country": "Turkmenistan",
    "published_date": "2025-12-01"
  },
  {
    "id": 4732,
    "title": "Turkmenistan Passes Law to Regulate Crypto Market: Report",
    "url": "https://finance.yahoo.com/news/turkmenistan-passes-law-regulate-crypto-135115916.html?fr=sycsrp_catchall",
    "source": "finance.yahoo.com",
    "description": "The Central Asia nation, Turkmenistan, has passed a law that legalizes and regulates digital assets.\n\nIn a November 28 report, it was stated that the country will now begin to issue licences to cryptocurrency exchanges and crypto mining companies.\n\nThe law, which was signed by President Serdar Berdy...",
    "category": "Economy",
    "country": "Turkmenistan",
    "published_date": "2025-12-01"
  },
  {
    "id": 4733,
    "title": "Turkmenistan Embraces Digital Assets with New Crypto Law",
    "url": "https://www.devdiscourse.com/article/headlines/3712694-turkmenistan-embraces-digital-assets-with-new-crypto-law",
    "source": "www.devdiscourse.com",
    "description": "In a significant move for Turkmenistan, President Serdar Berdymukhamedov has signed into law legislation that legalizes and regulates digital assets. The law, which will take effect on January 1, covers the issuance of licenses for cryptocurrency exchanges and mining companies, as reported by state ...",
    "category": "Economy",
    "country": "Turkmenistan",
    "published_date": "2025-12-01"
  },
  {
    "id": 4734,
    "title": "Turkmenistan passes law regulating cryptocurrency mining and exchanges",
    "url": "https://economictimes.indiatimes.com/tech/technology/turkmenistan-passes-law-regulating-cryptocurrency-mining-and-exchanges/articleshow/125633381.cms",
    "source": "economictimes.indiatimes.com",
    "description": "Turkmenistan has passed a law legalising and regulating digital assets, including licences for cryptocurrency exchanges and crypto mining companies, state media reported on Friday.The Neutral Turkmenistan newspaper reported that President Serdar Berdymukhamedov had signed the law, which will come in...",
    "category": "Economy",
    "country": "Turkmenistan",
    "published_date": "2025-12-01"
  },
  {
    "id": 4736,
    "title": "Turkmenistan opens new technological livestock complex",
    "url": "https://www.trend.az/business/4124532.html",
    "source": "www.trend.az",
    "description": "ASHGABAT, Turkmenistan, December 2. Turkmenistan has launched a new livestock complex under the state enterprise “Altyn halka,” Trend reports via the country's parliament.\n\nThe facility, which covers 375 hectares, includes three buildings designed to house 500 head of cattle, two buildings for 200 c...",
    "category": "Economy",
    "country": "Turkmenistan",
    "published_date": "2025-12-01"
  },
  {
    "id": 4737,
    "title": "Turkmenistan expands foreign policy footprint across wide geographic spectrum",
    "url": "https://news.az/news/-turkmenistan-expands-foreign-policy-footprint-across-wide-geographic-spectrum",
    "source": "news.az",
    "description": "+ ↺ − 16 px\n\nEditor’s note: Teymur Atayev is an Azerbaijani publicist, historian, and political scientist, and hosts the program Aspects of Foreign Affairs on Azerbaijan’s CBC TV channel (broadcast in Russian). The article reflects the author’s personal views and does not necessarily represent the p...",
    "category": "Economy",
    "country": "Turkmenistan",
    "published_date": "2025-12-01"
  },
  {
    "id": 4738,
    "title": "Turkmenistan introduces new and updated polymer banknotes",
    "url": "https://www.trend.az/business/4123934.html",
    "source": "www.trend.az",
    "description": "ASHGABAT, Turkmenistan, December 1. Turkmenistan’s Central Bank has rolled out a fresh batch of modified polymer banknotes, including the 1, 5, and 10 manats, along with a new 200-manat polymer note, Trend reports via the bank.\n\nThe revamped banknotes come with bells and whistles, boasting fortified...",
    "category": "Economy",
    "country": "Turkmenistan",
    "published_date": "2025-12-01"
  },
  {
    "id": 4743,
    "title": "Third joint Turkmen-Qatari Commission on trade and economic cooperation convenes in Doha",
    "url": "https://www.zawya.com/en/economy/gcc/third-joint-turkmen-qatari-commission-on-trade-and-economic-cooperation-convenes-in-doha-yu9xdwpg",
    "source": "www.zawya.com",
    "description": "Doha: The third session of the joint trade and economic Intergovernmental Turkmen-Qatari Commission convened Thursday, with the participation of several senior officials and representatives from the public and private sectors of both countries.\n\nThe session was co-chaired by Minister of State for Fo...",
    "category": "Trade Policy",
    "country": "Turkmenistan",
    "published_date": "2025-12-01"
  }
]