[
  {
    "id": 4945,
    "title": "BlockDAG News in 2025 Tether Halts Uruguay Bitcoin Mining Operations as DeepSnitch AI's January Launch Could be the Biggest Profit Opportunity of 2026",
    "url": "https://www.theweek.in/wire-updates/business/2025/12/01/dcm76-ht-syndication.html",
    "source": "www.theweek.in",
    "description": "Tether, the issuer of the world's largest stablecoin, USDT, has officially halted its Bitcoin mining operations in Uruguay, citing rising and uncompetitive energy costs. This move shows the growing challenges for infrastructure crypto projects. As miners face issues, investors are shifting focus to ...",
    "category": "Economic Growth",
    "country": "Uruguay",
    "published_date": "2025-12-01"
  },
  {
    "id": 4939,
    "title": "Uruguay’s Enduring State: From Century-Old Consensus to Twenty-First Century Trials",
    "url": "https://www.socialeurope.eu/uruguays-enduring-state-from-century-old-consensus-to-twenty-first-century-trials",
    "source": "www.socialeurope.eu",
    "description": "Uruguay has sustained a robust statist profile since the early twentieth century. The government led by José Batlle y Ordóñez, which initiated the era known as Batllismo, was characterised by the strengthening of state institutions and, between 1904 and 1916, the consolidation of a process that rein...",
    "category": "Economy",
    "country": "Uruguay",
    "published_date": "2025-12-01"
  },
  {
    "id": 4943,
    "title": "Mercosur: Who's for and who's against?",
    "url": "https://www.agriland.ie/farming-news/mercosur-whos-for-and-whos-against/",
    "source": "www.agriland.ie",
    "description": "After 25 years of negotiations, the EU-Mercosur trade agreement is closer than ever to being signed.\n\nThe agreement with the Mercosur bloc (including Argentina, Brazil, Paraguay and Uruguay) is part of the EU’s efforts to work around tariffs imposed by the Trump administration in the US.\n\nIn theory,...",
    "category": "Trade Policy",
    "country": "Uruguay",
    "published_date": "2025-12-01"
  }
]