[
  {
    "id": 3532,
    "title": "Kim Jong Un takes major step to boost economy: North Korea opens beach resort which accommodates 20,000 people",
    "url": "https://www.livemint.com/news/kim-jong-un-takes-major-step-to-boost-economy-north-korea-opens-beach-resort-which-accommodates-20-000-people-11751451225130.html",
    "source": "www.livemint.com",
    "description": "North Korea has opened a large resort on its east coast, state media reported on Wednesday. The Wonsan Kalma Coastal Tourist Area, described by Pyongyang as “a world-class cultural resort”, is expected to welcome Russian tourists later this month. South Korean media have nicknamed it “North Korea’s ...",
    "category": "Economy",
    "country": "North Korea",
    "published_date": "2025-07-01"
  },
  {
    "id": 3535,
    "title": "North Korea snubs US offer to resume diplomatic talks: ‘mockery without nuclear recognition’",
    "url": "https://www.livemint.com/news/world/north-korea-snubs-us-offer-to-resume-diplomatic-talks-mockery-without-nuclear-recognition-11753752320367.html",
    "source": "www.livemint.com",
    "description": "North Korea has stated that the relationship between its leader, Kim Jong Un, and US President Donald Trump remains “not bad,” but warned Washington against trying to use that to achieve denuclearisation.\n\nIn a statement carried by the official Korean Central News Agency on Tuesday, Kim Yo Jong — th...",
    "category": "Economy",
    "country": "North Korea",
    "published_date": "2025-07-01"
  },
  {
    "id": 3528,
    "title": "North Korea says South Korea's overtures 'great miscalculation'",
    "url": "https://www.thehindu.com/news/international/north-korea-says-south-koreas-overtures-great-miscalculation/article69863155.ece",
    "source": "www.thehindu.com",
    "description": "North Korea has no interest in any policy or proposals for reconciliation from South Korea, the powerful sister of its leader Kim Jong Un said on Monday in the first response to South Korean liberal President Lee Jae Myung's peace overtures.\n\nKim Yo Jong, who is a senior North Korean ruling party of...",
    "category": "Fiscal Policy",
    "country": "North Korea",
    "published_date": "2025-07-01"
  },
  {
    "id": 3552,
    "title": "North Korea bars western influencers, journalist from trade fair tour",
    "url": "https://www.hindustantimes.com/world-news/north-korea-bars-western-influencers-journalist-from-trade-fair-tour-101751868952299.html",
    "source": "www.hindustantimes.com",
    "description": "North Korea has barred Western influencers from joining a delegation of tourists to an international trade fair in October, a China-based tour operator told AFP on Monday. Priced at 3,995 euros the YPT tour will depart from the Chinese capital Beijing and take in the Pyongyang Autumn International T...",
    "category": "Trade Policy",
    "country": "North Korea",
    "published_date": "2025-07-01"
  }
]