[
  {
    "id": 4202,
    "title": "Australia supports rural businesses with digital connectivity",
    "url": "https://www.solomonstarnews.com/australia-supports-rural-businesses-with-digital-connectivity/",
    "source": "www.solomonstarnews.com",
    "description": "Assistant Minister for Pacific Islands Affairs, Senator Nita Green, has reaffirmed its commitment to boosting economic development in the Solomon Islands by highlighting new efforts to strengthen digital connectivity and support rural businesses.\n\nShe was in Honiara last week.\n\nSpeaking to local med...",
    "category": "Economic Growth",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  },
  {
    "id": 4203,
    "title": "Ngella Constituency Invests CDF In Road Development To Foster Economic Growth",
    "url": "https://www.scoop.co.nz/stories/WO2511/S00299/ngella-constituency-invests-cdf-in-road-development-to-foster-economic-growth.htm",
    "source": "www.scoop.co.nz",
    "description": "Ngella Constituency Invests CDF In Road Development To Foster Economic Growth\n\nThe Ngella Constituency Office (NCO) has made an initial investment of $1.2 million from its 2024 CDF allocation for the Rara-Moromole road development project.\n\nThis investment aims to promote economic growth, improve tr...",
    "category": "Economic Growth",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  },
  {
    "id": 4204,
    "title": "Simpson to Represent NZ at PACER Plus Meeting",
    "url": "https://www.miragenews.com/simpson-to-represent-nz-at-pacer-plus-meeting-1577022/",
    "source": "www.miragenews.com",
    "description": "Minister of Commerce and Consumer Affairs Scott Simpson will today travel to the Solomon Islands to attend the 2025 Pacific Agreement on Closer Economic Relations (PACER) Plus Ministerial Meeting.\n\n\"PACER Plus plays a significant role, it strengthens economic growth and resilience in the Pacific and...",
    "category": "Economic Growth",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  },
  {
    "id": 4195,
    "title": "Solomon Islands newspaper received USD 1,30,000 from China for positive coverage: Report",
    "url": "https://www.aninews.in/news/world/pacific/solomon-islands-newspaper-received-usd-130000-from-china-for-positive-coverage-report20230806205655/",
    "source": "www.aninews.in",
    "description": "Honiara [Solomon Islands], August 6 (ANI): A Solomon Islands news company received more than USD 1,30,000 from the Chinese government in exchange for agreeing to \"promote the truth about China's generosity and its true intention to help develop\" the Pacific island country, Bangladesh-based The Daily...",
    "category": "Economy",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  },
  {
    "id": 4197,
    "title": "Pacific leader seeks investment, Australia eyes defence",
    "url": "https://au.news.yahoo.com/pacific-leader-seeks-investment-australia-025936526.html",
    "source": "au.news.yahoo.com",
    "description": "The Solomon Islands prime minister has made a concerted pitch for new trade and investment opportunities, as Australia looks to strengthen its security relationships in the Pacific.\n\nJeremiah Manele says Australia and the Solomon Islands need to partner at a moment of opportunity as well as challeng...",
    "category": "Economy",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  },
  {
    "id": 4198,
    "title": "Fiji and Solomon Islands Justice Ministers to boost regional cooperation",
    "url": "https://www.fbcnews.com.fj/news/fiji-and-solomon-islands-justice-ministers-to-boost-regional-cooperation/",
    "source": "www.fbcnews.com.fj",
    "description": "[Source: Fiji Government/Facebook]\n\nFiji’s Minister for Justice and Acting Attorney-General, Siromi Turaga, continued his official visit to Honiara with a series of meetings aimed at strengthening justice-sector cooperation between Fiji and the Solomon Islands.\n\nTuraga met with Solomon Islands Minis...",
    "category": "Economy",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  },
  {
    "id": 4194,
    "title": "PNG PM Marape Says Nomane’s Fiscal Claims Ignore Global Economic Reality",
    "url": "https://news.pngfacts.com/2025/11/png-pm-marape-says-nomanes-fiscal.html",
    "source": "news.pngfacts.com",
    "description": "PNG Prime Minister James Marape has countered criticism from Chuave MP James Nomane, arguing that the claims attacking the Government’s financial stewardship are misleading and politically motivated. Marape said the remarks disregard the severe global pressures that have shaped fiscal policy since 2...",
    "category": "Fiscal Policy",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  },
  {
    "id": 4190,
    "title": "SI economy to remain steady",
    "url": "https://www.solomonstarnews.com/si-economy-to-remain-steady/",
    "source": "www.solomonstarnews.com",
    "description": "THE Solomon Islands economy is projected to remain steady with a growth rate of 2.7 percent in 2026, driven by stronger performance across mining, fishing, agriculture, and business services.\n\nMinister of Finance and Treasury, Rexson Ramofafia, presented this outlook when tabling the 2026 Appropriat...",
    "category": "Inflation",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  },
  {
    "id": 4201,
    "title": "New Five-Year PACER Plus Support Agreed By Pacific Ministers",
    "url": "https://www.scoop.co.nz/stories/WO202511/S00258.htm",
    "source": "www.scoop.co.nz",
    "description": "New Five-Year PACER Plus Support Agreed By Pacific Ministers\n\nPacific trade ministers met in Honiara, Solomon Islands yesterday and agreed on a renewed push to strengthen trade, investment, and labour mobility across the region under the Pacific Agreement on Closer Economic Relations Plus or PACER P...",
    "category": "Trade Policy",
    "country": "Solomon Islands",
    "published_date": "2025-12-01"
  }
]