[
  {
    "id": 2820,
    "title": "Bitcoin ATMs appear in Nairobi malls as Kenya’s new crypto law faces early compliance test",
    "url": "https://coinjournal.net/news/bitcoin-atms-appear-in-nairobi-malls-as-kenyas-new-crypto-law-faces-early-compliance-test/",
    "source": "coinjournal.net",
    "description": "They appeared soon after the Virtual Assets Service Providers Act of 2025 took effect.\n\nCoinATMradar currently lists two Bitcoin ATMs in Kenya.\n\nThe Central Bank of Kenya and the Capital Markets Authority say no VASP is licensed yet.\n\nBitcoin ATMs have surfaced across major shopping malls in Nairobi...",
    "category": "Central Bank",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2823,
    "title": "Bitcoin News: Kenya Sees Bitcoin ATMs Appear Amidst New Crypto Law Rollout",
    "url": "https://www.livebitcoinnews.com/bitcoin-news-kenya-sees-bitcoin-atms-appear-amidst-new-crypto-law-rollout/",
    "source": "www.livebitcoinnews.com",
    "description": "Bitcoin ATMs appear in Nairobi malls days after Kenya’s new VASP law took effect, creating a stress test for regulators who have yet to issue licenses.\n\nKenya implemented its first comprehensive cryptocurrency law recently. Bitcoin ATMs have been seen in major shopping malls in Nairobi. This sudden ...",
    "category": "Central Bank",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2833,
    "title": "How infrastructure has shaped Kenya’s Economic Growth",
    "url": "https://thesharpdaily.com/how-infrastructure-has-shaped-kenyas-economic-growth/",
    "source": "thesharpdaily.com",
    "description": "Infrastructure is the backbone of any thriving economy, and Kenya’s development journey over the past two decades offers a powerful illustration of how roads, railways, energy networks, and digital systems can\n\nreshape national productivity. By comparing Kenya’s economy before and after key infrastr...",
    "category": "Economic Growth",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2834,
    "title": "World Bank reviews Kenya's economic growth upward but warns of pending disaster",
    "url": "https://www.the-star.co.ke/news/2025-11-24-world-bank-reviews-kenyas-economic-growth-upward",
    "source": "www.the-star.co.ke",
    "description": "High debt obligations and low revenue collection put Kenya's fiscal space at a crossroads, a move likely to further negatively impact the overall cost of living and doing business.\n\nThis is a verdict by the World Bank in its latest country focus, which was released on Monday in Nairobi.\n\nAccordi...",
    "category": "Economic Growth",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2839,
    "title": "AERC Kicks Off High-Level Summit on Africa’s Sustainable and Inclusive Economic Growth",
    "url": "https://www.capitalfm.co.ke/news/2025/11/aerc-kicks-off-high-level-summit-on-africas-sustainable-and-inclusive-economic-growth/",
    "source": "www.capitalfm.co.ke",
    "description": "NAIROBI, Kenya, Nov 30 — International and local economic policy leaders have convened for a three-day Research and Policy Summit hosted by the African Economic Research Consortium (AERC), aimed at exploring pathways for sustainable and inclusive growth across Africa.\n\nThe summit, held under the the...",
    "category": "Economic Growth",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2840,
    "title": "World Bank Raises Kenya’s Growth Forecast to 4.9% on Back of Construction Boom",
    "url": "https://www.kenyans.co.ke/news/118237-world-bank-raises-kenyas-growth-forecast-49-back-construction-boom",
    "source": "www.kenyans.co.ke",
    "description": "The World Bank has raised its projection for Kenya’s economic growth this year to 4.9 per cent, and President William Ruto’s administration is expected to maintain that rate of growth over the next two years.\n\nIn a report on Monday, the Bretton Woods Institution increased the forecast from 4.5 per c...",
    "category": "Economic Growth",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2841,
    "title": "Malaysia reaffirms commitment to closer economic ties with Kenya, says PM Anwar",
    "url": "https://www.thestar.com.my/news/nation/2025/11/24/malaysia-reaffirms-commitment-to-closer-economic-ties-with-kenya-says-pm-anwar",
    "source": "www.thestar.com.my",
    "description": "NAIROBI: With Kenya today standing as one of Africa’s most dynamic and forward-looking economies, Malaysia reaffirms its commitment to strengthening economic cooperation, creating new business partnerships, and unlocking opportunities, says Datuk Seri Anwar Ibrahim.\n\nThe Prime Minister said Kenya of...",
    "category": "Economic Growth",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2809,
    "title": "Kenya’s inflation slips to 4.5pc in November",
    "url": "https://www.capitalfm.co.ke/business/2025/11/kenyas-inflation-slips-to-4-5pc-in-november/",
    "source": "www.capitalfm.co.ke",
    "description": "NAIROBI, Kenya, Nov 28 – Kenya’s inflation eased marginally to 4.5 percent in November from 4.6 percent in October, remaining well within the Central Bank of Kenya’s target band of 2.5 to 7.5 percent.\n\nThe slight drop was supported by lower prices of key household items, according to new data from t...",
    "category": "Inflation",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2810,
    "title": "Inflation trends in Kenya",
    "url": "https://thesharpdaily.com/kenya-inflation-trends-2025/",
    "source": "thesharpdaily.com",
    "description": "Kenya has in recent months experienced a gradual uptick in inflation, a trend that presents a complex mix of pressures for households, businesses, and policymakers. In March 2025, the annual consumer price inflation reached 3.6 percent, up from 3.5 percent in February. (Kenya National Bureau of Stat...",
    "category": "Inflation",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2811,
    "title": "Kenya’s monetary policy outlook ahead of December 2025 MPC meeting",
    "url": "https://www.cnbcafrica.com/media/7764065655505/kenyas-monetary-policy-outlook-ahead-of-december-2025-mpc-meeting",
    "source": "www.cnbcafrica.com",
    "description": "As the calendar edges closer to December 9, 2025, when Kenya's Monetary Policy Committee (MPC) convenes for its final meeting of the year, market participants are on edge, meticulously analyzing potential outcomes. The Central Bank Rate (CBR) in Kenya currently stands at 9.25%, and potential decisio...",
    "category": "Monetary Policy",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2827,
    "title": "Kenya Moves to Assure Exporters After EACJ Suspends Kenya-EU Trade Deal",
    "url": "https://kahawatungu.com/kenya-moves-to-assure-exporters-after-eacj-suspends-kenya-eu-trade-deal/",
    "source": "kahawatungu.com",
    "description": "Kenya moved to reassure exporters and investors after the East Africa Court of Justice (EACJ) on 24 November 2025 suspended the implementation of the Kenya–European Union Economic Partnership Agreement (EPA).\n\nThe court issued the temporary orders pending the determination of a case filed by the Cen...",
    "category": "Trade Policy",
    "country": "Kenya",
    "published_date": "2025-11-01"
  },
  {
    "id": 2832,
    "title": "Kenya's Jude Chesire Elected Chairman of International Sugar Organization",
    "url": "https://www.kenyans.co.ke/news/118472-kenyas-jude-chesire-elected-chairman-international-sugar-organization",
    "source": "www.kenyans.co.ke",
    "description": "Kenya Sugar Board Chief Executive Officer Jude Chesire has been unanimously elected Chairman of the Council of the International Sugar Organization (ISO) for 2026 on Friday, November 26, 2025.\n\nHe becomes the first Kenyan and the first African ever to hold the position.\n\nISO, headquartered in London...",
    "category": "Trade Policy",
    "country": "Kenya",
    "published_date": "2025-11-01"
  }
]