[
  {
    "id": 576,
    "title": "EU disburses EUR 4 bn funding for economic growth in Greece, Portugal, Slovenia and Austria - EUbusiness.com",
    "url": "https://www.eubusiness.com/finance/eur-4-billion-eu-economic-growth-funding/",
    "source": "www.eubusiness.com",
    "description": "The European Commission has approved disbursement of EUR 4.1 billion to four Member States – Greece, Portugal, Slovenia and Austria – under the EU’s Recovery and Resilience Facility (RRF).\n\nGreece: €2.1 billion disbursement\n\nThe Commission will disburse €2.1 billion in grants to Greece, supporting c...",
    "category": "Economic Growth",
    "country": "Austria",
    "published_date": "2025-11-01"
  },
  {
    "id": 987,
    "title": "KuCoin Wins Austria’s MiCA License, Unlocking Access to EU",
    "url": "https://www.crypto-news-flash.com/kucoin-wins-austrias-mica-license/",
    "source": "www.crypto-news-flash.com",
    "description": "All news is rigorously fact-checked and reviewed by leading blockchain experts and seasoned industry insiders.\n\nKuCoin EU has received a MiCA authorization from Austria’s FMA.\n\nMiCA passporting enables KuCoin to expand its EU operations under a single unified framework.\n\nJust days after Kucoin got o...",
    "category": "Economic Growth",
    "country": "Austria",
    "published_date": "2025-11-01"
  },
  {
    "id": 557,
    "title": "Finland, France and Austria spend most on social benefits in the EU - EUbusiness.com",
    "url": "https://www.eubusiness.com/social/eu-spending-on-social-benefits-2024/",
    "source": "www.eubusiness.com",
    "description": "Total expenditure on social protection benefits in the EU reached €4,925 billion in 2024, according to early estimates, with Finland spending most as a percentage of GDP at 32.5 per cent of GDP.\n\nAccording to figures from the EU statistics agency Eurostat, total expenditure on social benefits in the...",
    "category": "GDP",
    "country": "Austria",
    "published_date": "2025-11-01"
  },
  {
    "id": 561,
    "title": "How Austria wants to curb inflation and cut electricity prices",
    "url": "https://www.thelocal.at/20251128/how-austria-wants-to-curb-inflation-and-cut-electricity-prices",
    "source": "www.thelocal.at",
    "description": "A €1 billion plan to reduce energy prices sits at the centre of Austria’s new economic package, alongside deregulation and health system changes. Will it be enough?\n\nAustria’s government has announced a new set of measures aimed at lowering energy costs, reducing bureaucracy, and stabilising public ...",
    "category": "Inflation",
    "country": "Austria",
    "published_date": "2025-11-01"
  },
  {
    "id": 970,
    "title": "Abandonment of Gazprom did not turn out to be cheap: Austria is looking for money for energy subsidies — EADaily, November 27th, 2025 — Politics, Russia",
    "url": "https://eadaily.com/en/news/2025/11/27/abandonment-of-gazprom-did-not-turn-out-to-be-cheap-austria-is-looking-for-money-for-energy-subsidies",
    "source": "eadaily.com",
    "description": "Austria will sell some shares in companies to subsidize electricity prices for the population. Vienna expects to raise 500 million euros. The rejection of Russian gas has become one of the reasons why the cost of electricity in the country is growing.\n\nThe Austrian government plans to spend approxim...",
    "category": "Inflation",
    "country": "Austria",
    "published_date": "2025-11-01"
  },
  {
    "id": 972,
    "title": "Today in Austria: A roundup of the latest news on Wednesday",
    "url": "https://www.thelocal.at/20251119/today-in-austria-a-roundup-of-the-latest-news-on-wednesday-209",
    "source": "www.thelocal.at",
    "description": "Austria plans new fraud-fighting measures aimed at wealthy property owners and tax evaders, while the national football team celebrates its first World Cup qualification since 1998 — and more news from across the country.\n\nGovernment unveils major anti-fraud package\n\nAustria’s coalition has agreed o...",
    "category": "Inflation",
    "country": "Austria",
    "published_date": "2025-11-01"
  },
  {
    "id": 563,
    "title": "Trump’s tariffs have hurt less than expected so far, says ECB’s Kocher",
    "url": "https://www.politico.eu/article/us-tariff-less-impact-than-expected-says-ecb-martin-kocher/",
    "source": "www.politico.eu",
    "description": "Kocher, who served as economy minister before joining the central bank in September, nonetheless warned against complacency. “I don’t want to sugarcoat what we are seeing,” he said. “This is the highest level of tariffs since the 1930s, and there will be effects on the world economy.”\n\nThe impact on...",
    "category": "Monetary Policy",
    "country": "Austria",
    "published_date": "2025-11-01"
  },
  {
    "id": 580,
    "title": "Austria Sees Record Surge in Immigrant Unemployment",
    "url": "https://europeanconservative.com/articles/news/austria-immigrant-unemployment-low-education-pressure-welfare-state/",
    "source": "europeanconservative.com",
    "description": "A member of the Austrian armed forces (Bundesheer) looks on as refugees cross the border at Spielfeld on January 4, 2016.\n\nUnemployment among migrants in Austria has reached a new record high. Their share of all unemployed people has risen from 34.2% to 43.2% in just six years. Syrians continue to t...",
    "category": "Unemployment",
    "country": "Austria",
    "published_date": "2025-11-01"
  },
  {
    "id": 989,
    "title": "Austria Unemployment Rate: 7.2% (October) vs 7%",
    "url": "https://www.fxstreet.com/news/austria-unemployment-rate-72-october-vs-7-202511030910",
    "source": "www.fxstreet.com",
    "description": "Gold remains on the front foot through the first half of the European session on Monday and currently trades near its highest level since October 21. Traders ramped up their bets for another interest rate cut by the US central bank in reaction to the recent dovish remarks by several Fed officials.",
    "category": "Unemployment",
    "country": "Austria",
    "published_date": "2025-11-01"
  }
]