[
  {
    "id": 3182,
    "title": "Foreign investors have sold off US $7B in Mexican government bonds this year",
    "url": "https://mexiconewsdaily.com/news/foreign-investors-mexican-government-bonds/",
    "source": "mexiconewsdaily.com",
    "description": "During the first ten months of 2025, foreign investors withdrew more than 130 billion pesos (US $7 billion) in bonds backed by the Mexican government, marking one of the largest outflows of foreign capital from government instruments in recent years.\n\nAccording to data from the Bank of Mexico (Banxi...",
    "category": "Central Bank",
    "country": "Mexico",
    "published_date": "2025-11-01"
  },
  {
    "id": 3185,
    "title": "September Jobs Report Won't Help Resolve Fed Divisions",
    "url": "https://www.morningstar.com/news/dow-jones/202511213791/september-jobs-report-wont-help-resolve-fed-divisions",
    "source": "www.morningstar.com",
    "description": "September Jobs Report Won't Help Resolve Fed Divisions By Vicky Ge Huang\n\nThe September jobs report, delayed nearly seven weeks by the government shutdown, leaves an already divided Federal Reserve with stale and somewhat inconclusive government data as the central bank heads into its next meeting i...",
    "category": "Central Bank",
    "country": "Mexico",
    "published_date": "2025-11-01"
  },
  {
    "id": 3164,
    "title": "GDP: As the US boycotts G20, what lies ahead for the international forum?",
    "url": "https://indianexpress.com/article/explained/explained-economics/gdp-us-boycotts-10378293/",
    "source": "indianexpress.com",
    "description": "The G20 summit is scheduled to start on Saturday (November 22) in Johannesburg. This is the last event before South Africa hands over the presidency of G20 to the United States. But here’s the rub: The US under President Donald Trump has refused to attend this summit because white Afrikaners were be...",
    "category": "GDP",
    "country": "Mexico",
    "published_date": "2025-11-01"
  },
  {
    "id": 3165,
    "title": "Bank of Mexico slashes 2025 economic growth forecast to 0.3%",
    "url": "https://mexiconewsdaily.com/business/mexico-economic-growth-forecast-2025/",
    "source": "mexiconewsdaily.com",
    "description": "The Bank of Mexico (Banxico) has cut its 2025 growth forecast for the Mexican economy from 0.6% to 0.3%, citing a third quarter contraction as the main reason for its revised prediction.\n\nThe central bank’s new forecast is included in its quarterly report for the July-September period. The bank’s fo...",
    "category": "GDP",
    "country": "Mexico",
    "published_date": "2025-11-01"
  },
  {
    "id": 3166,
    "title": "How Guadalajara embodies Mexico’s entrepreneurial spirit",
    "url": "https://mexiconewsdaily.com/culture/how-guadalajara-embodies-mexicos-entrepreneurial-spirit/",
    "source": "mexiconewsdaily.com",
    "description": "I was having a conversation the other day with a friend from the U.S., and as we shared stories from our families and social circles, we realized just how many people I know who have their own businesses, starting with my own family.\n\nIn my family, the vast majority of family members are entrepreneu...",
    "category": "GDP",
    "country": "Mexico",
    "published_date": "2025-11-01"
  },
  {
    "id": 3168,
    "title": "Mexico's inflation rate crept up to 3.61% in November",
    "url": "https://mexiconewsdaily.com/news/inflation-crept-up-november/",
    "source": "mexiconewsdaily.com",
    "description": "Inflation in Mexico is accelerating faster than expected, rising to 3.61% during the first two weeks of November compared to the same period last year, according to data released by the national statistics agency, INEGI, on Monday.\n\nWhile core inflation, which excludes volatile food and fuel prices,...",
    "category": "Inflation",
    "country": "Mexico",
    "published_date": "2025-11-01"
  },
  {
    "id": 3173,
    "title": "Transcript: The limits of monetary policy, with Agustín Carstens",
    "url": "https://www.ft.com/content/4f8bb847-8b28-44b6-afe3-4a6873ab7a01",
    "source": "www.ft.com",
    "description": "This is an audio transcript of The Economics Show podcast episode: ‘The limits of monetary policy, with Agustín Carstens’\n\nMartin Wolf\n\nMoney, it’s often said, is a form of trust. After all, it is the job of the central bank to guarantee that the money it issues maintain stable purchasing power. Tha...",
    "category": "Monetary Policy",
    "country": "Mexico",
    "published_date": "2025-11-01"
  }
]