[
  {
    "id": 4543,
    "title": "Central bank rejects ‘Big Mac’ claim in ‘The Economist’",
    "url": "https://www.taipeitimes.com/News/taiwan/archives/2025/11/16/2003847299",
    "source": "www.taipeitimes.com",
    "description": "Central bank rejects ‘Big Mac’ claim in ‘The Economist’\n\nStaff writer, with CNA\n\n\n\n\n\nThe central bank on Friday rejected an allegation by The Economist that it has kept the New Taiwan dollar undervalued to bolster exports and created “hidden risks” for the economy, saying the currency’s value is det...",
    "category": "Central Bank",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4544,
    "title": "Taiwan's Central Bank responds to cheap currency claims",
    "url": "https://www.taiwannews.com.tw/en/news/6245133",
    "source": "www.taiwannews.com.tw",
    "description": "TAIPEI (Taiwan News) — Taiwan's Central Bank responded on Friday to claims by The Economist that Taiwan keeps its currency too cheap on purpose and builds up financial risks.\n\nThe British journal reported Thursday that the Taiwan dollar is heavily undervalued and has driven the country’s trade surpl...",
    "category": "Central Bank",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4564,
    "title": "Correction to Currency Exchange International, Corp. Announcement of Renewal of Share Buyback Program and Automatic Securities Purchase Plan",
    "url": "https://www.taiwannews.com.tw/en/news/6253203",
    "source": "www.taiwannews.com.tw",
    "description": "TORONTO, Nov. 26, 2025 (GLOBE NEWSWIRE) -- Currency Exchange International, Corp. (“Currency Exchange” or the “Company”) (TSX:CXI) (OTCQX:CURN) announced today a correction to its news release issued earlier today entitled “Currency Exchange International, Corp. Announces Renewal of Share Buyback Pr...",
    "category": "Currency Exchange Rates",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4559,
    "title": "AI boom to drive Taiwan’s economic growth",
    "url": "https://www.taiwannews.com.tw/en/news/6243589",
    "source": "www.taiwannews.com.tw",
    "description": "TAIPEI (Taiwan News) — Taiwan’s AI surge is powering exports and investment, pushing economic growth close to 6% this year, the Directorate-General of Budget, Accounting, and Statistics said Thursday.\n\nDGBAS Minister Chen Shu-tzu (陳淑姿) told lawmakers that full-year GDP expansion is expected to reach...",
    "category": "Economic Growth",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4538,
    "title": "China escalates pressure on Japan over Taiwan remark; Familiar tactics hit tourism and trade",
    "url": "https://english.mathrubhumi.com/news/world/china-japan-taiwan-pressure-tourism-economy-dlroj1xr",
    "source": "english.mathrubhumi.com",
    "description": "China’s latest pressure campaign against Japan, triggered by Tokyo’s stance on Taiwan, is unfolding through a familiar set of economic and political tactics that could persist for months.\n\nBeijing: China has begun exerting pressure on Japan after Prime Minister Sanae Takaichi refused to retract comm...",
    "category": "Economy",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4535,
    "title": "Japan yen slips past 155 to US dollar as fiscal doubts, China spat sap investor confidence",
    "url": "https://www.scmp.com/economy/global-economy/article/3333268/japan-yen-slips-past-155-us-dollar-fiscal-doubts-china-spat-sap-investor-confidence",
    "source": "www.scmp.com",
    "description": "The Japanese yen slid to a nine-month low against the US dollar, breaching a closely watched threshold of 155 amid domestic policy uncertainties, fading expectations of a Federal Reserve rate cut in December, and amplified China-Japan tensions over Taiwan.\n\nThe yen’s exchange rate briefly weakened b...",
    "category": "Fiscal Policy",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4524,
    "title": "AI Boom Fuels Taiwan’s GDP Growth",
    "url": "https://www.deccanchronicle.com/world/ai-boom-fuels-taiwans-gdp-growth-1920220",
    "source": "www.deccanchronicle.com",
    "description": "Taipei: Taiwan raised its GDP growth forecast on Friday, announcing third quarter results that exceeded previous estimates, boosted by robust demand for artificial intelligence technology.\n\nThe island dominates the global manufacturing of semiconductor chips, which power AI.\n\nForeign firms like Nvid...",
    "category": "GDP",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4526,
    "title": "Premier says Taiwan's per capita GDP to reach US$40,000 target by 2026",
    "url": "https://www.taiwannews.com.tw/en/news/6253361",
    "source": "www.taiwannews.com.tw",
    "description": "TAIPEI (Taiwan News) — Taiwan's per capita GDP is expected to reach the US$40,000 (NT$1.25 million) target ahead of schedule in 2026, Premier Cho Jung-tai (卓榮泰) said on Wednesday.\n\nCho said that despite major disruptions, including US tariffs, typhoons, the Mataian River floods, and African swine fe...",
    "category": "GDP",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4532,
    "title": "Taiwan Pours $40 Billion Into Defense To Counter China Pressure",
    "url": "https://www.outlookindia.com/international/taiwan-pours-40-billion-into-defense-to-counter-china-pressure",
    "source": "www.outlookindia.com",
    "description": "The package, unveiled by Lai Ching-te, will fund substantial arms purchases — including air-defence systems, missiles and asymmetric-warfare capabilities — and aims to strengthen the island’s resilience against possible aggression. Photo: File photo\n\nThe package, unveiled by Lai Ching-te, will fund ...",
    "category": "GDP",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4533,
    "title": "Taiwan wages outpace inflation in seven-year record",
    "url": "https://www.taiwannews.com.tw/en/news/6240513",
    "source": "www.taiwannews.com.tw",
    "description": "TAIPEI (Taiwan News) — Taiwan wages outpaced inflation in the first nine months of the year, with real total pay up 1.87%, the sharpest increase in seven years, the Directorate-General of Budget, Accounting and Statistics said Monday.\n\nAverage monthly pay from January to September was NT$47,751 (US$...",
    "category": "Inflation",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4547,
    "title": "Taiwan nears super-aged society threshold as birth rate keeps falling",
    "url": "https://www.taiwannews.com.tw/news/6240434",
    "source": "www.taiwannews.com.tw",
    "description": "TAIPEI (Taiwan News) — Taiwan’s population has declined for 22 consecutive months as seniors edge toward 20% of all residents, which is the World Health Organization’s threshold for a super-aged society.\n\nThe Ministry of the Interior said Monday that residents ages 65 and older now account for 19.9%...",
    "category": "Interest Rates",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4553,
    "title": "US public support for Taiwan growing",
    "url": "https://www.taipeitimes.com/News/taiwan/archives/2025/11/20/2003847519",
    "source": "www.taipeitimes.com",
    "description": "US public support for Taiwan growing\n\nOPINION POLL: Seven in 10 Americans say trade between the US and Taiwan does more to strengthen US national security than it does to weaken it, the survey showed\n\nBy Jake Chung / Staff writer, with CNA\n\n\n\n\n\nA poll released by a Chicago-based think tank shows tha...",
    "category": "Trade Policy",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4560,
    "title": "Taiwan jobless rate falls to 3.36% in October",
    "url": "https://www.taiwannews.com.tw/en/news/6251542",
    "source": "www.taiwannews.com.tw",
    "description": "TAIPEI (Taiwan News) — Taiwan’s unemployment rate dropped to 3.36% in October, down 0.02% from September, according to the government's statistics bureau on Monday.\n\nIt was the lowest jobless rate for the month of October in 25 years. It also marked the second consecutive monthly decline, per CNA .\n...",
    "category": "Unemployment",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4561,
    "title": "Unemployment rate down to 3.36%",
    "url": "https://www.taipeitimes.com/News/biz/archives/2025/11/25/2003847762",
    "source": "www.taipeitimes.com",
    "description": "Unemployment rate down to 3.36%\n\nDATA: Youth joblessness was higher than the national average, at 11.81 percent for people aged 20 to 24, while university graduates had the highest rate at 4.55 percent\n\nBy Crystal Hsu / Staff reporter\n\n\n\n\n\nThe unemployment rate last month edged down to 3.36 percent,...",
    "category": "Unemployment",
    "country": "Taiwan",
    "published_date": "2025-11-01"
  }
]