[
  {
    "id": 4731,
    "title": "Orient Exchange Introduces \"Buy Back Guarantee\" for Travellers -- Protecting You from Forex Losses on Unused Currency",
    "url": "https://news.webindia123.com/news/articles/Business/20251202/4390053.html",
    "source": "news.webindia123.com",
    "description": "VMPL New Delhi [India], December 2: Orient Exchange, one of India's most trusted RBI-authorised foreign exchange providers, has launched a traveller-friendly Buy Back Guarantee offer, allowing customers to return unused foreign currency at the same rate they purchased it. This benefit shields travel...",
    "category": "Currency Exchange Rates",
    "country": "Turkey",
    "published_date": "2025-12-01"
  },
  {
    "id": 4716,
    "title": "Turkey Raises Minimum Wage by 30%, Boosting Rate Cut Chances",
    "url": "https://www.livemint.com/economy/turkey-raises-minimum-wage-by-30-boosting-rate-cut-chances-11735065753097.html",
    "source": "www.livemint.com",
    "description": "(Bloomberg) -- Turkey raised the minimum wage by 30% for 2025, providing a relief to investors looking for concrete steps to dial back populist policies and commit to curbing one of the world’s highest inflation rates.\n\nThe monthly minimum wage has been raised to 22,104 liras ($627) for 2025 from 17...",
    "category": "Economy",
    "country": "Turkey",
    "published_date": "2025-12-01"
  },
  {
    "id": 4719,
    "title": "Soaring inflation and a collapsing currency: Why is Turkey's economy in such a mess?",
    "url": "https://uk.sports.yahoo.com/news/everything-overheating-why-turkeys-economy-133247618.html",
    "source": "uk.sports.yahoo.com",
    "description": "Soaring inflation and a collapsing currency: Why is Turkey's economy in such a mess?\n\nTurkey’s economy is in tatters as runaway inflation and a collapsing lira are pushing millions of Turks to the brink of financial ruin and slamming factories, farmers and retailers across the country.\n\nMore than tw...",
    "category": "Economy",
    "country": "Turkey",
    "published_date": "2025-12-01"
  },
  {
    "id": 4720,
    "title": "Türkiye's economy expands 3.7% year-on-year in Q3",
    "url": "https://www.aa.com.tr/en/turkiye/turkiyes-economy-expands-37-year-on-year-in-q3/3758720",
    "source": "www.aa.com.tr",
    "description": "Necessary Cookies\n\nThis cookie is used to distinguish between humans and bots. This is beneficial for the web site, in order to make valid reports on the use of their web site.\n\nFunctional Cookies\n\nRemembers the user's selected language version of a website.\n\nPerformance/Analytical Cookies\n\nRegister...",
    "category": "Economy",
    "country": "Turkey",
    "published_date": "2025-12-01"
  },
  {
    "id": 4704,
    "title": "Recent strength has prompted us to raise our Turkish GDP forecast for 2025",
    "url": "https://think.ing.com/snaps/recent-strength-has-prompted-us-to-raise-turkish-gdp-forecast-2025/",
    "source": "think.ing.com",
    "description": "In the third quarter of 2025, GDP grew by 3.7% year-over-year – below the market consensus of 4.2%, but close to our forecast of 3.8%. This marks a deceleration compared to the previous quarter, which was 4.9% YoY after a revision by the TurkStat, along with the first quarter figure.\n\nGrowth was pri...",
    "category": "GDP",
    "country": "Turkey",
    "published_date": "2025-12-01"
  },
  {
    "id": 4710,
    "title": "Turkey's central bank plans tight monetary policy until inflation curbed",
    "url": "https://timesofindia.indiatimes.com/business/international-business/turkeys-central-bank-plans-tight-monetary-policy-until-inflation-curbed/articleshow/107404615.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "(Representative image: Reuters)\n\nANKARA: Turkey's newly-appointed central bank governor Fatih Karahan on Sunday said that his team is determined to maintain tight monetary policy until inflation falls to levels consistent with their target.Karahan replaced Hafize Gaye Erkan on Saturday, hours after ...",
    "category": "Inflation",
    "country": "Turkey",
    "published_date": "2025-12-01"
  },
  {
    "id": 4713,
    "title": "IMF urges Türkiye to maintain tight policy stance despite easing inflation",
    "url": "https://ilkha.com/english/economy/imf-urges-turkiye-to-maintain-tight-policy-stance-despite-easing-inflation-493076",
    "source": "ilkha.com",
    "description": "Türkiye's inflation is showing signs of easing, but sustained tightening of fiscal and monetary policies remains essential to secure lasting price stability, the International Monetary Fund (IMF) stated in its latest assessment.\n\nThe findings come from the Fund's staff report, issued following its A...",
    "category": "Monetary Policy",
    "country": "Turkey",
    "published_date": "2025-12-01"
  },
  {
    "id": 4729,
    "title": "Türkiye’s unemployment rate steady at 8.5% in Q3 2025",
    "url": "https://ilkha.com/english/economy/turkiye-s-unemployment-rate-steady-at-85-yuzde-in-q3-2025-492125",
    "source": "ilkha.com",
    "description": "Türkiye’s unemployment rate remained unchanged at 8.5 percent in the third quarter of 2025, according to official data released on Tuesday, masking significant movements beneath the surface of the labour market as employment shifted away from industry and into the services sector.\n\nThe latest figure...",
    "category": "Unemployment",
    "country": "Turkey",
    "published_date": "2025-12-01"
  },
  {
    "id": 4730,
    "title": "Türkiye’s unemployment rate dips to 8.5% as employment rises",
    "url": "https://ilkha.com/english/economy/turkiye-s-unemployment-rate-dips-to-85-yuzde-as-employment-rises-494252",
    "source": "ilkha.com",
    "description": "Türkiye’s seasonally adjusted unemployment rate fell slightly to 8.5% in October, down 0.1 percentage point from the previous month, the Turkish Statistical Institute (TÜİK) announced on Friday.\n\nThe number of unemployed persons aged 15 and over declined by 27,000 to 3.033 million. Despite the overa...",
    "category": "Unemployment",
    "country": "Turkey",
    "published_date": "2025-12-01"
  }
]