[
  {
    "id": 3712,
    "title": "Panama’s Economic Outlook Brightens: Removal from FATF Gray List Sets Stage for Growth",
    "url": "https://www.financialexpress.com/policy/economy-panamas-economic-outlook-brightens-removal-from-fatf-gray-list-sets-stage-for-growth-3304192/",
    "source": "www.financialexpress.com",
    "description": "By Sandeep Wasnik\n\nPanama, a Central American country is located between Colombia and Costa Rica and borders both the Caribbean Sea and the Pacific Ocean. It is the epicentre of the Western Hemisphere. Panama’s topography is incredibly varied, featuring more than 1,600 islands, mountains, rainforest...",
    "category": "Economic Growth",
    "country": "Panama",
    "published_date": "2025-12-01"
  },
  {
    "id": 3709,
    "title": "Countries must deepen cooperation on tax as digital economy expands, says FM Sitharaman",
    "url": "https://www.cnbctv18.com/economy/countries-must-deepen-cooperation-on-tax-as-digital-economy-expands-says-fm-sitharaman-19778735.htm",
    "source": "www.cnbctv18.com",
    "description": "Union Minister for Finance and Corporate Affairs Smt. @nsitharaman today met senior Finance and Economic Ministers from Andorra, Montenegro, Hungary, Kuwait, Cayman Islands, Slovak Republic, Panama and Zimbabwe, in presence of Union Minister for State for Finance Shri… pic.twitter.com/NQyRda3eA2\n\n...",
    "category": "Economy",
    "country": "Panama",
    "published_date": "2025-12-01"
  },
  {
    "id": 3711,
    "title": "US Prez’s interest in Greenland, Panama Canal driven by China concerns: Rubio",
    "url": "https://www.tribuneindia.com/news/world/us-prezs-interest-in-greenland-panama-canal-driven-by-china-concerns-rubio/",
    "source": "www.tribuneindia.com",
    "description": "US Secretary of State Marco Rubio has said that President Donald Trump’s desire to acquire Greenland and retake control of the Panama Canal was driven by legitimate national security interests, stemming from growing concerns about Chinese activity and influence in the Arctic and Latin America.\n\nAdve...",
    "category": "Interest Rates",
    "country": "Panama",
    "published_date": "2025-12-01"
  },
  {
    "id": 3714,
    "title": "US refuses to back down on Panama Canal claim: Rubio’s threats and Panama’s rejection",
    "url": "https://www.financialexpress.com/world-news/us-refuses-to-back-down-on-panama-canal-claim-rubios-threats-and-panamas-rejection/3735813/",
    "source": "www.financialexpress.com",
    "description": "Despite strong warnings from US officials, including Secretary of State Marco Rubio, Panama has remained resolute, rejecting any suggestions that it may relinquish control or face US intervention.\n\nPresident Donald Trump has refused to back down on threats related to the Panama Canal, a vital mariti...",
    "category": "Unemployment",
    "country": "Panama",
    "published_date": "2025-12-01"
  }
]