[
  {
    "id": 1396,
    "title": "News for Airlines, Airports and the Aviation Industry",
    "url": "https://centreforaviation.com/news/cabo-verde-airlines-confirms-introduction-of-three-atrs-1336338",
    "source": "centreforaviation.com",
    "description": "CAPA News Briefs CAPA publishes more than 1,000 global News Briefs every week, covering all aspects of the aviation and travel industry. It’s the most comprehensive source of market intelligence in the world, with around 50 per cent of content translated from non-English sources. The breadth of our ...",
    "category": "Economy",
    "country": "Cabo Verde",
    "published_date": "2025-12-01"
  },
  {
    "id": 1393,
    "title": "WHO certifies Cabo Verde as malaria-free; Read on to know more",
    "url": "https://www.financialexpress.com/business/healthcare-who-certifies-cabo-verde-as-malaria-free-read-on-to-know-more-3363154/",
    "source": "www.financialexpress.com",
    "description": "The World Health Organization (WHO) has certified Cabo Verde as a malaria-free country. With this announcement, Cabo Verde joins the ranks of 43 countries and 1 territory that WHO has awarded this certification.\n\nCabo Verde is the third country to be certified in the WHO African region, joining Maur...",
    "category": "Inflation",
    "country": "Cabo Verde",
    "published_date": "2025-12-01"
  },
  {
    "id": 1394,
    "title": "Good inflation news gives some relief — but the Fed’s flying blind from here",
    "url": "https://finance.yahoo.com/news/good-inflation-news-gives-some-relief--but-the-feds-flying-blind-from-here-100045928.html",
    "source": "finance.yahoo.com",
    "description": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:\n\nWhat we're watching\n\nWhat we're reading\n\nEconomic data releases and earnings\n\nInflation came in better than expected in September, a welcome downside surprise that gives policym...",
    "category": "Inflation",
    "country": "Cabo Verde",
    "published_date": "2025-12-01"
  },
  {
    "id": 1398,
    "title": "How low have HELOC interest rates dropped over the past year?",
    "url": "https://www.cbsnews.com/news/how-low-heloc-interest-rates-dropped-past-year-2024-2025/",
    "source": "www.cbsnews.com",
    "description": "We may receive commissions from some links to products on this page. Promotions are subject to availability and retailer terms.\n\nHELOC interest rates have been on a steady decline for much of the past year, approximately. sakchai vongsasiripat/Getty Images\n\nIf you're looking to borrow money, the int...",
    "category": "Interest Rates",
    "country": "Cabo Verde",
    "published_date": "2025-12-01"
  }
]