[
  {
    "id": 2958,
    "title": "Liberia: Agriculture Contributed 3.4 Percent to Liberia's Economic Growth in 2024",
    "url": "https://allafrica.com/stories/202511050297.html",
    "source": "allafrica.com",
    "description": "A recent report published by the World Bank says Liberia's economy grew by 4.0 percent in 2024 with the agricultural sector accounting for 3.4 percent, a notable improvement from 1.4 percent in 2023.\n\nThis overall growth was led by the rubber and rice sectors. According to the report, titled \"From S...",
    "category": "Economic Growth",
    "country": "Liberia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2948,
    "title": "Liberia: Justice Minister Tweh Accused of Blocking LRA Revenue Collection, Shielding LPRC From National Budget Obligations",
    "url": "https://frontpageafricaonline.com/news/liberia-justice-minister-tweh-accused-of-blocking-lra-revenue-collection-shielding-lprc-from-national-budget-obligations/",
    "source": "frontpageafricaonline.com",
    "description": "Monrovia – Allegations have surfaced that Liberia’s Justice Minister, Oswald Tweh, interfered with the Liberia Revenue Authority’s (LRA) efforts to collect lawful revenues from state-owned enterprises (SOEs), including the Liberia Petroleum Refining Company (LPRC), raising concerns over fiscal accou...",
    "category": "Fiscal Policy",
    "country": "Liberia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2949,
    "title": "Liberia: Executive Agencies to Face Lawmaker’s Wrath As US$ Budget Realization Faces Huge Challenge",
    "url": "https://frontpageafricaonline.com/news/liberia-executive-agencies-to-face-lawmakers-wrath-as-us-budget-realization-faces-huge-challenge/",
    "source": "frontpageafricaonline.com",
    "description": "Monrovia – A preliminary report on the Revenue Component of the Draft FY2026 National Budget by the Committee on Ways, Means and Finance (WMF) predicts a scary sign in achieving the proposed US$1.2 billion.\n\nBy Emmanuel Weedee-Conway\n\nThe committee has been convening hearings to examine the revenue ...",
    "category": "Fiscal Policy",
    "country": "Liberia",
    "published_date": "2025-11-01"
  }
]