[
  {
    "id": 5072,
    "title": "Zim Requires Staggering 6 Billion USD Reserves To Successfully Use ZiG As Official Currency – ZimEye",
    "url": "https://www.zimeye.net/2025/11/20/zim-requires-staggering-6-billion-usd-reserves-to-successfully-use-zig-as-official-currency/",
    "source": "www.zimeye.net",
    "description": "Zim Requires Staggering 6 Billion USD Reserves To Successfully Use ZiG As Official Currency\n\nSpread the love\n\nTinashe Sambiri – Zimbabwe faces a daunting challenge in transitioning to a mono-currency system by 2030, with experts suggesting the country will need up to US$6 billion in reserves.\n\nPersi...",
    "category": "Central Bank",
    "country": "Zimbabwe",
    "published_date": "2025-11-01"
  },
  {
    "id": 5074,
    "title": "ZRP urges patience as extradition of Ecobank heist brothers drags on",
    "url": "https://www.zimbabwesituation.com/news/zrp-urges-patience-as-extradition-of-ecobank-heist-brothers-drags-on/",
    "source": "www.zimbabwesituation.com",
    "description": "HARARE – Police investigators are “working flat out” to extradite the Vumbunu brothers, the alleged masterminds of Zimbabwe’s biggest cash heist, an official said on Wednesday.\n\nAuthorities have already secured the extradition of 39-year-old Bhekani Mlilo, one of the alleged robbers, from Botswana. ...",
    "category": "Central Bank",
    "country": "Zimbabwe",
    "published_date": "2025-11-01"
  },
  {
    "id": 5066,
    "title": "Dam-driven economy at centre of next agric plan",
    "url": "https://www.zimbabwesituation.com/news/dam-driven-economy-at-centre-of-next-agric-plan/",
    "source": "www.zimbabwesituation.com",
    "description": "Source: Dam-driven economy at centre of next agric plan – herald\n\nJudith Phiri\n\nZimpapers Business Hub\n\nThe Government has placed dam-driven economic growth at the heart of the Agriculture Food Systems and Rural Transformation Strategy 2, its agriculture growth and development blueprint for the next...",
    "category": "Economy",
    "country": "Zimbabwe",
    "published_date": "2025-11-01"
  },
  {
    "id": 5051,
    "title": "Ncube bets on stability, gold and diaspora inflows in 2026 budget",
    "url": "https://www.zimbabwesituation.com/news/ncube-bets-on-stability-gold-and-diaspora-inflows-in-2026-budget/",
    "source": "www.zimbabwesituation.com",
    "description": "Source: Ncube bets on stability, gold and diaspora inflows in 2026 budget – Zimbabwe News Now\n\nHARARE – Finance minister Mthuli Ncube on Thursday presented a ZiG290 billion (US$9.5 billion) 2026 national budget, touting fiscal discipline, falling inflation and mining-led growth as the pillars expect...",
    "category": "GDP",
    "country": "Zimbabwe",
    "published_date": "2025-11-01"
  },
  {
    "id": 5059,
    "title": "Goodbye US Dollar: RBZ vows to declare ZiG as Zimbabwe’s only currency",
    "url": "https://www.myzimbabwe.co.zw/news/184948-goodbye-us-dollar-rbz-vows-to-declare-zig-as-zimbabwes-only-currency.html",
    "source": "www.myzimbabwe.co.zw",
    "description": "Harare – The Reserve Bank of Zimbabwe (RBZ) is pressing ahead with its ambitious plan to make the Zimbabwe Gold (ZiG) the country’s only legal tender by 2030, a move that has ignited debate and raised eyebrows, particularly given Zimbabwe’s turbulent economic history and deep-seated challenges. Whil...",
    "category": "Monetary Policy",
    "country": "Zimbabwe",
    "published_date": "2025-11-01"
  }
]