[
  {
    "id": 1816,
    "title": "Czech central bank raises key rate again to tackle inflation",
    "url": "https://timesofindia.indiatimes.com/czech-central-bank-raises-key-rate-again-to-tackle-inflation/articleshow/92392006.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Prague, Jun 22 (AP) The Czech Republic's central bank raised its key interest rate significantly Wednesday as it tried to combat soaring inflation. The hike of a percentage point and a quarter brought the interest rate to 7.00%, the highest level since early 1999.It was the ninth straight increase s...",
    "category": "Central Bank",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1817,
    "title": "Czech Central Bank Dips Into Bitcoin With $1M ‘Test Portfolio’ – A Shift in Strategy?",
    "url": "https://finance.yahoo.com/news/czech-central-bank-dips-bitcoin-222012337.html",
    "source": "finance.yahoo.com",
    "description": "The Czech National Bank (CNB) has purchased Bitcoin and other digital assets worth $1 million, calling it a “test portfolio,” its first direct exposure to cryptocurrencies.\n\nThe move, announced on Thursday, marks a cautious step toward understanding how blockchain-based assets could fit into future ...",
    "category": "Central Bank",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1818,
    "title": "Czech Central Bank Becomes First Central Bank to Buy Bitcoin",
    "url": "https://finance.yahoo.com/news/czech-central-bank-becomes-first-130501806.html?fr=sycsrp_catchall",
    "source": "finance.yahoo.com",
    "description": "It's another milestone for Bitcoin (BTC), which apparently for the first time has arrived on a central bank balance sheet.\n\nThe Czech National Bank (CNB) on Thursday announced the creation of a $1 million test portfolio that includes bitcoin, a USD stablecoin, and a tokenized deposit.\n\nApproved by t...",
    "category": "Central Bank",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1819,
    "title": "Czech Republic Buys Bitcoin, But Not For a Reserve",
    "url": "https://beincrypto.com/czech-republic-bitcoin-purchase/",
    "source": "beincrypto.com",
    "description": "The Czech National Bank (CNB) has entered the digital asset market for the first time on Thursday, allocating $1 million to build a blockchain-based pilot portfolio. This acquisition was conducted separately from the bank’s official international reserves.\n\nThe CNB emphasized that it has no intentio...",
    "category": "Central Bank",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1824,
    "title": "Czech Republic: Are arms, not cars, the new economic engine?",
    "url": "https://timesofindia.indiatimes.com/world/europe/czech-republic-are-arms-not-cars-the-new-economic-engine/articleshow/121288596.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Arms as new economic engine?\n\nGrowth factor Ukraine war\n\n\n\n\n\nThe Czech Republic has become the country with the highest per capita production of cars in the world over the last thirty years. 2024 was a record year with more than 1.4 million manufactured vehicles in the country of 10 million inhabi...",
    "category": "Economic Growth",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1825,
    "title": "Czech car production falls 4.1% in 2021, return to growth possible in 2022",
    "url": "https://auto.economictimes.indiatimes.com/news/industry/czech-car-production-falls-4-1-in-2021-return-to-growth-possible-in-2022/88978747",
    "source": "auto.economictimes.indiatimes.com",
    "description": "Registrations of new passenger cars in the EU slid by 2.4 percent in 2021, to 9.7 million vehicles, the worst performance since statistics began in 1990, according to data from the European Automobile Manufacturers Association (ACEA).",
    "category": "Economic Growth",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1809,
    "title": "Czech election winner Babis says his party will sign coalition agreement on Nov 3",
    "url": "https://uk.news.yahoo.com/czech-election-winner-babis-says-082012374.html",
    "source": "uk.news.yahoo.com",
    "description": "(Reuters) -Czech election winner Andrej Babis said on Wednesday that his ANO party will sign a coalition agreement with the eurosceptic Motorists party and the far-right, anti-European Union and anti-NATO SPD party on November 3.\n\n\"We have an agreed coalition agreement. We agreed to sign it on Monda...",
    "category": "Fiscal Policy",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1810,
    "title": "Incoming Czech government signals reversal on EU climate and migration policies",
    "url": "https://www.euractiv.com/news/incoming-czech-government-signals-reversal-on-eu-climate-and-migration-policies/",
    "source": "www.euractiv.com",
    "description": "PRAGUE – Czechia is set to be governed by a three-party coalition of populist ANO, right-wing Motorists and far-right SPD – a line-up that, in EU shorthand, brings together members of the Patriots and European Sovereignists networks.\n\nLed by former Prime Minister Andrej Babiš, whose ANO party won la...",
    "category": "Fiscal Policy",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1811,
    "title": "Czech president tasks billionaire ex-premier with forming new government",
    "url": "https://www.euractiv.com/news/czech-president-tasks-billionaire-ex-premier-with-forming-new-government/",
    "source": "www.euractiv.com",
    "description": "The Czech president on Monday tasked billionaire ex-premier Andrej Babis, whose party won a parliamentary election earlier this month, to lead talks to form the country’s next government.\n\nThe ANO party of self-described “Trumpist” Babis topped the October 3-4 poll, gaining 34.5% of the vote and 80 ...",
    "category": "Fiscal Policy",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1800,
    "title": "Czech government OKs bill for 2 per cent GDP spending on military",
    "url": "https://timesofindia.indiatimes.com/czech-government-oks-bill-for-2-per-cent-gdp-spending-on-military/articleshow/96743466.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Prague, Jan 4 (AP) The Czech government on Wednesday approved a bill aimed at bringing defense spending at the required NATO goal of 2 per cent of gross domestic product as Russia's war in Ukraine continues. Defence Minister Jana Cernochova said the move would \"ensure a stable and transparent financ...",
    "category": "GDP",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1801,
    "title": "Czech 2026 budget stalled as incoming government rejects draft plan",
    "url": "https://news.az/news/czech-2026-budget-stalled-as-incoming-government-rejects-draft-plan",
    "source": "news.az",
    "description": "+ ↺ − 16 px\n\nThe likely next Czech government rejected the outgoing administration’s draft 2026 budget on Monday, raising the possibility of a delayed approval and a higher-than-expected deficit.\n\nCzech billionaire Andrej Babis’ populist ANO party, which won October’s election and is leading coaliti...",
    "category": "GDP",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1802,
    "title": "Reducing inflation the Czech way",
    "url": "https://www.financialexpress.com/opinion/reducing-inflation-the-czech-way/3543972/",
    "source": "www.financialexpress.com",
    "description": "By Amol Agrawal,\n\nIn the world of central banking and monetary policy, attention is usually on the central banks of developed countries. However, sometimes the best stories on the conduct of central banking come from small open economies. Examples include the Reserve Bank of New Zealand pioneering i...",
    "category": "Inflation",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1803,
    "title": "Inflation protests across Europe threaten political turmoil",
    "url": "https://www.tribuneindia.com/news/world/inflation-protests-across-europe-threaten-political-turmoil-443750",
    "source": "www.tribuneindia.com",
    "description": "London, October 22\n\nAdvertisement\n\nIn Romania, protesters blew horns and banged drums to voice their dismay over the rising cost of living. People across France took to the streets to demand pay increases that keep pace with inflation.\n\nAdvertisement\n\nCzech demonstrators rallied against government h...",
    "category": "Inflation",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1805,
    "title": "CEE MARKETS 2-Currencies weaker, Czech crown drops after inflation data",
    "url": "https://www.zawya.com/en/business/cee-markets-2-currencies-weaker-czech-crown-drops-after-inflation-data-c0pexs2r",
    "source": "www.zawya.com",
    "description": "(Adds Hungary cbank, updates prices) * Czech CPI fell more than expected, intervention fears loom * Hungarian cbank minutes show room for further rate cuts BUDAPEST/BUCHAREST, Oct 9 (Reuters) - The Czech crown led losses among emerging European currencies on Wednesday after lower-than-expected infla...",
    "category": "Inflation",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1820,
    "title": "Zomato's Czech Subsidiary Initiates Liquidation",
    "url": "https://www.indiainfoline.com/news/markets/zomatos-czech-subsidiary-initiates-liquidation",
    "source": "www.indiainfoline.com",
    "description": "Zomato’s stock gained nearly 1% during morning trade on September 4 following an announcement about its step-down subsidiary’s liquidation. The food aggregator revealed on September 1 that its subsidiary in the Czech Republic, Lunchtime.Cz, had initiated the liquidation process.\n\nZomato clarified th...",
    "category": "Trade Policy",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  },
  {
    "id": 1822,
    "title": "Barentz buys specialty ingredients distributor ACE Trade in Czech Republic",
    "url": "https://www.pharmabiz.com/NewsDetails.aspx?aid=151740&sid=2",
    "source": "www.pharmabiz.com",
    "description": "Barentz International, a leading global life science ingredients distributor, acquired ACE Trade CZ, a distributor of specialty ingredients for the personal care, homecare and industrial markets. The company has over 24 years of experience in the specialty ingredients sector and is well known for th...",
    "category": "Trade Policy",
    "country": "Czech Republic",
    "published_date": "2025-12-01"
  }
]