[
  {
    "id": 2967,
    "title": "Libya’s powerful central bank governor is fired as country's deep divisions persist",
    "url": "https://www.livemint.com/news/libyas-powerful-central-bank-governor-is-fired-as-country-s-deep-divisions-persist-11724093308302.html",
    "source": "www.livemint.com",
    "description": "CAIRO (AP) — One of Libya's dueling authorities unilaterally fired the country's powerful central bank governor in an abrupt move that is likely to inflame tensions in the divided North African country.\n\nThe presidential council in the capital of Tripoli, which is allied with the government of Prime...",
    "category": "Central Bank",
    "country": "Libya",
    "published_date": "2025-12-01"
  },
  {
    "id": 2971,
    "title": "Washington welcomes signing of unified development program agreement",
    "url": "https://libyaobserver.ly/news/washington-welcomes-signing-unified-development-program-agreement",
    "source": "libyaobserver.ly",
    "description": "The United States welcomed the announcement of the signing of the Unified Development Program agreement between the House of Representatives (HoR) and the High Council of State (HCS) at the Central Bank of Libya (CBL) headquarters in Tripoli on Tuesday, highlighting the benefits that will result fro...",
    "category": "Central Bank",
    "country": "Libya",
    "published_date": "2025-12-01"
  },
  {
    "id": 2972,
    "title": "Istanbul Police busts money-laundering banking network linked to Libya, Russia, and Central Asia",
    "url": "https://libyaobserver.ly/news/istanbul-police-busts-money-laundering-banking-network-linked-libya-russia-and-central-asia",
    "source": "libyaobserver.ly",
    "description": "Turkish police has dismantled a large underground banking network involving unlicensed companies engaged in money-laundering activities worth more than one billion dollars, with ties to networks in Libya, North Africa, Russia, and Central Asia.\n\nAccording to Türkiye Today newspaper on Saturday, Ista...",
    "category": "Central Bank",
    "country": "Libya",
    "published_date": "2025-12-01"
  },
  {
    "id": 2974,
    "title": "Libya Energy & Economic Summit (LEES) 2026 to Spotlight United States (U.S.) Corporate Engagement as American Firms Recommit to Libya’s Energy Future",
    "url": "https://www.zawya.com/en/press-release/africa-press-releases/libya-energy-economic-summit-lees-2026-to-spotlight-united-states-us-corporate-engagement-as-american-firms-dpn2o3t4",
    "source": "www.zawya.com",
    "description": "The Libya Energy&Economic Summit (LEES) 2026, taking place on January 24-26 in Tripoli, will showcase a renewed surge of U.S. participation as American companies re-engage with Libya’s oil, gas and infrastructure sectors. This year marks a significant moment for U.S. investment momentum, reinforced ...",
    "category": "Economic Growth",
    "country": "Libya",
    "published_date": "2025-12-01"
  },
  {
    "id": 2964,
    "title": "Oil majors return to Libya as Tripoli launches first exploration auction in 18 years",
    "url": "https://www.ft.com/content/0ce8d859-50c4-49a0-920e-f9691a3a145e",
    "source": "www.ft.com",
    "description": "Try unlimited access Only Rs100 for 4 weeks\n\nThen Rs4335 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial.",
    "category": "Economy",
    "country": "Libya",
    "published_date": "2025-12-01"
  },
  {
    "id": 2965,
    "title": "Inside the $20 Billion Black Market Keeping Libya From Civil War",
    "url": "https://oilprice.com/Energy/Energy-General/Inside-the-20-Billion-Black-Market-Keeping-Libya-From-Civil-War.html",
    "source": "oilprice.com",
    "description": "The eastern apparatus around General Khalifa Haftar has expanded its role, particularly through the desert corridors feeding southern markets and the coastal routes near Tobruk and Hariga. Western groups around Zawiya and Zuwara continue to dominate short-haul refined-product runs into the central M...",
    "category": "Economy",
    "country": "Libya",
    "published_date": "2025-12-01"
  },
  {
    "id": 2962,
    "title": "Libya’s cash crisis: Not yet a bank run but no solutions soon",
    "url": "https://www.newarab.com/news/libyas-cash-crisis-not-yet-bank-run-no-solutions-soon",
    "source": "www.newarab.com",
    "description": "In scenes that have become routine across Libya, 70-year-old Mohammed Al-Taib spent more than seven hours outside Jumhouria Bank’s University of Tripoli branch hoping to withdraw 2,000 dinars (363 dollars). When he finally reached the counter, he was told the bank had cut the limit to just 1,000 din...",
    "category": "Monetary Policy",
    "country": "Libya",
    "published_date": "2025-12-01"
  },
  {
    "id": 2975,
    "title": "Closely following situation of Indian workers in Libya: MEA",
    "url": "https://timesofindia.indiatimes.com/india/closely-following-situation-of-indian-workers-in-libya-mea/articleshow/116512960.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "NEW DELHI: The Indian Embassy in Tripoli is \"closely following\" the situation of a batch of Indian workers in Libya who had travelled to that country without proper documents, and working to facilitate their return, the Ministry of External Affairs said on Friday. MEA Spokesperson Randhir Jaiswal to...",
    "category": "Unemployment",
    "country": "Libya",
    "published_date": "2025-12-01"
  }
]