[
  {
    "id": 3807,
    "title": "Philippines growth likely to be below government target this year, senior official says",
    "url": "https://www.bworldonline.com/breaking-news/2025/12/01/715623/philippines-growth-likely-to-be-below-government-target-this-year-senior-official-says/",
    "source": "www.bworldonline.com",
    "description": "MANILA – The Philippines is very unlikely to meet even the lower end of its target range for growth this year, Economic Planning Secretary Arsenio Balisacan said on Monday.\n\nThe government has a growth target of 5.5% to 6.5% this year. Gross domestic product grew 4.0% in the third quarter from a yea...",
    "category": "Economic Growth",
    "country": "Philippines",
    "published_date": "2025-12-01"
  },
  {
    "id": 3776,
    "title": "Philippines’ annual inflation at 1.7% in October",
    "url": "https://www.businesstimes.com.sg/international/asean/philippines-annual-inflation-1-7-october",
    "source": "www.businesstimes.com.sg",
    "description": "Philippines' annual inflation was below the 1.8 per cent median forecast in a Reuters poll, and brought the year-to-date average inflation to 1.7 per cent, below the central bank’s 2.0 per cent to 4.0 per cent target for the year. PHOTO: AFP\n\n[MANILA] Philippines’ annual inflation stood at 1.7 per c...",
    "category": "Inflation",
    "country": "Philippines",
    "published_date": "2025-12-01"
  },
  {
    "id": 3796,
    "title": "DOE targets new low-interest financing to accelerate SPUG hybridization",
    "url": "https://powerphilippines.com/doe-targets-new-low-interest-financing-to-accelerate-spug-hybridization/",
    "source": "powerphilippines.com",
    "description": "The Department of Energy (DOE) is developing new low-interest financing models aimed at enabling renewable energy (RE) developers to hybridize off-grid areas served by the Small Power Utilities Group (SPUG), a move seen to ease the high cost of power generation in isolated communities.\n\nThe initiati...",
    "category": "Interest Rates",
    "country": "Philippines",
    "published_date": "2025-12-01"
  },
  {
    "id": 3797,
    "title": "India, Philippines start talks for bilateral trade pact",
    "url": "https://www.financialexpress.com/policy/economy-india-philippines-start-talks-for-bilateral-trade-pact-3937281/",
    "source": "www.financialexpress.com",
    "description": "India and Philippines on Tuesday exchanged the terms of reference of a Preferential Trade Agreement (PTA) that will build on the liberal terms already offered by Asean-India Trade in Goods Agreement (AITIGA) for bilateral trade.\n\nThe Philippines as a member of the Association of Southeast Asian Nati...",
    "category": "Trade Policy",
    "country": "Philippines",
    "published_date": "2025-12-01"
  },
  {
    "id": 3802,
    "title": "Vietnam, Philippines boost strategic defence partnership",
    "url": "https://asianews.network/vietnam-philippines-boost-strategic-defence-partnership/",
    "source": "asianews.network",
    "description": "November 27, 2025\n\nHANOI – Minister of National Defence General Phan Văn Giang has called on the defence ministries of Việt Nam and the Philippines to strengthen delegation exchanges at all levels, particularly high-level visits, and to enhance the effectiveness of cooperation mechanisms, especially...",
    "category": "Trade Policy",
    "country": "Philippines",
    "published_date": "2025-12-01"
  }
]