[
  {
    "id": 3481,
    "title": "CBN Orders Banks To Pull Down Misleading Promotions",
    "url": "https://www.naijanews.com/2025/11/28/cbn-orders-banks-to-pull-down-misleading-promotions/",
    "source": "www.naijanews.com",
    "description": "The Central Bank of Nigeria (CBN) has directed all licensed banks, payment service banks and other regulated financial institutions to withdraw any ongoing advertisement or promotional material that breaches transparency and consumer-protection standards.\n\nNaija News reports that the directive, issu...",
    "category": "Central Bank",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3487,
    "title": "CBN Identifies ‘Fake’ Bank Operating In Four States, Warns Nigerians Against Transactions With The MFB",
    "url": "https://www.naijanews.com/2025/11/21/cbn-identifies-fake-bank-operating-in-four-states-warns-nigerians-against-transactions-with-the-mfb/",
    "source": "www.naijanews.com",
    "description": "The Central Bank of Nigeria (CBN) has warned Nigerians to desist from engaging in any financial dealings with a Microfinance Bank (MFB) whose name is identified as Zuldal Microfinance Bank Limited.\n\nThe apex bank declared that the entity is neither licensed nor authorised to operate as a microfinanc...",
    "category": "Central Bank",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3488,
    "title": "How AMCON Ex-Boss Ahmed Kuru Appointed Receiver For Arik Before Seeking Central Bank Approval",
    "url": "https://saharareporters.com/2025/11/29/how-amcon-ex-boss-ahmed-kuru-appointed-receiver-arik-seeking-central-bank-approval",
    "source": "saharareporters.com",
    "description": "More shocking details have emerged once again at the continuation of the criminal trial of former Managing Director of the Assets Management Corporation of Nigeria (AMCON), Ahmed Kuru, Receiver Manager Kamilu Omokide, and others.\n\nThis is as new facts from the EFCC investigator’s testimony painted a...",
    "category": "Central Bank",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3508,
    "title": "Naira to Dollar rate today, Friday, November 28, as naira records slight recovery",
    "url": "https://www.gistreel.com/naira-to-dollar-rate-today-friday-november-28-as-naira-records-slight-recovery/",
    "source": "www.gistreel.com",
    "description": "The Nigerian naira exchange rate against the US dollar continued its slight recovery on Friday, 28 November 2025, as both official and parallel markets reacted to recent improvements in liquidity.\n\nTraders observed calmer movement compared with earlier sessions, with the local currency showing mild ...",
    "category": "Currency Exchange Rates",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3510,
    "title": "Tax restructuring, exchange rate unification not abstract policies",
    "url": "https://businessday.ng/news/article/tax-restructuring-exchange-rate-unification-not-abstract-policies-oborevwori/",
    "source": "businessday.ng",
    "description": "…Calls for fairness, transparency and responsible media engagement\n\nGovernor Sheriff Oborevwori of Delta State has explained reasons why there should be fairness, transparency and responsible media engagement as Nigeria navigates key economic transitions, particularly tax restructuring and exchange ...",
    "category": "Currency Exchange Rates",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3496,
    "title": "Parthian Economic Discourse: Rewane projects market cap to hit N262trn in 2026",
    "url": "https://businessday.ng/news/article/parthian-economic-discourse-rewane-projects-market-cap-to-hit-n262trn-in-2026/",
    "source": "businessday.ng",
    "description": "Bismarck Rewane, a leading Nigerian economist and CEO of Financial Derivatives Company\n\n…As Oyedele assures tax relief for 98% of Nigerians\n\nThe 2025 Parthian Economic Discourse (PED25), convened on Thursday by Parthian Partners, brought together Nigeria’s leading economic minds to chart the path fr...",
    "category": "Economic Growth",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3497,
    "title": "NSITF highlights Nigeria’s role in leveraging digital trade for economic growth",
    "url": "https://guardian.ng/news/nsitf-highlights-nigerias-role-in-leveraging-digital-trade-for-economic-growth-2/",
    "source": "guardian.ng",
    "description": "Deputy General Manager, Nigeria Social Insurance Trust Fund (NSITF), Agege Branch, Erebi Kia (left); Regional Manager, Lagos Mainland Region, NSITF, Agboma Okoroafor; Executive Director/Chief Executive Officer, Lagos International Trade Fair Complex Management Board, Erelu Ndanusa; Deputy General Ma...",
    "category": "Economic Growth",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3498,
    "title": "Mining sector can boost Nigeria’s economic growth, says Malami",
    "url": "https://guardian.ng/news/mining-sector-can-boost-nigerias-economic-growth-says-malami/",
    "source": "guardian.ng",
    "description": "The Chairman of the Ore Reserves Development Forum (ORDF), Uba Saidu Malami, on Monday, reaffirmed that Nigeria’s mining sector holds immense potential to contribute significantly to the nation’s economic growth, if crucial gaps in project financing and geological data transparency are addressed.\n\nI...",
    "category": "Economic Growth",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3470,
    "title": "AfDB approves $500m facility to strengthen Nigeria’s fiscal reforms, climate agenda",
    "url": "https://hallmarknews.com/afdb-approves-500m-facility-to-strengthen-nigerias-fiscal-reforms-climate-agenda/",
    "source": "hallmarknews.com",
    "description": "The African Development Bank Group has approved a $500 million loan to the Federal Government of Nigeria to advance sweeping economic governance reforms and accelerate the country’s energy transition efforts.\n\nThe pan African lender had earlier in October announced announced that it will lend Nigeri...",
    "category": "Fiscal Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3474,
    "title": "Nigerian govt says virtual currency to be taxed under new fiscal policy",
    "url": "https://www.ripplesnigeria.com/nigerian-govt-says-virtual-currency-to-be-taxed-under-new-fiscal-policy/",
    "source": "www.ripplesnigeria.com",
    "description": "The Presidential Fiscal Policy and Tax Reforms Committee has announced that virtual currencies will be subject to taxation under Nigeria’s new tax reform framework.\n\nCommittee Chairman, Taiwo Oyedele, disclosed this during an online public lecture hosted by the Capital Market Academics of Nigeria on...",
    "category": "Fiscal Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3475,
    "title": "Nigeria Moves To Tax Virtual Currencies As Fiscal Reforms Take Shape – The News Chronicle",
    "url": "https://thenews-chronicle.com/nigeria-moves-to-tax-virtual-currencies-as-fiscal-reforms-take-shape/",
    "source": "thenews-chronicle.com",
    "description": "Nigeria’s Federal Government has officially included virtual currencies in its new tax framework, marking a major shift in how digital assets such as cryptocurrencies will be treated under the country’s fiscal laws.\n\nThe announcement was made by the Chairman of the Presidential Fiscal Policy and Tax...",
    "category": "Fiscal Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3476,
    "title": "Tinubu Appoints Members Of National Tax Policy Implementation Committee",
    "url": "https://www.naijanews.com/2025/11/28/tinubu-appoints-members-of-national-tax-policy-implementation-committee/",
    "source": "www.naijanews.com",
    "description": "President Bola Tinubu has established a National Tax Policy Implementation Committee (NTPIC) to oversee the smooth rollout of Nigeria’s new tax reforms.\n\nNaija News reports that the NTPIC is chaired by Joseph Tegbe and would be overseen by the Minister of Finance and Coordinating Minister of the Eco...",
    "category": "Fiscal Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3457,
    "title": "Nigeria’s Inflation Drops to 16.05 Percent After Seven Months of Steady Decline",
    "url": "https://olorisupergal.com/nigeria-inflation-drops-to-16-percent/",
    "source": "olorisupergal.com",
    "description": "Nigeria’s inflation rate recorded another major drop in October, easing to 16.05 percent, according to the latest figures released by the National Bureau of Statistics. This marks the seventh consecutive month of decline, offering a bit of breathing room to Nigerians who have been dealing with high ...",
    "category": "Inflation",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3460,
    "title": "CBN Governor Says Inflation Is Falling, FX Market Stabilising In Nigeria",
    "url": "https://www.naijanews.com/2025/11/29/cbn-governor-says-inflation-is-falling-fx-market-stabilising-in-nigeria/",
    "source": "www.naijanews.com",
    "description": "Nigeria’s economic climate is showing clear signs of recovery, according to the Governor of the Central Bank of Nigeria, Olayemi Cardoso, who says the country has entered a more stable phase following two years of sweeping monetary reforms.\n\nCardoso addressed bankers and financial leaders in Lagos d...",
    "category": "Inflation",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3461,
    "title": "Inflation falls to 16% as Nigeria records seventh straight month of decline – NBS",
    "url": "https://hallmarknews.com/inflation-falls-to-16-as-nigeria-records-seventh-straight-month-of-decline-nbs/",
    "source": "hallmarknews.com",
    "description": "Nigeria’s inflation rate has continued its steady downward slide, dropping to 16.05 percent in October 2025, the National Bureau of Statistics (NBS) said in its Consumer Price Index (CPI) report released on Monday.\n\nThe figure marks a dramatic year-on-year decline of 17.82 percentage points from the...",
    "category": "Inflation",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3489,
    "title": "Experts: Only lower interest rates can make Nigerians feel impact of reforms",
    "url": "https://businessday.ng/news/article/experts-only-lower-interest-rates-can-make-nigerians-feel-impact-of-reforms/",
    "source": "businessday.ng",
    "description": "… As CFG Africa holds client engagement forum\n\nExperts have called on the Central Bank of Nigeria (CBN) to further reduce interest rates, arguing that such a move would help lift Nigeria’s economy out of its current slowdown, ease pressure on households and businesses, and support job creation.\n\nWhi...",
    "category": "Interest Rates",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3490,
    "title": "Nigeria’s Reserves Surge To $46.7bn As FX Inflows Hit Six-Month Peak – The News Chronicle",
    "url": "https://thenews-chronicle.com/nigerias-reserves-surge-to-46-7bn-as-fx-inflows-hit-six-month-peak/",
    "source": "thenews-chronicle.com",
    "description": "Nigeria’s foreign exchange reserves have climbed to one of their strongest levels in years, reaching 46.7 billion dollars following a wave of renewed investor interest and proceeds from the recent Eurobond issuance.\n\nThis comes as the naira maintained a largely steady position across the official an...",
    "category": "Interest Rates",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3491,
    "title": "CBN retains interest rate at 27%",
    "url": "https://www.thecable.ng/breaking-cbn-retains-interest-rate-at-27/",
    "source": "www.thecable.ng",
    "description": "The monetary policy committee (MPC) of the Central Bank of Nigeria (CBN) has retained the country’s monetary policy rate (MPR) at 27 percent.\n\nOlayemi Cardoso, CBN’s governor, announced at a news conference on Tuesday during the committee’s 303rd meeting in Abuja.\n\nThe MPR serves as the baseline int...",
    "category": "Interest Rates",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3492,
    "title": "CBN to cut benchmark interest rate in boost to businesses",
    "url": "https://thenationonlineng.net/cbn-to-cut-benchmark-interest-rate-in-boost-to-businesses/",
    "source": "thenationonlineng.net",
    "description": "CBN to cut benchmark interest rate in boost to businesses\n\nThe Central Bank of Nigeria (CBN) is expected to cut the benchmark interest rate by at least 50 basis points, in continuation of the apex bank’s cautious monetary easing stance.\n\nWith a stable naira and rising foreign exchange (forex) reserv...",
    "category": "Interest Rates",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3493,
    "title": "Cut interest rates to boost production, manufacturers tell CBN",
    "url": "https://punchng.com/cut-interest-rates-to-boost-production-manufacturers-tell-cbn/",
    "source": "punchng.com",
    "description": "The Manufacturers Association of Nigeria has called on the Central Bank of Nigeria to further reduce interest rates, warning that the high cost of borrowing continues to hinder production and weaken competitiveness in the real sector.\n\nMAN made the appeal in its reaction to the outcome of the Moneta...",
    "category": "Interest Rates",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3462,
    "title": "CBN Retains Monetary Policy Rate at 27%",
    "url": "https://www.tvcnews.tv/cbn-retains-monetary-policy-rate-at-27/",
    "source": "www.tvcnews.tv",
    "description": "The Central Bank of Nigeria (CBN) has decided to keep the country’s Monetary Policy Rate (MPR) unchanged at 27 per cent, the CBN Governor, Olayemi Cardoso, announced on Tuesday during the Committee’s 303rd meeting in Abuja. The MPR, which serves as the benchmark interest rate in Nigeria, underpi...\n...",
    "category": "Monetary Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3464,
    "title": "Nigeria must break fiscal dominance to build shock-resilient financial system, experts warn",
    "url": "https://hallmarknews.com/nigeria-must-break-fiscal-dominance-to-build-shock-resilient-financial-system-experts-warn/",
    "source": "hallmarknews.com",
    "description": "Economic experts and senior monetary authorities have called for urgent harmonisation of Nigeria’s monetary and fiscal policies to build a resilient, efficient, and shock-proof financial system capable of supporting long-term growth.\n\nThey made the call at the 37th Seminar of the Finance Corresponde...",
    "category": "Monetary Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3466,
    "title": "CBN Retains Monetary Policy Rate at 27% Amid Cautious Outlook",
    "url": "https://newsdigest.ng/cbn-retains-monetary-policy-rate-at-27-amid-cautious-outlook/",
    "source": "newsdigest.ng",
    "description": "The Monetary Policy Committee of the Central Bank of Nigeria has retained the benchmark interest rate at 27 per cent, extending its decision to pause further monetary tightening.\n\nCBN Governor Olayemi Cardoso announced the resolution on Tuesday after the committee concluded its 303rd meeting in Abuj...",
    "category": "Monetary Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3467,
    "title": "Nigeria’s Foreign Reserves Surge to $46.7bn, Signal Stronger Investor Confidence",
    "url": "https://newsdigest.ng/nigerias-foreign-reserves-surge-to-46-7bn-signal-stronger-investor-confidence/",
    "source": "newsdigest.ng",
    "description": "Nigeria’s external reserves have climbed to $46.7 billion as of November 14, 2025, giving the country 10.3 months of import cover for goods and services, according to fresh data from the Central Bank of Nigeria (CBN).\n\nThe CBN says the steady rise stems from renewed investor participation, stronger ...",
    "category": "Monetary Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3468,
    "title": "Nigeria’s Foreign Reserves Hit New High",
    "url": "https://www.naijanews.com/2025/11/18/breaking-nigerias-foreign-reserves-hit-new-high/",
    "source": "www.naijanews.com",
    "description": "The Governor of the Central Bank of Nigeria (CBN), Yemi Cardoso, on Tuesday announced that the nation’s foreign reserves have surpassed $46 billion, marking the highest level recorded since 2018.\n\nNaija News reports that Cardoso, represented by the Deputy Governor in charge of Economic Policy, Dr. M...",
    "category": "Monetary Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  },
  {
    "id": 3494,
    "title": "Nigeria’s 15 per cent fuel levy: Industrial policy, energy security, and trade law, By Ese Owie",
    "url": "https://www.premiumtimesng.com/opinion/837700-nigerias-15-per-cent-fuel-levy-industrial-policy-energy-security-and-trade-law-by-ese-owie.html",
    "source": "www.premiumtimesng.com",
    "description": "Nigeria’s proposed 15 per cent fuel levy is thus not inherently illegitimate. It could, in principle, serve as a bridge from a broken import-and-subsidy model towards a more resilient, domestically rooted energy economy. But in a country where nearly half the population lives in poverty, where food ...",
    "category": "Trade Policy",
    "country": "Nigeria",
    "published_date": "2025-11-01"
  }
]