[
  {
    "id": 2791,
    "title": "Crypto News: Kazakhstan Central Bank Eyes $300M Crypto Investment",
    "url": "https://www.livebitcoinnews.com/crypto-news-kazakhstan-central-bank-eyes-300m-crypto-investment/",
    "source": "www.livebitcoinnews.com",
    "description": "Kazakhstan evaluates a $300 million crypto investment plan as market volatility drives cautious central bank strategy.\n\nKazakhstan central bank is considering a major crypto investment plan as market volatility continues. The proposed allocation could run as high as $300m, although officials are kee...",
    "category": "Central Bank",
    "country": "Kazakhstan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2792,
    "title": "Kazakhstan Central Bank Holds Interest Rate at 18% as Inflation Pressures Persist",
    "url": "https://www.econotimes.com/Kazakhstan-Central-Bank-Holds-Interest-Rate-at-18-as-Inflation-Pressures-Persist-1727235",
    "source": "www.econotimes.com",
    "description": "Kazakhstan’s central bank has decided to keep its benchmark interest rate unchanged at 18%, signaling a cautious approach to monetary policy as inflation remains a key concern for the country’s financial stability. The regulator emphasized that there is currently no room to begin easing rates, and a...",
    "category": "Central Bank",
    "country": "Kazakhstan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2793,
    "title": "National Bank of Kazakhstan Allocates $300M for Crypto",
    "url": "https://www.crypto-news-flash.com/national-bank-of-kazakhstan-allocates-300m-for-crypto-purchases-using-gold-and-fx-reserves/",
    "source": "www.crypto-news-flash.com",
    "description": "All news is rigorously fact-checked and reviewed by leading blockchain experts and seasoned industry insiders.\n\nKazakhstan is planning a $300 million crypto allocation funded by gold, FX reserves and confiscated digital assets.\n\nOfficials are exploring Bitcoin taxes and state mining flows to build a...",
    "category": "Central Bank",
    "country": "Kazakhstan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2797,
    "title": "Azerbaijani currency to world currency rates for November 19",
    "url": "https://www.trend.az/business/4119320.html",
    "source": "www.trend.az",
    "description": "BAKU, Azerbaijan, November 19. The Central Bank of Azerbaijan (CBA) has announced the official exchange rates for November 19, Trend reports via CBA.\n\nThe official exchange rate of the US dollar to the manat remained unchanged at 1.7 manat.\n\nThe exchange rate for one euro was 1.9695 manat, one Turki...",
    "category": "Currency Exchange Rates",
    "country": "Kazakhstan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2784,
    "title": "Kazakhstan tells Ukraine to stop Black Sea oil terminal attacks",
    "url": "https://www.scmp.com/news/world/russia-central-asia/article/3334670/kazakhstan-tells-ukraine-stop-black-sea-oil-terminal-attacks",
    "source": "www.scmp.com",
    "description": "Kazakhstan told Ukraine on Sunday to stop attacking the Black Sea terminal of the Caspian Pipeline Consortium (CPC), which handles more than 1 per cent of global oil, after a major drone attack halted exports and seriously damaged loading infrastructure.\n\nThe CPC, which includes Russian, Kazakh and ...",
    "category": "Economy",
    "country": "Kazakhstan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2781,
    "title": "IMF urges Kazakhstan’s National Bank to keep policy tight",
    "url": "https://www.trend.az/casia/kazakhstan/4120868.html",
    "source": "www.trend.az",
    "description": "ASTANA, Kazakhstan, November 22. Kazakhstan’s National Bank (NBK) should maintain a restrictive monetary stance until inflation moves close to its target, the International Monetary Fund said after completing its 2025 Article IV consultation in the country, Trend reports via the fund.\n\nThe IMF point...",
    "category": "Fiscal Policy",
    "country": "Kazakhstan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2774,
    "title": "Kazakhstan throws light on GDP growth data for 10M2025",
    "url": "https://www.trend.az/casia/kazakhstan/4119394.html",
    "source": "www.trend.az",
    "description": "Photo: Official information source of the Prime Minister of the Republic of Kazakhstan\n\nASTANA, Kazakhstan, November 19. Kazakhstan’s GDP increased by 6.4 percent in the first ten months of 2025, Deputy Prime Minister and Minister of National Economy, Serik Zhumangarin, said at a government meeting,...",
    "category": "GDP",
    "country": "Kazakhstan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2777,
    "title": "The IMF does not ask, does not recommend, but demands to reduce social benefits in Kazakhstan — EADaily, November 28th, 2025 — Economics, Asia",
    "url": "https://eadaily.com/en/news/2025/11/28/the-imf-does-not-ask-does-not-recommend-but-demands-to-reduce-social-benefits-in-kazakhstan",
    "source": "eadaily.com",
    "description": "The International Monetary Fund demands to reduce social benefits and consumer loans in Kazakhstan. This is reported by Argumenty i Fakty Kazakhstan.\n\nBased on the results of a two-week trip to Astana and Almaty, the fund came to the conclusion that the country's economy is in a state of overheating...",
    "category": "Inflation",
    "country": "Kazakhstan",
    "published_date": "2025-11-01"
  }
]