[
  {
    "id": 2025,
    "title": "Home loans surge as lower interest rates slash monthly mortgage payments",
    "url": "https://news.err.ee/1609871433/home-loans-surge-as-lower-interest-rates-slash-monthly-mortgage-payments",
    "source": "news.err.ee",
    "description": "Housing loans in Estonia have boomed this year, with borrowers loaning more as interest rates fall, cutting average monthly mortgage payments by up to €80.\n\nBank of Estonia economist Taavi Raudsaar said the central bank has seen the housing loan market revive over the past year and a half, a trend c...",
    "category": "Central Bank",
    "country": "Estonia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2081,
    "title": "Estonia's inflation finally showing signs of slowing",
    "url": "https://news.err.ee/1609845258/estonia-s-inflation-finally-showing-signs-of-slowing",
    "source": "news.err.ee",
    "description": "Prices in Estonia have eased for the second month in a row, and analysts expect the slowdown to continue next year even as the country still leads the euro area in inflation.\n\nAccording to preliminary data from Statistics Estonia, prices in October stayed level with September. On year, the consumer ...",
    "category": "Inflation",
    "country": "Estonia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2026,
    "title": "Africa attracts smaller EU nations scrambling for influence",
    "url": "https://www.scmp.com/news/world/africa/article/3333849/africa-attracts-smaller-eu-nations-scrambling-influence",
    "source": "www.scmp.com",
    "description": "From Finland opening diplomatic outposts in Senegal to Czech instructors training Mauritanian security forces, a group of smaller European nations has joined a global scramble for influence in Africa.\n\nEstonia, Romania and Malta are among European Union countries that have sought to boost their pres...",
    "category": "Trade Policy",
    "country": "Estonia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2029,
    "title": "Estonia's youth unemployment rate fell in third quarter",
    "url": "https://news.err.ee/1609857771/estonia-s-youth-unemployment-rate-fell-in-third-quarter",
    "source": "news.err.ee",
    "description": "Estonia's unemployment rate dropped to 7.1 percent in the third quarter of 2025, falling primarily among the young and under-50s, data from Statistics Estonia shows\n\nThe unemployment rate was 0.3 percentage points lower than in the third quarter in 2024, falling from 7.4 percent to 7.1 percent. It w...",
    "category": "Unemployment",
    "country": "Estonia",
    "published_date": "2025-11-01"
  },
  {
    "id": 2030,
    "title": "Unemployment down in Estonia and trend forecast to continue",
    "url": "https://news.err.ee/1609861701/unemployment-down-in-estonia-and-trend-forecast-to-continue",
    "source": "news.err.ee",
    "description": "Despite the positive outlook, efforts to complement workers' skills and attract young people to the labor market must continue, said Unemployment Insurance Fund chief Gert Tiivas.\n\n\"Unemployment has been steadily declining over the past few quarters and current forecasts suggest that this trend will...",
    "category": "Unemployment",
    "country": "Estonia",
    "published_date": "2025-11-01"
  }
]