[
  {
    "id": 1225,
    "title": "Bolivia's new president plans to scrap taxes, borrow money to confront economic crisis",
    "url": "https://www.arabtimesonline.com/news/bolivias-new-president-plans-to-scrap-taxes-borrow-money-to-confront-economic-crisis/",
    "source": "www.arabtimesonline.com",
    "description": "LA PAZ, Bolivia, Nov 26, (AP): Bolivian President Rodrigo Paz of Bolivia said Tuesday he planned to scrap a ream of taxes, in one of his first moves since becoming the nation's first conservative leader in nearly two decades in a bid to rescue a crisis-stricken economy. Just over two weeks since tak...",
    "category": "Economic Growth",
    "country": "Bolivia",
    "published_date": "2025-11-01"
  },
  {
    "id": 1219,
    "title": "South America Is Turning More Right-Wing—and Getting Trumpier",
    "url": "https://www.hindustantimes.com/world-news/south-america-is-turning-more-right-wing-and-getting-trumpier-101763953818085.html",
    "source": "www.hindustantimes.com",
    "description": "Chile is poised to elect as president a conservative who has proposed digging ditches to keep out immigrants. In Bolivia, voters recently kicked out the socialists who governed for nearly 20 years. And in Argentina, even the poorest voters have backed President Javier Milei’s efforts to shrink the s...",
    "category": "Economy",
    "country": "Bolivia",
    "published_date": "2025-11-01"
  },
  {
    "id": 1221,
    "title": "Crypto News: Bolivia Moves to Integrate Crypto and Stablecoins Into Financial System",
    "url": "https://www.livebitcoinnews.com/crypto-news-bolivia-moves-to-integrate-crypto-and-stablecoins-into-financial-system/",
    "source": "www.livebitcoinnews.com",
    "description": "Bolivia plans to integrate crypto and stablecoins into its financial system. This aims to modernize the economy, allowing banks to custody crypto.\n\nThe government of Bolivia will integrate cryptocurrencies and stablecoins into its financial system. This drive is trying to modernize the economy of th...",
    "category": "Economy",
    "country": "Bolivia",
    "published_date": "2025-11-01"
  },
  {
    "id": 1212,
    "title": "Bolivia eyes crypto and stablecoins to fight inflation and US dollar shortage",
    "url": "https://coinjournal.net/news/bolivia-eyes-crypto-and-stablecoins-to-fight-inflation-and-us-dollar-shortage/",
    "source": "coinjournal.net",
    "description": "Bolivia lets banks offer crypto services to counter inflation and dollar scarcity.\n\nStablecoins gain traction in Bolivia as businesses and consumers hedge a weakening boliviano.\n\nGovernment pairs digital finance push with major new financing and tax reforms.\n\nBolivia is turning to cryptocurrencies a...",
    "category": "Inflation",
    "country": "Bolivia",
    "published_date": "2025-11-01"
  }
]