[
  {
    "id": 538,
    "title": "Australia's central bank sees core inflation stuck above target out past mid-2026",
    "url": "https://www.cnbc.com/2025/11/04/australias-central-bank-sees-core-inflation-stuck-above-target-out-past-mid-2026.html",
    "source": "www.cnbc.com",
    "description": "Australia's central bank now sees core inflation staying above its target band out to the middle of 2026.\n\nAustralia's central bank now sees core inflation staying stubbornly above its target band out to the middle of 2026 as consumer demand and house prices pick up faster than expected, seemingly l...",
    "category": "Central Bank",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 940,
    "title": "New Zealand shares trim gains after central bank signals end to easing cycle",
    "url": "https://www.livemint.com/market/stock-market-news/new-zealand-shares-trim-gains-after-central-bank-signals-end-to-easing-cycle-11764124160628.html",
    "source": "www.livemint.com",
    "description": "(Updates share moves, adds details throughout after RBNZ's rate decision and Australia's inflation print)\n\nNov 26 (Reuters) - New Zealand shares pared some gains on Wednesday after the country's central bank cut its benchmark cash rate in an expected move, but signalled the likely end to the easing ...",
    "category": "Central Bank",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 553,
    "title": "Currency Converter: Exchange Rate Calculator",
    "url": "https://www.forbes.com/uk/advisor/money-transfer/currency-converter/",
    "source": "www.forbes.com",
    "description": "How to Convert Currency\n\nTo use our currency conversion calculator, all you need to do is input the amount you wish to convert, your starting currency and your ending currency to get an estimate based on current rates.\n\nIf you are converting from Pounds Sterling, you need to use the abbreviation GBP...",
    "category": "Currency Exchange Rates",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 957,
    "title": "‘Australia’s not high-growth’: ANZ boss hits Labor on productivity",
    "url": "https://www.afr.com/companies/financial-services/australia-s-not-high-growth-anz-s-matos-prods-labor-on-productivity-20251121-p5nhho",
    "source": "www.afr.com",
    "description": "ANZ Banking Group boss Nuno Matos has called on the Albanese government to kick start average Australian economic growth by accelerating the economic reforms identified in this year’s productivity roundtable, or risk global investors parking their money in other, more dynamic markets.\n\nMatos, who sp...",
    "category": "Economic Growth",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 959,
    "title": "Riding on military might and economic growth, India ranks third in Asia Power Index 2025",
    "url": "https://www.indiatvnews.com/news/india/riding-military-might-and-economic-growth-india-ranks-third-in-asia-power-index-2025-2025-11-28-1019466",
    "source": "www.indiatvnews.com",
    "description": "Riding on military might and economic growth, India ranks third in Asia Power Index 2025 India ranks third for two measures -- economic capability and future resources. It increased its economic capability rank by one place to third, overtaking Japan, the Asia Power Index report said.\n\nNew Delhi:\n\nB...",
    "category": "Economic Growth",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 961,
    "title": "Australia–Brunei business forum highlights strengthening agrifood partnership",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/11/16/australia-brunei-business-forum-highlights-strengthening-agrifood-partnership",
    "source": "www.thestar.com.my",
    "description": "BANDAR SERI BEGAWAN (Borneo Bulletin/ANN): Senior government and industry leaders from Australia and Brunei Darussalam gathered recently for the Australia–Brunei Business Forum and Networking Event, underscoring both nations’ shared commitment to food security and economic growth.\n\nCo-hosted by the ...",
    "category": "Economic Growth",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 535,
    "title": "Aussie dollar stuck in low gear despite RBA rate hike talk",
    "url": "https://www.afr.com/markets/debt-markets/aussie-dollar-stuck-in-low-gear-despite-rba-rate-hike-talk-20251130-p5njlo",
    "source": "www.afr.com",
    "description": "The Australian dollar should be flying high, buoyed by a strong economy and talk of interest rate rises next year when other countries including the US are still in easing mode.\n\nInstead, it is stuck trading about US65¢, defying strategists’ expectations and behaving more like a tired commuter than ...",
    "category": "Economy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 933,
    "title": "The economy is roaring back to life and the RBA may need to act",
    "url": "https://www.afr.com/opinion/the-economy-is-roaring-and-the-rba-may-need-to-act-20251127-p5niyg",
    "source": "www.afr.com",
    "description": "Everywhere you look there is evidence that the Australian macroeconomy is in a cyclical upswing and is rebounding after the lull of recent years.\n\nBusiness investment had its biggest jump in four years in the September quarter, due to a boom in spending on new data centres, the Australian Bureau of ...",
    "category": "Economy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 934,
    "title": "Australia, US, UK & EU imported $510 million worth petroleum products refined from Russian crude in October",
    "url": "https://www.thehindubusinessline.com/economy/australia-us-uk-eu-imported-510-million-worth-petroleum-products-refined-from-russian-crude-in-october/article70310817.ece",
    "source": "www.thehindubusinessline.com",
    "description": "Australia, European Union (EU), the UK and the US cumulatively imported more than $1 billion worth of petroleum products in October 2025 from Indian and Turkish refiners, of which more than half was processed from Russian crude oil, revealed the Centre for Research on Energy and Clean Air (CREA).\n\nA...",
    "category": "Economy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 935,
    "title": "Australia’s most advanced renewable grid is its most secure, but NSW must scramble as it nears “no coal” scenario",
    "url": "https://reneweconomy.com.au/australias-most-advanced-renewable-grid-is-its-most-secure-but-nsw-must-scramble-as-it-nears-no-coal-scenario/",
    "source": "reneweconomy.com.au",
    "description": "South Australia, the most advanced renewable grid in the country and even the world – thanks to its unrivalled near 75 per cent share of wind and solar – is also the most secure, according to a major new report on the state of the energy transition.\n\nThe Transition Plan for System Security, publishe...",
    "category": "Economy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 936,
    "title": "Australia’s monthly inflation exceeds forecasts",
    "url": "https://www.thestar.com.my/business/business-news/2025/11/27/australias-monthly-inflation-exceeds-forecasts",
    "source": "www.thestar.com.my",
    "description": "SYDNEY: Australia’s core inflation came in stronger than anticipated in October, suggesting the Reserve Bank (RBA) will remain on the sidelines as it tries to assess whether the economy is running beyond its speed limit.\n\nThe currency and the yield on policy sensitive three-year government notes cli...",
    "category": "Economy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 533,
    "title": "Australia’s Inflation Resurgence: The 3.8% Shock That Upended the RBA’s Soft Landing",
    "url": "https://www.webpronews.com/australias-inflation-resurgence-the-3-8-shock-that-upended-the-rbas-soft-landing/",
    "source": "www.webpronews.com",
    "description": "The comforting narrative of a synchronized global disinflationary cycle hit a jarring speed bump in the Southern Hemisphere this week. Just as markets had begun to price in a definitive pivot toward monetary easing, Australia’s consumer price index (CPI) defied the gravity that has taken hold in the...",
    "category": "Fiscal Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 525,
    "title": "Florida GDP, economy passes a European stalwart, targets Australia",
    "url": "https://www.businessobserverfl.com/news/2025/nov/03/florida-gdp-economy-passes-european-stalwart/",
    "source": "www.businessobserverfl.com",
    "description": "Adios, Spain.\n\nThat’s what the economy of Florida is saying, as it passes the European nation in GDP. The Sunshine State, according to the Florida Chamber Foundation, now has a GDP exceeding $1.7 trillion. That’s good for No. 15 in the world, moving up one spot from last year’s rankings. Florida is ...",
    "category": "GDP",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 910,
    "title": "Australia's economy is 'stuck in a rut' of weak investment and productivity - 23 November 2025",
    "url": "https://www.abc.net.au/news/2025-11-23/australias-economy-stuck-with-weak-business-investment/106042716",
    "source": "www.abc.net.au",
    "description": "Inflation isn't the only drag on Australia's economy. For decades, businesses have been incentivised to pay out profits rather than reinvest them. Alan Kohler explains.",
    "category": "GDP",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 912,
    "title": "Shares bounce on Fed, Bad news on inflation, APRA likely to do more to slow investors, Budget better & MYEFO, GDP to bounce",
    "url": "https://www.sharecafe.com.au/2025/11/29/shares-bounce-on-fed-bad-news-on-inflation-apra-likely-to-do-more-to-slow-investors-budget-better-myefo-gdp-to-bounce/",
    "source": "www.sharecafe.com.au",
    "description": "By Dr Shane Oliver, Chief Economist and Head of Investment Strategy at AMP.\n\nInvestment markets and key developments\n\nGlobal shares rose over the last week as the US shares rebounded on the back of increased confidence that the Fed will cut rates next month after Fed speakers turned more dovish amid...",
    "category": "GDP",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 913,
    "title": "The CSIRO cuts are just the tip of the iceberg for Australia's science funding",
    "url": "https://www.abc.net.au/news/science/2025-11-19/csiro-cuts-tip-australia-science-funding/106026174",
    "source": "www.abc.net.au",
    "description": "Australian science is on life-support, and the government isn't stepping up.\n\nUp to 350 CSIRO researchers are set to go in the latest round of redundancies announced by Australia's peak science agency, with cuts now a familiar occurrence at the organisation.\n\nMore than 800 jobs have already been sla...",
    "category": "GDP",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 526,
    "title": "Australia's consumer inflation accelerates to 3.8% in October, overshooting estimates",
    "url": "https://www.cnbc.com/2025/11/26/australia-inflation-cpi-in-october-estimates-beat.html",
    "source": "www.cnbc.com",
    "description": "Australia's inflation accelerated in October, exceeding analysts' estimates and rising at its fastest pace in seven months, data from Australian Bureau of Statistics showed Wednesday.\n\nThe consumer price index rose 3.8% in October, year on year, marking its fastest pace since April, based on data re...",
    "category": "Inflation",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 527,
    "title": "Reserve Bank could raise interest rates as early as May after inflation climbs to 3.8%",
    "url": "https://www.theguardian.com/business/2025/nov/26/australia-inflation-rate-cpi-consumer-price-index-figure-rba-reserve-bank",
    "source": "www.theguardian.com",
    "description": "The Reserve Bank of Australia could be forced to hike interest rates as early as May, economists say, after inflation climbed to 3.8% in the year to October, from 3.6% in the month before.\n\nThe latest bad news on cost of living was accompanied by a shocking 37% annual jump in power bills as generous...",
    "category": "Inflation",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 919,
    "title": "Rates tipped to rise in 2026 as inflation spikes to 3.8pc",
    "url": "https://www.afr.com/policy/economy/inflation-hits-3-8-pc-exceeding-rba-s-forecasts-20251126-p5nihz",
    "source": "www.afr.com",
    "description": "A first interest rate rise in more than two years is on the cards in 2026 after inflation spiked to 3.8 per cent in the year to October, driven by higher electricity and food costs in a blow to the Albanese government’s efforts to contain cost-of-living pressures.\n\nUnderlying inflation also increase...",
    "category": "Inflation",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 921,
    "title": "Westpac’s chief economist Luci Ellis delivers warning to government on spending after inflation resurges in October",
    "url": "https://www.skynews.com.au/business/finance/westpacs-chief-economist-luci-ellis-delivers-warning-to-government-on-spending-after-inflation-resurges-in-october/news-story/28be049a9da5cde070567fe26f25d9d4",
    "source": "www.skynews.com.au",
    "description": "Westpac’s chief economist has sounded the alarm about government policy pushing up inflation after price rises soared once again in the 12 months to October.\n\nWatch the full interview with Westpac’s Luci Ellis from 11am on Business Now with a SkyNews.com.au subscription.\n\nThe Australian Bureau of St...",
    "category": "Inflation",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 540,
    "title": "RBA could hike interest rates in early 2026 as banks rewrite forecasts",
    "url": "https://www.abc.net.au/news/2025-11-29/rba-interest-rate-hike-possible-within-months/106077098",
    "source": "www.abc.net.au",
    "description": "The economic ground shook on Wednesday after the Bureau of Statistics released its new monthly Consumer Price Index (CPI) data.\n\nIt showed inflation isn't behaving itself.\n\nHeadline inflation came in at 3.8 per cent, while underlying or core inflation was at 3.3 per cent.\n\nThe Reserve Bank wants inf...",
    "category": "Interest Rates",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 542,
    "title": "Elevated Australian inflation rules out further interest rate cuts",
    "url": "https://www.wsws.org/en/articles/2025/11/28/qkyt-n28.html",
    "source": "www.wsws.org",
    "description": "Australian home buyers battling to pay off mortgages have no possibility of even any limited relief through a cut in interest rates for the foreseeable future. The latest inflation numbers released on Wednesday have taken that prospect off the agenda and made it likely that the next move will be up ...",
    "category": "Interest Rates",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 945,
    "title": "RBA interest rates: November minutes show Michele Bullock in no rush to cut",
    "url": "https://thewest.com.au/business/economy/rba-interest-rates-november-minutes-show-michele-bullock-in-no-rush-to-cut-c-20712120",
    "source": "thewest.com.au",
    "description": "Homeowners should brace for interest rates to stay on hold for many months as the Reserve Bank warns price pressure may be worse than previously thought.\n\nMinutes from the central bank’s November meeting released on Tuesday gave another strong signal the RBA won’t rush another cut.\n\nThe RBA kept the...",
    "category": "Interest Rates",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 529,
    "title": "How Developments in International Financial Markets Shape Financial Conditions in Australia | Speeches",
    "url": "https://www.rba.gov.au/speeches/2025/sp-so-2025-11-26.html",
    "source": "www.rba.gov.au",
    "description": "Speech How Developments in International Financial Markets Shape Financial Conditions in Australia Penelope Smith\n\nHead of International Department Australian Securitisation Conference\n\nSydney –\n\nI would like to begin by acknowledging the Gadigal people of the Eora Nation, the traditional custodians...",
    "category": "Monetary Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 543,
    "title": "China reportedly wants to do more deals in its own currency. Australia’s banks aren’t ready",
    "url": "https://theconversation.com/china-reportedly-wants-to-do-more-deals-in-its-own-currency-australias-banks-arent-ready-270671",
    "source": "theconversation.com",
    "description": "In October, media reports suggested mining giant BHP had accepted a deal to settle about a third of its spot iron ore sales to Chinese customers in China’s own currency, the renminbi (RMB), rather than US dollars.\n\nThose reports still haven’t been officially confirmed, amid ongoing closed-door negot...",
    "category": "Trade Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 545,
    "title": "Opinion: EU trade agreement must right the wrongs of agricultural trade imbalance",
    "url": "https://www.beefcentral.com/news/opinion-eu-trade-agreement-must-right-the-wrongs-of-agricultural-trade-imbalance/",
    "source": "www.beefcentral.com",
    "description": "In the midst of the final stages of FTA discussions with the EU, Cattle Australia’s senior advisor Dr Chris Parker argues that the time has come to tip the scales back in Australia’s favour after decades of agricultural trade imbalance with Europe.\n\nTHE time has come to tip the scales back in Austra...",
    "category": "Trade Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 946,
    "title": "Beef, BMWs and bureaucracy hit EU trade talks",
    "url": "https://www.afr.com/policy/foreign-affairs/beef-bmws-and-bureaucracy-hit-eu-trade-talks-20251118-p5ng6v",
    "source": "www.afr.com",
    "description": "Trade Minister Don Farrell says Australia and the European Union are still at odds over how much meat local farmers can sell to the trading block as he prepares for high-stakes talks that could give Australians access to cheaper luxury cars.\n\nFarrell will meet EU Trade Commissioner Maros Sefcovic in...",
    "category": "Trade Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 947,
    "title": "No issues raised with Future Made in Australia by US, Farrell says",
    "url": "https://www.afr.com/politics/federal/australian-world-news-live-updates-zelensky-agrees-to-work-on-us-draft-plan-to-end-war-pm-says-g20-is-critical-despite-trump-and-xi-s-absence-20251121-p5nhah",
    "source": "www.afr.com",
    "description": "That’s a wrap. Thanks for following the AFR’s live coverage this Friday, May 21, 2025. We will have more coverage on Monday morning.\n\nHere are some of the stories we covered today:",
    "category": "Trade Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 949,
    "title": "Australian shares little changed; head for worst November since 2014 on bank rout",
    "url": "https://www.livemint.com/market/stock-market-news/australian-shares-little-changed-head-for-worst-november-since-2014-on-bank-rout-11764292113662.html",
    "source": "www.livemint.com",
    "description": "Nov 28 (Reuters) - Australian shares were flat in early trade on Friday but were on track for their weakest November in more than a decade, as heavyweight banks tumbled on frothy valuation concerns and strong economic data dampened hopes of near-term policy easing.\n\nThe S&P/ASX 200 index was largely...",
    "category": "Trade Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 953,
    "title": "'It should be bipartisan': Trade Minister Don Farrell warns Coalition against major cuts to immigration",
    "url": "https://www.skynews.com.au/australia-news/politics/it-should-be-bipartisan-trade-minister-don-farrell-warns-coalition-against-major-cuts-to-immigration/news-story/4f2cb8c48d8a5f8b984d913d6405933a",
    "source": "www.skynews.com.au",
    "description": "Trade Minister Don Farrell has cautioned the federal opposition against pursuing major cuts to Australia’s immigration intake.\n\nIt comes after the latest Newspoll, conducted for The Australian, found 25 per cent of voters wanted “fewer” immigrants and 39 per cent wanted “a lot fewer”.\n\nMeanwhile, th...",
    "category": "Trade Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 954,
    "title": "Australian news and politics live: Barnaby Joyce confirms he’s defecting from Nationals Party",
    "url": "https://thenightly.com.au/politics/australian-news-and-politics-live-labor-strikes-deal-with-greens-to-pass-environmental-law-overhaul-c-20808602",
    "source": "thenightly.com.au",
    "description": "Weary MPs have had their last sitting day for 2025, a year that may have been one of the most important in modern Australian history when the government did not change.\n\nLike their elected representatives, Australians participated in profound debates that helped define the nation, from children’s ac...",
    "category": "Trade Policy",
    "country": "Australia",
    "published_date": "2025-11-01"
  },
  {
    "id": 550,
    "title": "Wage growth stable, but divergence under the hood in Australia",
    "url": "https://www.oxfordeconomics.com/resource/wage-growth-stable-but-divergence-under-the-hood-in-australia/",
    "source": "www.oxfordeconomics.com",
    "description": "Key findings\n\nThe WPI rose 0.8% q/q in Q3, keeping annual wage growth unchanged at 3.4%. While the WPI is a lagging indicator, the stability supports our view that the labour market remains tight.\n\nLooking ahead, we expect the labour market to gradually cool, with unemployment hitting 4.6% by the mi...",
    "category": "Unemployment",
    "country": "Australia",
    "published_date": "2025-11-01"
  }
]