[
  {
    "id": 2321,
    "title": "UK trade officials hail Guyana’s rapid economic rise",
    "url": "https://www.stabroeknews.com/2025/11/27/news/guyana/uk-trade-officials-hail-guyanas-rapid-economic-rise/",
    "source": "www.stabroeknews.com",
    "description": "The United Kingdom’s visiting trade mission was hosted last evening at a reception at the Bel Air residence of British High Commissioner Jane Miller, where UK officials highlighted Guyana’s economic momentum and reaffirmed their interest in deeper long-term partnerships across several sectors.\n\nAddr...",
    "category": "Economic Growth",
    "country": "Guyana",
    "published_date": "2025-11-01"
  },
  {
    "id": 2322,
    "title": "Canadian delegation exploring investment opportunities in Guyana",
    "url": "https://www.inewsguyana.com/canadian-delegation-exploring-investment-opportunities-in-guyana/",
    "source": "www.inewsguyana.com",
    "description": "The Guyana Office for Investment this morning engaged with a visiting Canadian delegation exploring new avenues for partnership and collaboration in Guyana, demonstrating the continued commitment of both countries to deepening economic ties and identifying areas for mutually beneficial growth.\n\nThe ...",
    "category": "Economic Growth",
    "country": "Guyana",
    "published_date": "2025-11-01"
  },
  {
    "id": 2323,
    "title": "Caricom trade and economic ministers meet in Guyana",
    "url": "https://www.jamaicaobserver.com/2025/11/21/caricom-trade-economic-ministers-meet-guyana/",
    "source": "www.jamaicaobserver.com",
    "description": "FILE PHOTO: Caricom\n\nGEORGETOWN, Guyana (CMC) – The Caribbean Community (Caricom) Secretary-General, Dr Carla Barnett says the destruction caused by Hurricane Melissa when it passed through the region in late October, underscores the urgency of addressing the existential threats posed by climate cha...",
    "category": "Economic Growth",
    "country": "Guyana",
    "published_date": "2025-11-01"
  },
  {
    "id": 2325,
    "title": "Essequibo women entrepreneurs shine at second pitch fest",
    "url": "https://www.stabroeknews.com/2025/11/24/news/guyana/essequibo-women-entrepreneurs-shine-at-second-pitch-fest/",
    "source": "www.stabroeknews.com",
    "description": "The WeLead Association successfully hosted the 2nd Annual Innovate Pitch Fest, an initiative designed to empower women entrepreneurs across Region Two and neighbouring communities through funding, capacity-building and increased visibility. This year’s event highlighted outstanding innovation, resil...",
    "category": "Economic Growth",
    "country": "Guyana",
    "published_date": "2025-11-01"
  },
  {
    "id": 2316,
    "title": "National Quality Policy being developed to improve standards across all sectors",
    "url": "https://www.inewsguyana.com/national-quality-policy-being-developed-to-improve-standards-across-all-sectors/",
    "source": "www.inewsguyana.com",
    "description": "The Ministry of Tourism, Industry, and Commerce in collaboration with the Guyana National Bureau of Standards (GNBS) is developing a National Quality Policy, intended to improve standards across all industries in both the private and public sectors.\n\nThis was announced by Minister of Tourism, Indust...",
    "category": "Economy",
    "country": "Guyana",
    "published_date": "2025-11-01"
  },
  {
    "id": 2319,
    "title": "Guyana to launch five-year blueprint for rapid economic expansion",
    "url": "https://www.jamaicaobserver.com/2025/11/29/guyana-launch-five-year-blueprint-rapid-economic-expansion/",
    "source": "www.jamaicaobserver.com",
    "description": "President Irfaan Ali delivering the feature address at the Guyana Oil and Gas Energy Chamber’s Annual Awards presentation dinner on Friday night. (Photo: CMC)\n\nGEORGETOWN, Guyana (CMC) — The Guyana government says it will soon unveil a five-year comprehensive national economic expansion and infrastr...",
    "category": "Economy",
    "country": "Guyana",
    "published_date": "2025-11-01"
  },
  {
    "id": 2312,
    "title": "2025 mid-year report highlights several gains to the working-class",
    "url": "https://www.inewsguyana.com/2025-mid-year-report-highlights-several-gains-to-the-working-class-gawu/",
    "source": "www.inewsguyana.com",
    "description": "See full statement from the Guyana Agricultural and General Workers Union (GAWU):\n\nThe Guyana Agricultural and General Workers Union (GAWU) has recently reviewed the recently released 2025 mid-year report. The document highlights Guyana’s economic and financial progress while considering our social ...",
    "category": "Inflation",
    "country": "Guyana",
    "published_date": "2025-11-01"
  }
]