[
  {
    "id": 3741,
    "title": "PNG Budget 2026 Set to Push Stability and Long-Term Growth",
    "url": "https://news.pngfacts.com/2025/11/png-budget-2026-set-to-push-stability.html",
    "source": "news.pngfacts.com",
    "description": "Papua New Guinea will head into 2026 with what Prime Minister James Marape describes as the most stable and disciplined national budget in recent years, reaffirming the Government’s commitment to service delivery and long-term development under MTDP IV and the Reset PNG@50 roadmap. The Treasurer, Ia...",
    "category": "Economic Growth",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3743,
    "title": "PM Modi's visit to Japan, Papua New Guinea, Australia from May 19-24",
    "url": "https://www.aninews.in/news/world/asia/pm-modis-visit-to-japan-papua-new-guinea-australia-from-may-19-2420230518093254/",
    "source": "www.aninews.in",
    "description": "\"We respect the position of PM Modi,\" Kremlin Spox says on Indian stance for peace in Russia-Ukraine war",
    "category": "Economic Growth",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3745,
    "title": "In inflation fight, new MPC to face growth risks",
    "url": "https://timesofindia.indiatimes.com/business/india-business/in-inflation-fight-new-mpc-to-face-growth-risks/articleshow/113406562.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "MUMBAI: The new external members of RBI 's monetary policy committee , who are likely to be appointed by govt this month, are set to face new risks to growth - evident in macroeconomic numbers.RBI governor Shaktikanta Das noted some external risks to growth in a recent speech at a Bretton Woods even...",
    "category": "Economic Growth",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3728,
    "title": "PNG Economy ‘Stronger Than Critics Claim, Says Marape",
    "url": "https://news.pngfacts.com/2025/11/png-economy-stronger-than-critics-claim.html",
    "source": "news.pngfacts.com",
    "description": "PNG Prime Minister James Marape says the national economy is recovering and strengthening despite opposition claims, rejecting Chuave MP James Nomane’s criticisms as selective and politically motivated.\n\nMarape said global events since 2019 reshaped every economy, and PNG was no exception. He pointe...",
    "category": "Economy",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3729,
    "title": "PNG urges New Zealand to boost Investment as Trade Gap remains Wide",
    "url": "https://news.pngfacts.com/2025/11/png-urges-new-zealand-to-boost.html",
    "source": "news.pngfacts.com",
    "description": "Papua New Guinea has urged New Zealand to step up its investment footprint as both countries look to refresh their economic relationship. The call came from PNG International Trade and Investment Minister Richard Maru during a meeting with the New Zealand–PNG Business Council in Port Moresby.\n\nHe sa...",
    "category": "Economy",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3731,
    "title": "Union Cabinet approves India's digital tech pacts with France, Papua New Guinea, Trinidad and Tobago",
    "url": "https://timesofindia.indiatimes.com/india/cabinet-approves-indias-digital-tech-pacts-with-france-papua-new-guinea-trinidad-and-tobago/articleshow/104343932.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "Representative image (ANI)\n\nNEW DELHI: The Union Cabinet on Wednesday approved the country's three separate memorandum of understandings with Papua New Guinea , France, Trinidad and Tobago in the field of digital technologies. The MoU (memorandum of understanding) with France intends to promote clos...",
    "category": "Economy",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3732,
    "title": "PNG questions 'what planet' the Opposition is on, after it ditches net zero support",
    "url": "https://www.sbs.com.au/news/article/png-questions-what-planet-the-opposition-is-on-after-it-ditches-net-zero-support/yxyrbeab7",
    "source": "www.sbs.com.au",
    "description": "The foreign minister of one of Australia's most important regional allies has expressed shock at the Opposition's decision to ditch its commitment to achieving net zero carbon emissions by 2050.\n\n\n\n\n\nPapua New Guinea's top diplomat, Justin Tkatchenko, conducted an interview with SBS News from Port M...",
    "category": "Economy",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3727,
    "title": "PNG launches long-term tourism roadmap with new National Policy",
    "url": "https://news.pngfacts.com/2025/11/png-launches-long-term-tourism-roadmap.html",
    "source": "news.pngfacts.com",
    "description": "Papua New Guinea formally unveiled its National Tourism Policy 2025–2045 during a ceremony at APEC Haus in Port Moresby, marking a major step in shaping the country’s tourism future. The announcement on November 18 came after more than a year of extensive consultations nationwide, bringing together ...",
    "category": "Fiscal Policy",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3723,
    "title": "Breaking news live updates: State of emergency declared in Papua New Guinea after fatal riots",
    "url": "https://timesofindia.indiatimes.com/india/breaking-news-live-updates/liveblog/106712199.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "19:14 (IST) Jan 11\n\nConsumer inflation in the United States rose more than anticipated in December, government data showed Thursday, although underlying pressures still appear to be ebbing slightly. The Department of Labor's consumer price index (CPI), a key measure of inflation, was up 3.4 percent ...",
    "category": "Inflation",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3735,
    "title": "Indian Navy: INS Kolkata, INS Sahyadri dock in Papua New Guinea as interest in Pacific sharpens",
    "url": "https://timesofindia.indiatimes.com/india/indian-navy-ships-dock-in-papua-new-guinea-as-interest-in-pacific-sharpens/articleshow/102359106.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "SYDNEY: Two Indian navy ships docked in Papua New Guinea on Wednesday, underscoring the strategic importance of the country to global superpowers the United States and China and their allies.The INS Kolkata guided missile destroyer and INS Sahyadri frigate will stay in PNG's capital Port Moresby for...",
    "category": "Interest Rates",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3736,
    "title": "New FD Schemes Launched in 2025: SBI, PNB, Bank of Baroda, IDBI Bank interest rates compared!",
    "url": "https://www.financialexpress.com/money/new-fd-schemes-launched-in-2025-sbi-pnb-bank-of-baroda-idbi-bank-interest-rates-compared-3727973/",
    "source": "www.financialexpress.com",
    "description": "Fixed Deposit Rates 2025: Major banks like State Bank of India (SBI), Punjab National Bank (PNB), Bank of Baroda (BoB) and IDBI Bank have recently launched new fixed deposit (FD) schemes in January 2025. These new product offerings come with higher interest rates, more flexibility, and special optio...",
    "category": "Interest Rates",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3725,
    "title": "Strong earthquake detected in Papua New Guinea",
    "url": "https://www.financialexpress.com/world-news/strong-earthquake-detected-in-papua-new-guineanbsp/2662500/",
    "source": "www.financialexpress.com",
    "description": "The US Geological Survey has detected a 7.6-magnitude earthquake in northeastern Papua New Guinea.\n\nThe quake hit at 6:46 am. Initial readings put the quake at a depth of some 50 to 60 kilometers (30 to 40 miles) located 67 kilometers (42 miles) east of Kainantu, a sparsely populated area.\n\nAlso Rea...",
    "category": "Monetary Policy",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3739,
    "title": "TN Minister Palanivel Thiagarajan launches PNG Coffee in India; AdzGuru connects businesses of India, Papua New Guinea",
    "url": "https://news.webindia123.com/news/Articles/Business/20220110/3889770.html",
    "source": "news.webindia123.com",
    "description": "Australia based company, AdzGuru in collaboration with Indian Economic Trade Organization, Asian-African Chamber of Commerce and Industry, India Pacific Islands Trade Council and World Peace and Diplomacy Organization, organized 'Papua New Guinea Trade Investment Summit' alongside the launching of P...",
    "category": "Trade Policy",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  },
  {
    "id": 3746,
    "title": "\"Deeply saddened\": EAM Jaishankar expresses grief after landslide claim numerous lives in Papua New Guinea",
    "url": "https://www.aninews.in/news/world/asia/deeply-saddened-eam-jaishankar-expresses-grief-after-landslide-claim-numerous-lives-in-papua-new-guinea20240527164131/",
    "source": "www.aninews.in",
    "description": "New Delhi [India], May 27 (ANI): External Affairs Minister S Jaishankar on Monday expressed grief on the loss of lives in Papua New Guinea following the recent landslide in which around 2000 people are feared buried as of now.\n\nIn a post on X, Jaishankar wrote, \"Deeply saddened by the loss of lives ...",
    "category": "Unemployment",
    "country": "Papua New Guinea",
    "published_date": "2025-12-01"
  }
]