[
  {
    "id": 3242,
    "title": "Dirham Rises as Morocco’s Reserves Hit MAD 432.3 Billion and MASI Slips 2.5%",
    "url": "https://www.moroccoworldnews.com/2025/11/269104/dirham-rises-as-moroccos-reserves-hit-mad-432-3-billion-and-masi-slips-2-5/",
    "source": "www.moroccoworldnews.com",
    "description": "Mohammedia – The dirham posted a modest rise against the world’s two main currencies this past week, extending the steady trend seen since early autumn.\n\nAccording to Bank Al‑Maghrib (BAM), the national currency gained 0.4% against the US dollar and 0.3% vis-à-vis the euro, a movement that unfolded ...",
    "category": "Central Bank",
    "country": "Morocco",
    "published_date": "2025-11-01"
  },
  {
    "id": 3239,
    "title": "Fitch Ratings: Morocco’s Fiscal Outlook Remains Stable as Protests Subside",
    "url": "https://www.moroccoworldnews.com/2025/11/267450/fitch-ratings-moroccos-fiscal-outlook-remains-stable-as-protests-subside/",
    "source": "www.moroccoworldnews.com",
    "description": "Rabat – Morocco’s 2026 draft budget shows the government is staying committed to fiscal restraint despite the nationwide protests that erupted in September, according to Fitch Ratings.\n\nThe rating agency, which affirmed Morocco’s “BB+” rating with a Stable Outlook in September, said the limited rise...",
    "category": "Fiscal Policy",
    "country": "Morocco",
    "published_date": "2025-11-01"
  },
  {
    "id": 3231,
    "title": "Beyond GDP: How the World Bank’s Outlook Neglects the Real Story",
    "url": "https://www.moroccoworldnews.com/2025/11/268588/beyond-gdp-how-the-world-banks-outlook-neglects-the-real-story/",
    "source": "www.moroccoworldnews.com",
    "description": "The World Bank’s latest economic update for the Middle East, North Africa, Afghanistan, and Pakistan (MENAAP) arrives with bold claims: regional gross domestic product (GDP) growth will average 2.8%in 2025 and women’s participation could lift GDP per capita by $20-30, although reforms are urgently n...",
    "category": "GDP",
    "country": "Morocco",
    "published_date": "2025-11-01"
  },
  {
    "id": 3235,
    "title": "Morocco’s Economy Strengthening with 4.7% Growth, European Bank Says in Latest Assessment",
    "url": "https://www.moroccoworldnews.com/2025/11/269585/moroccos-economy-strengthening-with-4-7-growth-european-bank-says-in-latest-assessment/",
    "source": "www.moroccoworldnews.com",
    "description": "Mohammedia – Morocco is moving into 2026 on firmer economic and policy ground, recording stronger growth, easing inflation and a wave of structural reforms that signal a shift from crisis response to long-term transformation.\n\nAccording to the latest European Bank for Reconstruction and Development ...",
    "category": "Inflation",
    "country": "Morocco",
    "published_date": "2025-11-01"
  },
  {
    "id": 3236,
    "title": "Morocco Records 0.6% Decline in CPI for October 2025",
    "url": "https://www.moroccoworldnews.com/2025/11/268913/morocco-records-0-6-decline-in-cpi-for-october-2025/",
    "source": "www.moroccoworldnews.com",
    "description": "Mohammedia – Morocco’s Consumer Price Index fell by 0.6% in October 2025, marking a noticeable shift driven mainly by cheaper food products while non-food prices remained unchanged.\n\nAccording to the national statistics office data, food prices dropped by 1.3% in a single month, easing pressure on h...",
    "category": "Inflation",
    "country": "Morocco",
    "published_date": "2025-11-01"
  },
  {
    "id": 3238,
    "title": "Morocco Records 2.7% Decline in Automotive Exports in 2025",
    "url": "https://www.moroccoworldnews.com/2025/11/269529/morocco-records-2-7-decline-in-automotive-exports-in-2025/",
    "source": "www.moroccoworldnews.com",
    "description": "Mohammedia – Morocco’s automotive industry, the country’s largest export sector, recorded an unusual decline in the first nine months of 2025, according to Bank Al-Maghrib’s Monthly Review of Economic, Monetary and Financial Conditions – November 2025.\n\nThe report shows that automotive exports fell ...",
    "category": "Monetary Policy",
    "country": "Morocco",
    "published_date": "2025-11-01"
  },
  {
    "id": 3245,
    "title": "Morocco-Turkiye Business Forum Yields Promising Results, Secretary Omar Hajira Reports",
    "url": "https://www.moroccoworldnews.com/2025/11/270038/morocco-turkiye-business-forum-yields-promising-results-secretary-omar-hajira-reports/",
    "source": "www.moroccoworldnews.com",
    "description": "Rabat — The Morocco-Turkyie Business and Investment Forum, held Friday in Istanbul, produced positive outcomes and drew strong Moroccan participation, according to Omar Hajira, Morocco’s Secretary of State for Foreign Trade.\n\nHajira indicated that the event provided a launchpad to support joint inve...",
    "category": "Trade Policy",
    "country": "Morocco",
    "published_date": "2025-11-01"
  },
  {
    "id": 3253,
    "title": "Rising Morocco: National Conference Puts Youth at Center of Social State Development",
    "url": "https://www.moroccoworldnews.com/2025/11/267953/rising-morocco-national-conference-puts-youth-at-center-of-social-state-development/",
    "source": "www.moroccoworldnews.com",
    "description": "Marrakech – Carré d’Or in Casablanca hosted on Thursday a national conference titled “Rising Morocco… Youth at the Heart of the Social State.” Organized by the “Moustaqil” initiative in partnership with Al Moultaqa Foundation, the event brought together ministers, public figures, young entrepreneurs...",
    "category": "Unemployment",
    "country": "Morocco",
    "published_date": "2025-11-01"
  }
]