[
  {
    "id": 1766,
    "title": "U.S. Dollar Declines Further in Cuba Following Announcement of \"Official Exchange Market\"",
    "url": "https://www.cubaheadlines.com/articles/315004",
    "source": "www.cubaheadlines.com",
    "description": "The U.S. dollar experienced another dip on Monday in Cuba's unofficial exchange market, now trading at 450 Cuban pesos (CUP), a decrease of 10 pesos from the previous day. This marks the continuation of a downward trend that began on Sunday.\n\nIn contrast, the euro (EUR) holds steady at 500 CUP, whil...",
    "category": "Currency Exchange Rates",
    "country": "Cuba",
    "published_date": "2025-11-01"
  },
  {
    "id": 1767,
    "title": "Dollar and Freely Convertible Currency Value Drops in Cuba",
    "url": "https://www.cubaheadlines.com/articles/315193",
    "source": "www.cubaheadlines.com",
    "description": "On Thursday, the informal currency market in Cuba opened with notable decreases: the value of both the dollar and the Freely Convertible Currency (MLC) has fallen.\n\nAccording to the daily report from the independent outlet elTOQUE, which monitors the Informal Market Representative Rate (TRMi), the d...",
    "category": "Currency Exchange Rates",
    "country": "Cuba",
    "published_date": "2025-11-01"
  },
  {
    "id": 1763,
    "title": "Vietnam-Cuba exemplary, loyal, rare relationship - most valuable asset of two countries: diplomat",
    "url": "https://en.vietnamplus.vn/vietnam-cuba-exemplary-loyal-rare-relationship-most-valuable-asset-of-two-countries-diplomat-post333458.vnp",
    "source": "en.vietnamplus.vn",
    "description": "Havana (VNA) - The exemplary, loyal and rare relationship stands as the greatest achievement and most valuable asset that Vietnam and Cuba have built over the past 65 years, said Vietnamese Ambassador to Cuba Le Quang Long.\n\n\n\nIn an interview granted to the Vietnam News Agency (VNA) ahead of the 65t...",
    "category": "Economic Growth",
    "country": "Cuba",
    "published_date": "2025-11-01"
  },
  {
    "id": 1753,
    "title": "Cuba Promises “Facilities and Guarantees” to Foreigners",
    "url": "https://havanatimes.org/news/cuba-promises-facilities-and-guarantees-to-foreigners/",
    "source": "havanatimes.org",
    "description": "amid crisis and blackouts\n\nOscar Perez-Oliva Fraga, great-nephew of Fidel Castro, at FIVAH. / Cubadebate\n\nAt the opening of the Havana Trade Fair, Vice Prime Minister Óscar Pérez-Oliva called for confidence in a “more dynamic and transparent” business environment.\n\nBy EFE/14ymedio\n\nHAVANA TIMES – Th...",
    "category": "Economy",
    "country": "Cuba",
    "published_date": "2025-11-01"
  },
  {
    "id": 1756,
    "title": "Cuba Delves Deeper into Denunciation of Economic Warfare Actions",
    "url": "https://www.periodico26.cu/index.php/en/cuba-news-2/23735-cuba-delves-deeper-into-denunciation-of-economic-warfare-actions",
    "source": "www.periodico26.cu",
    "description": "Cuba Delves Deeper into Denunciation of Economic Warfare Actions\n\nThe nature of the covert actions by the United States administration to operate and influence the Cuban economy from abroad, along with details of the ongoing investigation, were revealed today on the television program “Razones de Cu...",
    "category": "Economy",
    "country": "Cuba",
    "published_date": "2025-11-01"
  },
  {
    "id": 1757,
    "title": "Cuba's former economy minister to go on trial for espionage, corruption next week",
    "url": "https://www.straitstimes.com/world/cubas-former-economy-minister-to-go-on-trial-for-espionage-corruption-next-week",
    "source": "www.straitstimes.com",
    "description": "Sign up now: Get ST's newsletters delivered to your inbox\n\nHAVANA - Cuba's top court said on Monday former Economy Minister Alejandro Gil would go on trial for espionage and corruption on Tuesday, ratcheting up intrigue in one of the highest-profile corruption cases in the communist-run country in d...",
    "category": "Economy",
    "country": "Cuba",
    "published_date": "2025-11-01"
  },
  {
    "id": 1760,
    "title": "Why six-decade-long American embargo on Cuba must end now",
    "url": "https://www.firstpost.com/opinion/why-six-decade-long-american-embargo-on-cuba-must-end-now-ws-e-13954246.html",
    "source": "www.firstpost.com",
    "description": "On October 29, 2025, the UN General Assembly adopted a resolution calling for an end to the United States’ decades-long embargo against Cuba\n\nCubans call it “El Bloqueo”. Americans call it the “economic blockade”. The world at large sees it as the “siege of Cuba” that has lasted far too long. The ti...",
    "category": "Trade Policy",
    "country": "Cuba",
    "published_date": "2025-11-01"
  }
]