[
  {
    "id": 4464,
    "title": "Sweden bets on nuclear power to drive economic growth and cut emissions",
    "url": "https://www.channelnewsasia.com/world/sweden-ebba-busch-nuclear-power-energy-demand-reactors-growth-emissions-singapore-5441746",
    "source": "www.channelnewsasia.com",
    "description": "SWEDEN’S NUCLEAR JOURNEY\n\nBusch, who is also minister for energy, business and industry, highlighted the crucial role nuclear power plays in Sweden’s energy strategy.\n\nSweden’s energy mix is dominated by low-carbon sources such as hydropower, wind and nuclear energy.\n\nThe country has six active nucl...",
    "category": "Economic Growth",
    "country": "Sweden",
    "published_date": "2025-12-01"
  },
  {
    "id": 4456,
    "title": "India-Sweden bilateral trade can double in 5 years if India-EU FTA, India's green transition plans materialise",
    "url": "https://www.fortuneindia.com/economy/india-sweden-bilateral-trade-can-double-in-5-years-if-india-eu-fta-indias-green-transition-plans-materialise/128477",
    "source": "www.fortuneindia.com",
    "description": "India-Sweden bilateral trade could double in five years if India-EU Free Trade Agreement (FTA) materializes and India sticks to the country’s green transition plans, Sven Ostberg, Consul General of Sweden in Mumbai has said.\n\nIn an interaction with Fortune India, Ostberg said negotiations on the Ind...",
    "category": "Economy",
    "country": "Sweden",
    "published_date": "2025-12-01"
  },
  {
    "id": 4459,
    "title": "Prime Minister Carney welcomes Their Majesties King Carl XVI Gustaf and Queen Silvia of Sweden to Canada",
    "url": "https://www.newswire.ca/news-releases/prime-minister-carney-welcomes-their-majesties-king-carl-xvi-gustaf-and-queen-silvia-of-sweden-to-canada-851734974.html",
    "source": "www.newswire.ca",
    "description": "OTTAWA, ON, Nov. 18, 2025 /CNW/ - In a more dangerous and divided world, Canada's new government is transforming our economy – from one of reliance on specific trade partners to one that is more resilient to global shocks, built on the solid foundation of strong Canadian industries and bolstered by ...",
    "category": "Economy",
    "country": "Sweden",
    "published_date": "2025-12-01"
  },
  {
    "id": 4448,
    "title": "Sweden Macroeconomic Outlook Report 2025: Output to Strengthen this Year, Led by Financial Intermediation, Real Estate, Business Activities, and Growth Across Manufacturing and Trade",
    "url": "https://uk.finance.yahoo.com/news/sweden-macroeconomic-outlook-report-2025-090400458.html",
    "source": "uk.finance.yahoo.com",
    "description": "Company Logo\n\nKey market opportunities in Sweden include growth in financial intermediation, real estate, and business activities, projected to rise by 3.8% in 2025. Stockholm, Gothenburg, and Malmö are central economic hubs, contributing 59.8% to GDP. These insights aid strategic planning by identi...",
    "category": "GDP",
    "country": "Sweden",
    "published_date": "2025-12-01"
  },
  {
    "id": 4450,
    "title": "Sweden’s GDP Growth Surges, Defying Expectations",
    "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Tipranks/35803849/swedens-gdp-growth-surges-defying-expectations/",
    "source": "www.theglobeandmail.com",
    "description": "Sweden’s GDP growth rate year-on-year surged to 2.4%, a significant increase from the previous rate of 0.9%. This represents an absolute rise of 1.5 percentage points, indicating a robust upward trend in the country’s economic expansion.\n\nElevate Your Investing Strategy:\n\nTake advantage of TipRanks ...",
    "category": "GDP",
    "country": "Sweden",
    "published_date": "2025-12-01"
  },
  {
    "id": 4461,
    "title": "Piyush Goyal starts visit to Switzerland, Sweden",
    "url": "https://www.financialexpress.com/policy/economy-piyush-goyal-starts-visit-to-switzerland-sweden-3873903/",
    "source": "www.financialexpress.com",
    "description": "Commerce and industry minister Piyush Goyal on Monday started his visit to Switzerland where he will be engaging with the industry and political leadership to explore opportunities for collaboration.\n\nSwitzerland is the most important member of the European Free Trade Association (EFTA) with which I...",
    "category": "Trade Policy",
    "country": "Sweden",
    "published_date": "2025-12-01"
  }
]