[
  {
    "id": 394,
    "title": "Eight charts that reveal the economic impact of Trump’s tariffs",
    "url": "https://www.aljazeera.com/economy/2025/4/9/eight-charts-that-reveal-the-economic-impact-of-trumps-tariffs",
    "source": "www.aljazeera.com",
    "description": "The tariffs have hit dozens of economies, representing the biggest disruption to global trade in decades.\n\nOn April 2, 2025, President Donald Trump declared a 10 percent tariff on all imports, effective on April 5, with additional country-specific tariffs set to commence on April 9.\n\n​The announceme...",
    "category": "Currency Exchange Rates",
    "country": "Andorra",
    "published_date": "2025-04-01"
  },
  {
    "id": 806,
    "title": "SBI cuts interest rates on select fixed deposits. Check the latest FD rates",
    "url": "https://www.moneycontrol.com/news/business/personal-finance/sbi-cuts-interest-rates-on-select-fixed-deposits-check-the-latest-fd-rates-12993457.html",
    "source": "www.moneycontrol.com",
    "description": "SBI\n\nChoose Stock Exchange: BSE LIVE NSE LIVE Volume Todays L/H More ×\n\nState Bank of India (SBI) will cut interest rates on select fixed deposits (FDs) from April 15 on. The state-backed lender has cut the rates by 10 basis points for FDs with tenures between one and three years.\n\nInterest rate for...",
    "category": "Interest Rates",
    "country": "Andorra",
    "published_date": "2025-04-01"
  },
  {
    "id": 382,
    "title": "Trump’s tariffs: the full list",
    "url": "https://www.theguardian.com/business/2025/apr/03/trumps-tariffs-the-full-list",
    "source": "www.theguardian.com",
    "description": "The president displayed the top of his list from a podium in the White House Rose Garden, and later published a longer version. Note that the “tariffs charged to the USA” in Trump’s formulation include “trade barriers” so don’t necessarily align with the tariffs published by countries concerned.",
    "category": "Trade Policy",
    "country": "Andorra",
    "published_date": "2025-04-01"
  },
  {
    "id": 383,
    "title": "Trump’s reciprocal tariffs: How much will each country be hit?",
    "url": "https://www.aljazeera.com/news/2025/4/3/trumps-reciprocal-tariffs-how-much-will-each-country-be-hit",
    "source": "www.aljazeera.com",
    "description": "New tariffs announced: US president to tax all imports into the country\n\nPresident Donald Trump on Wednesday announced a range of reciprocal tariffs targeting almost all countries that the United States trades with, taking a sledgehammer to Washington’s longstanding advocacy of free trade and global...",
    "category": "Trade Policy",
    "country": "Andorra",
    "published_date": "2025-04-01"
  }
]