[
  {
    "id": 2342,
    "title": "Hungary central bank to launch green financing programmes in 2025",
    "url": "https://timesofindia.indiatimes.com/business/international-business/hungary-central-bank-to-launch-green-financing-programmes-in-2025/articleshow/113873847.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "The National Bank of Hungary (NBH) will launch green financing programmes for households and the business sector next year, it said in a statement on Wednesday.Even after cuts totalling 1,150 basis points, Hungary's 6.5 per cent base rate is still the highest in the European Union, alongside that of...",
    "category": "Central Bank",
    "country": "Hungary",
    "published_date": "2025-12-01"
  },
  {
    "id": 2344,
    "title": "Tether Buys 116 Tonnes Gold, 60 Tonnes More in 2026",
    "url": "https://www.coingabbar.com/en/crypto-currency-news/tether-buys-gold-reserves-hit-116-tonnes-surpasses-central-banks",
    "source": "www.coingabbar.com",
    "description": "Tether Buys Gold: Surpasses Korea and Hungary, Hits 116 & 26 Ton in Q3\n\nThe swiftly growing gold acquisitions and strategic investments of Tether have redefined the demand for bullion in the year 2025 and made the issuer of stablecoins one of the largest non-central bank holders in the world, with i...",
    "category": "Central Bank",
    "country": "Hungary",
    "published_date": "2025-12-01"
  },
  {
    "id": 2345,
    "title": "Hungary central bank says credible fiscal planning needed to cut risks",
    "url": "https://www.zeebiz.com/world/news-hungary-central-bank-says-credible-fiscal-planning-needed-to-cut-risks-282023",
    "source": "www.zeebiz.com",
    "description": "Hungary's central bank warned on Thursday the 2024 budget gap could exceed the government's recently raised target of 4.5% of gross domestic product, calling for credible fiscal planning to cut market risks for central Europe's most indebted economy.\n\nEastern European Union neighbours Hungary and Ro...",
    "category": "Central Bank",
    "country": "Hungary",
    "published_date": "2025-12-01"
  },
  {
    "id": 2339,
    "title": "Russia joins more countries in issuance of yuan bonds as currency’s internationalization accelerates",
    "url": "https://www.globaltimes.cn/page/202512/1349491.shtml",
    "source": "www.globaltimes.cn",
    "description": "Chinese yuan Photo:VCG\n\nRussia's Finance Ministry will take orders on Tuesday for a two-tranche, domestically traded yuan-denominated sovereign bond sale, joining multiple countries including Hungary and Indonesia in the issuance of yuan-denominated bonds in 2025. Analysts said that the move undersc...",
    "category": "Economy",
    "country": "Hungary",
    "published_date": "2025-12-01"
  },
  {
    "id": 2333,
    "title": "Sharp rise in Hungary's deficit, inflation could harm credit rating, S&P Global says",
    "url": "https://uk.finance.yahoo.com/news/sharp-rise-hungarys-deficit-inflation-132403484.html",
    "source": "uk.finance.yahoo.com",
    "description": "By Gergely Szakacs\n\nBUDAPEST (Reuters) -A sharp rise in Hungary's budget deficit, if coupled with higher inflation and currency market pressure, could threaten ​Hungary's credit rating, S&P Global said, as public spending promises mount ‌in the run-up to a tightly contested 2026 election.\n\nFaced wit...",
    "category": "Inflation",
    "country": "Hungary",
    "published_date": "2025-12-01"
  },
  {
    "id": 2347,
    "title": "Hungary FM: Results of Hungary’s Utility Cost Cuts Scheme Are Safe",
    "url": "https://magyarnemzet.hu/english/2025/12/hungary-fm-results-of-hungarys-utility-cost-cuts-scheme-are-safe",
    "source": "magyarnemzet.hu",
    "description": "Peter Magyar Presented His Candidates\n\nThe Tisza Party’s candidates for the elections have now been announced. Peter Szijjarto disclosed that he does not personally know Peter Magyar.\n\nBut what is strange to me is that whenever I saw him in person, whenever we were in the same space, it was always a...",
    "category": "Trade Policy",
    "country": "Hungary",
    "published_date": "2025-12-01"
  },
  {
    "id": 2350,
    "title": "Hungary can’t shift its labour woes",
    "url": "https://think.ing.com/snaps/hungarys-labour-woes-dont-disappear/",
    "source": "think.ing.com",
    "description": "The latest labour market statistics from the Hungarian Central Statistical Office (HCSO) show a slight decline in the monthly unemployment rate in October, which is broadly in line with market expectations. The model estimate is 4.4%, while the official survey-based three-month moving average indica...",
    "category": "Unemployment",
    "country": "Hungary",
    "published_date": "2025-12-01"
  }
]