[
  {
    "id": 4741,
    "title": "Crypto activities legalized in Turkmenistan",
    "url": "https://www.azernews.az/region/250899.html",
    "source": "www.azernews.az",
    "description": "28 November 2025 22:23 (UTC+04:00)\n\nBy Alimat Aliyeva\n\nPresident of Turkmenistan Serdar Berdimuhamedov has signed a law legalizing cryptocurrency mining and establishing the framework for crypto exchanges in the country. Under the new legislation, all miners are required to register with the Central...",
    "category": "Central Bank",
    "country": "Turkmenistan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4735,
    "title": "Crypto News: New Country Joins The Fray; Turkmenistan Moves To Legalize Crypto Trading Next Year",
    "url": "https://www.livebitcoinnews.com/crypto-news-new-country-joins-the-fray-turkmenistan-moves-to-legalize-crypto-trading-next-year/",
    "source": "www.livebitcoinnews.com",
    "description": "Turkmenistan will legalise crypto trading and mining under strict state control in 2025, enforcing licensing, KYC, AML, and supervision.\n\nTurkmenistan plans to legalise crypto trading and mining starting from next year. President Serdar Berdimuhamedov approved a law that defines how the industry wil...",
    "category": "Economy",
    "country": "Turkmenistan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4744,
    "title": "Tokayev and Berdimuhamedov agree to boost trade turnover to one billion dollars",
    "url": "https://en.tengrinews.kz/kazakhstan_news/tokayev-and-berdimuhamedov-agree-to-boost-trade-turnover-to-270255/",
    "source": "en.tengrinews.kz",
    "description": "ПОДЕЛИТЬСЯ\n\nTengrinews.kz — Kassym-Jomart Tokayev and Serdar Berdimuhamedov held a media briefing in Astana, according to Akorda.\n\nHighlighting the significance of the Turkmen leader’s state visit, the President of Kazakhstan emphasized that brotherly Turkmenistan is an important and reliable partne...",
    "category": "Trade Policy",
    "country": "Turkmenistan",
    "published_date": "2025-11-01"
  },
  {
    "id": 4745,
    "title": "Turkmenistan Approves Law Legalizing Crypto Mining and Trading from 2026",
    "url": "https://crypto2community.com/crypto-news/turkmenistan-approves-law-legalizing-crypto-mining-and-trading-from-2026/",
    "source": "crypto2community.com",
    "description": "Cryptocurrency trading is speculative and your capital is at risk when you trade. We may earn affiliate commissions from some of the products on this page - at no extra cost to you.\n\nHighlights:\n\nTurkmenistan will allow crypto mining and trading under clear rules starting in 2026.\n\nExchanges must ge...",
    "category": "Trade Policy",
    "country": "Turkmenistan",
    "published_date": "2025-11-01"
  }
]