[
  {
    "id": 3243,
    "title": "Finance Minister Nirmala Sitharaman to embark on 6-day visit to Morocco to attend World Bank-IMF meet, G20 FMCBG",
    "url": "https://www.zeebiz.com/economy-infra/news-finance-minister-nirmala-sitharaman-to-embark-on-6-day-visit-to-morocco-to-attend-world-bank-imf-meet-g20-fmbcbg-258474",
    "source": "www.zeebiz.com",
    "description": "Finance Minister Nirmala Sitharaman will leave on a six-day official visit to Marrakech, Morocco, on Tuesday, October 10, to attend the World Bank-International Monetary Fund annual meeting, along with the G20 FMCBG (Finance Ministers and Central Bank Governors) meeting. Other than these meetings, t...",
    "category": "Central Bank",
    "country": "Morocco",
    "published_date": "2025-12-01"
  },
  {
    "id": 3254,
    "title": "How to Get the Best Exchange Rate When Traveling Abroad",
    "url": "https://www.aol.com/articles/best-exchange-rate-traveling-abroad-180416984.html",
    "source": "www.aol.com",
    "description": "Every time you spend money abroad, there's a chance you're losing some of it without realizing. Banks, ATMs, and merchants all add hidden fees or offer poor exchange rates. These small losses can add up fast, especially on longer trips. Still, there are ways to keep more of your money.\n\nThe key is t...",
    "category": "Currency Exchange Rates",
    "country": "Morocco",
    "published_date": "2025-12-01"
  },
  {
    "id": 3250,
    "title": "CATDEFI: Morocco’s Economic Reforms and Infrastructure Expansion Accelerate",
    "url": "https://www.moroccoworldnews.com/2025/12/270221/catdefi-moroccos-economic-reforms-and-infrastructure-expansion-accelerate/",
    "source": "www.moroccoworldnews.com",
    "description": "Morocco is rapidly emerging as a new hotspot for Real-World Asset (RWA) investment, driven by expanding infrastructure development, a resilient economic structure, and sustained institutional reforms. Agriculture, manufacturing, tourism, and large-scale infrastructure projects jointly support the co...",
    "category": "Economic Growth",
    "country": "Morocco",
    "published_date": "2025-12-01"
  },
  {
    "id": 3251,
    "title": "OPINION: Gauteng’s role in unlocking Africa’s growth through trade",
    "url": "https://www.sabcnews.com/sabcnews/opinion-gautengs-role-in-unlocking-africas-growth-through-trade/",
    "source": "www.sabcnews.com",
    "description": "Africa’s economic future has arrived, and Gauteng has a role in leading it.\n\nTrade among African countries is increasingly recognised as a cornerstone of sustainable economic growth. The African Continental Free Trade Area (AfCFTA) provides a transformative framework for integration, offering unprec...",
    "category": "Economic Growth",
    "country": "Morocco",
    "published_date": "2025-12-01"
  },
  {
    "id": 3232,
    "title": "Morocco’s Tourism GDP Rises by 38% in 2024, Reaching 7.3% of National Economy",
    "url": "https://www.moroccoworldnews.com/2025/12/270136/moroccos-tourism-gdp-rises-by-38-in-2024-reaching-7-3-of-national-economy/",
    "source": "www.moroccoworldnews.com",
    "description": "Rabat – Morocco’s tourism sector continued its strong recovery in 2024, with new figures from the High Commission for Planning (HCP) showing a sharp rise in the Tourism Satellite Account.\n\nThe data reveals that the tourism GDP increased by 38.4% compared to 2019, before the pandemic, reaching MAD 11...",
    "category": "GDP",
    "country": "Morocco",
    "published_date": "2025-12-01"
  },
  {
    "id": 3234,
    "title": "Chinese firms eye Morocco as way to cash in on US electric vehicle subsidies",
    "url": "https://auto.economictimes.indiatimes.com/news/industry/chinese-firms-eye-morocco-as-way-to-cash-in-on-us-electric-vehicle-subsidies/111454671",
    "source": "auto.economictimes.indiatimes.com",
    "description": "Advt\n\nAdvt\n\nJoin the community of 2M+ industry professionals. Subscribe to Newsletter to get latest insights & analysis in your inbox. All about ETAuto industry right on your smartphone! Download the ETAuto App and get the Realtime updates and Save your favourite articles.\n\nAfter the United States p...",
    "category": "Inflation",
    "country": "Morocco",
    "published_date": "2025-12-01"
  },
  {
    "id": 3246,
    "title": "Morocco and Spain Set to Meet for 13th High-Level Meeting",
    "url": "https://www.moroccoworldnews.com/2025/12/270129/morocco-and-spain-set-to-meet-for-13th-high-level-meeting/",
    "source": "www.moroccoworldnews.com",
    "description": "Rabat – Morocco and Spain are set to meet on December 3 and 4 in Madrid for their 13th High-Level Meeting preceded by the Morocco-Spain Economic Forum according to a statement from the Moroccan Prime Minister’s office.\n\nLong-held ties between Spain and Morocco\n\nThe meeting marks the continued streng...",
    "category": "Trade Policy",
    "country": "Morocco",
    "published_date": "2025-12-01"
  },
  {
    "id": 3248,
    "title": "MEPs to grill European Commission over tweaks to EU-Morocco pact",
    "url": "https://www.euractiv.com/news/meps-to-grill-european-commission-over-tweaks-to-eu-morocco-pact/",
    "source": "www.euractiv.com",
    "description": "The European Parliament’s agriculture committee is poised to confront European Commission officials on Thursday over efforts to amend the bloc’s trade deal with Morocco over the status of Western Sahara.\n\nThe meeting comes following strong objections from MEPs to the Commission’s move to tweak its p...",
    "category": "Trade Policy",
    "country": "Morocco",
    "published_date": "2025-12-01"
  }
]