[
  {
    "id": 4910,
    "title": "Rupee slips to record low as amid uncertainty over global economy, India-US trade deal",
    "url": "https://www.firstpost.com/world/rupee-slips-to-record-low-as-amid-uncertainty-over-global-economy-india-us-trade-deal-13952858.html",
    "source": "www.firstpost.com",
    "description": "The Indian rupee plunged to a fresh lifetime low on Friday amid heavy foreign outflows, uncertainty over the proposed United States–India trade deal and what traders said was a softer defence by the RBI. The steep fall left the currency as Asia’s weakest performer so far this year.\n\nThe Indian rupee...",
    "category": "Economy",
    "country": "United States",
    "published_date": "2025-11-01"
  },
  {
    "id": 4892,
    "title": "US economy latest, inflation, home prices and retail sales",
    "url": "https://edition.cnn.com/business/live-news/us-inflation-retail-sales-economy",
    "source": "edition.cnn.com",
    "description": "An aerial view of shipping containers at the Port of Baltimore in Baltimore, Maryland, on August 7. Jim Watson/AFP/Getty Images\n\nTuesday’s PPI data indicated that some firms are shielding their customers from the brunt of the steep and blunt tariffs on imported goods, wrote Samuel Tombs, chief US ec...",
    "category": "Inflation",
    "country": "United States",
    "published_date": "2025-11-01"
  },
  {
    "id": 4923,
    "title": "Former U.S. Trade Rep. Katherine Tai Says Biden Policies Marked Historic Break With Neoliberalism",
    "url": "https://www.thecrimson.com/article/2025/11/20/tai-trade-neoliberalism/",
    "source": "www.thecrimson.com",
    "description": "Former United States Trade Representative Katherine C. Tai said at a Harvard talk on Wednesday that the Biden administration set in motion a reversal of decades of neoliberal economic policy that has persisted under President Donald Trump’s second term.\n\nTai, who served for four years under Presiden...",
    "category": "Trade Policy",
    "country": "United States",
    "published_date": "2025-11-01"
  },
  {
    "id": 4935,
    "title": "Unemployment edges up to 4.4% in September while 119,000 jobs are added",
    "url": "https://www.wcvb.com/article/us-employment-rate-september/69488439",
    "source": "www.wcvb.com",
    "description": "Unemployment edges up to 4.4% in September while 119,000 jobs are added\n\nAround 7.6 million people were unemployed in September 2025, raising the unemployment rate to a four-year high of 4.4%. This is based on the monthly employment situation report by the Bureau of Labor Statistics (BLS).Related Vi...",
    "category": "Unemployment",
    "country": "United States",
    "published_date": "2025-11-01"
  },
  {
    "id": 4936,
    "title": "The Latest: September job numbers double expectations, while unemployment ticks up",
    "url": "https://www.wral.com/news/ap/914c6-the-latest-september-job-numbers-double-expectations-while-unemployment-ticks-up/",
    "source": "www.wral.com",
    "description": "U.S. employers added a surprisingly solid 119,000 jobs in September, the government said, issuing a key economic report that had been delayed for seven weeks by the federal government shutdown. The increase in payrolls was more than double the 50,000 economists had forecast.\n\nYet there were some tro...",
    "category": "Unemployment",
    "country": "United States",
    "published_date": "2025-11-01"
  }
]