[
  {
    "id": 826,
    "title": "Central Bank, UCO Bank, Punjab & Sind Bank, other PSU bank stocks rally up to 4% amid reports of merger",
    "url": "https://www.livemint.com/market/stock-market-news/central-bank-uco-bank-other-psu-banks-stocks-rally-up-to-4-amid-reports-on-merger-buzz-psu-banks-merger-11763352480781.html",
    "source": "www.livemint.com",
    "description": "PSU Banks merger news: Shares of PSU banks rose up to 4% during Monday's trading session following news that the finance ministry is drafting a strategy for the next round of mergers among public sector banks, with an announcement expected in April or May. A report from Informist indicated that thes...",
    "category": "Central Bank",
    "country": "Angola",
    "published_date": "2025-11-01"
  },
  {
    "id": 418,
    "title": "Angola Tourism Launches New Brand Identity, Expanding Their International Promotion to the UK, Spain, Poland and South Africa, Focusing on Sustainable Tourism Growth",
    "url": "https://www.travelandtourworld.com/news/article/angola-tourism-launches-new-brand-identity-expanding-their-international-promotion-to-the-uk-spain-poland-and-south-africa-focusing-on-sustainable-tourism-growth/",
    "source": "www.travelandtourworld.com",
    "description": "Angola Tourism Launches New Brand Identity, Expanding Their International Promotion to the UK, Spain, Poland and South Africa, Focusing on Sustainable Tourism Growth\n\nAngola Tourism, in association with KLEBER GROUP, is proud to present a bold new brand identity for the country’s positioning as a ma...",
    "category": "Economic Growth",
    "country": "Angola",
    "published_date": "2025-11-01"
  },
  {
    "id": 828,
    "title": "AU-EU Summit zeal for political will, peace, security, and economic development",
    "url": "https://dailynews.co.tz/au-eu-summit-zeal-for-political-will-peace-security-and-economic-development/",
    "source": "dailynews.co.tz",
    "description": "LUANDA: A zeal to strengthen strategic cooperation in peace, security, good governance, economic development, and sustainable development areas heralded the 7th Summit of Heads of State and Government of the African Union (AU) and the European Union (EU) held in Luanda, Angola.\n\nThe summit also stre...",
    "category": "Economic Growth",
    "country": "Angola",
    "published_date": "2025-11-01"
  },
  {
    "id": 407,
    "title": "Angola exposed to external shocks due to heavy debt burden – UN chief",
    "url": "https://www.plataformamedia.com/en/2025/11/26/angola-exposed-to-external-shocks-due-to-heavy-debt-burden-un-chief/",
    "source": "www.plataformamedia.com",
    "description": "At a press conference after speaking at the parliament on Monday afternoon, António Guterres said he discussed the economic situation with the Angolan president João Lourenço, whom he met during Monday morning.\n\n“I know many African countries and, as in many of them, Angola bears an excessive debt b...",
    "category": "Economy",
    "country": "Angola",
    "published_date": "2025-11-01"
  },
  {
    "id": 410,
    "title": "Angola stands on the brink of an extraordinary economic and reputational moment",
    "url": "https://africa.businessinsider.com/local/lifestyle/angola-stands-on-the-brink-of-an-extraordinary-economic-and-reputational-moment/6vkchr9",
    "source": "africa.businessinsider.com",
    "description": "Tourism, a cornerstone of Angola’s diversification strategy, is expected to see an immediate and significant uplift. The global spotlight surrounding the match has already sparked international curiosity, placing Luanda in headlines and generating a surge in demand across hotels, airlines, and local...",
    "category": "Economy",
    "country": "Angola",
    "published_date": "2025-11-01"
  },
  {
    "id": 821,
    "title": "After G20 Engagements, Shettima Heads To Angola To Represent Tinubu At AU-EU Summit",
    "url": "https://www.arise.tv/after-g20-engagements-shettima-heads-to-angola-to-represent-tinubu-at-au-eu-summit/",
    "source": "www.arise.tv",
    "description": "Following the conclusion of his engagements at the 20th summit of the G20 Leaders in South Africa, Vice President Kashim Shettima on Sunday departed Johannesburg, South Africa for Luanda to represent President Bola Tinubu at the AU-EU Summit in the Angolan capital.\n\nThe Vice President, according to ...",
    "category": "Economy",
    "country": "Angola",
    "published_date": "2025-11-01"
  },
  {
    "id": 822,
    "title": "Why Angola is looking beyond its borders to lead continental change",
    "url": "https://www.cnn.com/sponsor/angola-ministry-of-communications/angola-is-looking-beyond-its-borders-to-lead-continental-change",
    "source": "www.cnn.com",
    "description": "As Angola marks half a century of independence, President João Lourenço takes the helm of the African Union with a program to build the “Africa We Want.”\n\nA continental mission\n\nFounded in 1999, the African Union (AU) unites 55 countries under a shared mission of unity, equality, justice, and dignit...",
    "category": "Economy",
    "country": "Angola",
    "published_date": "2025-11-01"
  },
  {
    "id": 401,
    "title": "Nigeria joins Ghana, Angola, Zambia as October inflation falls to near 4-year low",
    "url": "https://financeinafrica.com/news/nigeria-october-inflation-near-4-year-low/",
    "source": "financeinafrica.com",
    "description": "Nigeria’s headline inflation rate fell for the seventh consecutive month in October 2025, dropping to 16.05%, according to the Consumer Price Index (CPI) report released by the National Bureau of Statistics (NBS) on Monday.\n\nThis is the lowest reading since March 2022, down from 18.02% year-on-year ...",
    "category": "Inflation",
    "country": "Angola",
    "published_date": "2025-11-01"
  }
]