[
  {
    "id": 4816,
    "title": "Prime Minister Carney secures new agreements with the United Arab Emirates to expand trade and attract new investment into Canada",
    "url": "https://www.pm.gc.ca/en/news/news-releases/2025/11/21/prime-minister-carney-secures-new-agreements-united-arab-emirates",
    "source": "www.pm.gc.ca",
    "description": "The world is more dangerous and divided. The scale and speed of recent trade shifts and technological developments mean that Canada’s economic strategy must change dramatically. Canada’s new government is on a mission to double non-U.S. exports over the next decade and unleash $1 trillion in new inv...",
    "category": "Economy",
    "country": "United Arab Emirates",
    "published_date": "2025-11-01"
  },
  {
    "id": 4807,
    "title": "India, UAE move closer on easing visa policies, extradition and legal assistance",
    "url": "https://www.firstpost.com/india/india-uae-move-closer-on-easing-visa-policies-extradition-and-legal-assistance-ws-e-13954343.html",
    "source": "www.firstpost.com",
    "description": "India and the United Arab Emirates on Wednesday made progress in liberaling visa policies for travel between the two countries.\n\nIndia and the United Arab Emirates on Wednesday made progress on easing visa rules for travel between the two countries. The matter was a central focus during the meeting ...",
    "category": "GDP",
    "country": "United Arab Emirates",
    "published_date": "2025-11-01"
  },
  {
    "id": 4829,
    "title": "Carney meets top UAE investors, launches trade talks with Emirates",
    "url": "https://www.theglobeandmail.com/politics/article-carney-united-arab-emirates-uae-investors-trade-talks/",
    "source": "www.theglobeandmail.com",
    "description": "Open this photo in gallery: UAE President Sheikh Mohamed bin Zayed Al Nahyan, right, receives Prime Minister Mark Carney before a meeting at Al Shati Palace in Abu Dhabi, on Thursday.Ryan Carter / UAE Presidential C/Reuters\n\nPrime Minister Mark Carney pitched Canada to heavyweight investors during a...",
    "category": "Trade Policy",
    "country": "United Arab Emirates",
    "published_date": "2025-11-01"
  }
]