[
  {
    "id": 3909,
    "title": "Rwanda maintains MPR at 6.75%",
    "url": "https://www.cnbcafrica.com/media/7763649463919/rwanda-maintains-mpr-at-675",
    "source": "www.cnbcafrica.com",
    "description": "Rwanda’s Central Bank has decided to maintain its key lending rate at 6.75% during its final Monetary Policy Committee (MPC) meeting for the year 2025, confirming the expectations of market analysts. The decision comes as inflationary pressures appear to be within manageable levels, and the economy ...",
    "category": "Central Bank",
    "country": "Rwanda",
    "published_date": "2025-11-01"
  },
  {
    "id": 3913,
    "title": "Hakuziyaremye: Rwanda’s currency outlook for 2026 remains stable despite global volatility",
    "url": "https://www.cnbcafrica.com/media/7763652076366/hakuziyaremye-rwandas-currency-outlook-for-2026-remains-stable-despite-global-volatility",
    "source": "www.cnbcafrica.com",
    "description": "Rwanda's Central Bank Governor, Soraya Munyana Hakuziyaremye, conveyed a reassuring message about the prospective stability of the Rwandan Franc forecasted for 2026, despite prevailing global economic uncertainties. In a recent broadcast discussion, she elaborated on how the monetary policies instit...",
    "category": "Currency Exchange Rates",
    "country": "Rwanda",
    "published_date": "2025-11-01"
  },
  {
    "id": 3905,
    "title": "Rwanda eyes $1B digital foreign direct investment to boost economy, innovation",
    "url": "https://www.biometricupdate.com/202511/rwanda-eyes-1b-digital-foreign-direct-investment-to-boost-economy-innovation",
    "source": "www.biometricupdate.com",
    "description": "The Rwandan government attracted about $819 million in digital Direct Foreign Investment (DFI) between 2013 and 2023, but it hopes to rake in over $1 billion by 2035 to strengthen the nation’s digital economy and innovation drive.\n\nDetails about this ambition were unveiled recently at the launch of ...",
    "category": "Economy",
    "country": "Rwanda",
    "published_date": "2025-11-01"
  },
  {
    "id": 3906,
    "title": "Qatar and Rwanda: Strategic integration toward sustainable future",
    "url": "https://www.gulf-times.com/article/715475/qatar/qatar-and-rwanda-strategic-integration-toward-sustainable-future",
    "source": "www.gulf-times.com",
    "description": "Relations between Qatar and Rwanda have been marked by rapid growth and a strategic partnership spanning various development fields. Over the past years, the two nations have succeeded in building a solid foundation of cooperation in the areas of economy, investment, education, tourism, aviation, se...",
    "category": "Economy",
    "country": "Rwanda",
    "published_date": "2025-11-01"
  },
  {
    "id": 3904,
    "title": "Rwanda: Green Economy Week - UN Pledges Robust Support for Rwanda's Accelerated Green Economy Agenda",
    "url": "https://allafrica.com/stories/202511280197.html",
    "source": "allafrica.com",
    "description": "The United Nations (UN) has pledged deeper cooperation with Rwanda as the country advances an ambitious shift towards a green and climate-resilient economy, a vision that has gained renewed momentum following announcements made at COP30 in Belem, Brazil.\n\nUN Resident Coordinator in Rwanda, Ozonnia O...",
    "category": "Fiscal Policy",
    "country": "Rwanda",
    "published_date": "2025-11-01"
  }
]