[
  {
    "id": 1174,
    "title": "G20 FMs, central bank governors to discuss MDBs, crypto and global economy",
    "url": "https://www.financialexpress.com/policy/economy-g20-fms-central-bank-governors-to-discuss-mdbs-crypto-and-global-economy-3267782/",
    "source": "www.financialexpress.com",
    "description": "Finance Minister Nirmala Sitharaman will chair the fourth G20 Finance Ministers and Central Bank Governors (FMCBG) meeting in Marrakech (Morocco) later this week to discuss strengthening Multilateral Development Banks (MDBs), the global economy and crypto assets agenda.\n\nSitharaman will leave for Ma...",
    "category": "Central Bank",
    "country": "Benin",
    "published_date": "2025-12-01"
  },
  {
    "id": 1181,
    "title": "Banks from 30 countries open accounts with Indian banks for local currency trade",
    "url": "https://www.financialexpress.com/business/banking-finance-banks-from-30-countries-open-accounts-with-indian-banks-for-local-currency-trade-3741688/",
    "source": "www.financialexpress.com",
    "description": "After the Reserve Bank of India (RBI) allowed in invoicing and payment of international trade transactions in rupees and other local currencies, 123 correspondent banks from 30 trading partners have opened special accounts in India to facilitate these transactions, minister of state for commerce and...",
    "category": "Currency Exchange Rates",
    "country": "Benin",
    "published_date": "2025-12-01"
  },
  {
    "id": 1178,
    "title": "Africa HealthTech Bootcamp Opens in Benin With Focus on Regulation and Startup Growth",
    "url": "https://www.ecofinagency.com/news-digital/2011-50669-africa-healthtech-bootcamp-opens-in-benin-with-focus-on-regulation-and-startup-growth",
    "source": "www.ecofinagency.com",
    "description": "News Digital\n\nMTN Innovation Lab hosts Africa HealthTech Export 2025 Bootcamp in Cotonou\n\n\n\nEvent targets startup growth amid falling investment but high sector potential\n\n\n\nExperts stress need for clear regulation and better access to digital health tools\n\n\n\nThe MTN Innovation Lab in Cotonou opened...",
    "category": "Economic Growth",
    "country": "Benin",
    "published_date": "2025-12-01"
  },
  {
    "id": 1172,
    "title": "AfDF Approves $28m to Boost Benin’s Private Sector, SEZ Growth and Governance",
    "url": "https://www.devdiscourse.com/article/business/3710546-afdf-approves-28m-to-boost-benins-private-sector-sez-growth-and-governance",
    "source": "www.devdiscourse.com",
    "description": "The Board of Directors of the African Development Fund (AfDF) has approved US$28 million in additional financing to support the third phase of Benin’s Economic Governance and Private Sector Development Support Programme (PAGE-DSP). The funding, endorsed on 24 November 2025, will scale up ongoing ref...",
    "category": "Economy",
    "country": "Benin",
    "published_date": "2025-12-01"
  },
  {
    "id": 1165,
    "title": "Benin Cuts 2026 Digital Budget but Prioritizes AI, Broadband Rollout",
    "url": "https://www.ecofinagency.com/news-digital/2811-50954-benin-cuts-2026-digital-budget-but-prioritizes-ai-broadband-rollout",
    "source": "www.ecofinagency.com",
    "description": "News Digital\n\nBenin proposes $48M 2026 digital budget, down 6.3% from 2025\n\nFunds target AI integration, broadband expansion, and media modernization\n\nPlans include digital skills training and SMART GOUV administrative platform rollout\n\n\n\nBenin's Minister of Digitalization and Digital Affairs, Aurél...",
    "category": "GDP",
    "country": "Benin",
    "published_date": "2025-12-01"
  },
  {
    "id": 1166,
    "title": "Inflation News: Relief Expected For Your Wallet This Year – Prices Likely To Fall",
    "url": "https://www.freepressjournal.in/business/inflation-news-relief-expected-for-your-wallet-this-year-prices-likely-to-fall",
    "source": "www.freepressjournal.in",
    "description": "Symbolic image |\n\nAccording to a new World Bank report, food prices may drop by around 7 per cent in 2025. The steepest decline is expected in grain prices, which could fall by up to 11 per cent.\n\nRice Prices to See Sharpest Drop\n\nThe biggest reason for this overall decline is the anticipated 29 per...",
    "category": "Inflation",
    "country": "Benin",
    "published_date": "2025-12-01"
  },
  {
    "id": 1176,
    "title": "India-US mini trade deal tomorrow? Report says agreement with 10% tariffs finalised ahead of Trump deadline",
    "url": "https://www.financialexpress.com/policy/economy-india-us-mini-trade-deal-tomorrow-report-says-agreement-with-10-tariffs-finalised-ahead-of-trump-deadline-3904752/",
    "source": "www.financialexpress.com",
    "description": "The India-US trade deal may be finalised by Monday — ahead of the July 9 deadline outlined by President Donald Trump. Source-based reports suggest that a mini agreement with average tariffs around 10% is likely to be announced within the next 24 to 48 hours. The update came even as the POTUS readied...",
    "category": "Trade Policy",
    "country": "Benin",
    "published_date": "2025-12-01"
  },
  {
    "id": 1179,
    "title": "Benin’s Labor Force Participation Hits 75.68% in 2024, Yet Most Jobs Remain Informal",
    "url": "https://www.ecofinagency.com/news-services/0112-50989-benin-s-labor-force-participation-hits-75-68-in-2024-yet-most-jobs-remain-informal",
    "source": "www.ecofinagency.com",
    "description": "News Services\n\nBenin’s labor force participation hit 75.68% in 2024, among region’s highest\n\n\n\nOver 90% of jobs are informal, with low pay and no protections\n\n\n\nHigh participation reflects survival work, not strong job market conditions\n\nAbout 75.68 percent of Beninese aged 15 and over were in the l...",
    "category": "Unemployment",
    "country": "Benin",
    "published_date": "2025-12-01"
  }
]