[
  {
    "id": 2324,
    "title": "Guyana: A Primer on a Strategic U.S. Caribbean & South American Ally",
    "url": "https://www.jdsupra.com/legalnews/guyana-a-primer-on-a-strategic-u-s-8821612/",
    "source": "www.jdsupra.com",
    "description": "Welcome to the first of our five-part blog series about Guyana, an American ally that has emerged as one of the fastest-growing economies in the world, driven by an oil boom that has transformed the country’s economic trajectory.[1] Positioned as a key source of revenue for ExxonMobil and its partne...",
    "category": "Economic Growth",
    "country": "Guyana",
    "published_date": "2025-12-01"
  },
  {
    "id": 2313,
    "title": "Guyana could supply vessels, other support to expanding oil and gas operations",
    "url": "https://guyanachronicle.com/2025/12/01/guyana-could-supply-vessels-other-support-to-expanding-oil-and-gas-operations/",
    "source": "guyanachronicle.com",
    "description": "–President Ali says, urges formation of consortiums to find mechanisms to drive logistical investments\n\nPRESIDENT Dr. Irfaan Ali is urging local private sector players to maximise the opportunities available in providing supply vessels and other support to Guyana’s expanding oil and gas sector.\n\nSpe...",
    "category": "Economy",
    "country": "Guyana",
    "published_date": "2025-12-01"
  },
  {
    "id": 2314,
    "title": "‘Guyana’s private sector now more innovative, driven, results-focused and highly motivated’ -President Ali says",
    "url": "https://guyanachronicle.com/2025/12/01/guyanas-private-sector-now-more-innovative-driven-results-focused-and-highly-motivated-president-ali-says/",
    "source": "guyanachronicle.com",
    "description": "RECOGNISING the scale of Guyana’s economic transformation, the local private sector is now adopting new technologies, fostering innovation, and moving from a culture of complaints to one centred on results, complementing the People’s Progressive Party/ Civic (PPP/C) government’s vison of building a ...",
    "category": "Economy",
    "country": "Guyana",
    "published_date": "2025-12-01"
  },
  {
    "id": 2318,
    "title": "Guyana is world’s most booming economy and is set to grow 38% this year",
    "url": "https://timesofindia.indiatimes.com/business/international-business/guyana-is-worlds-most-booming-economy-and-is-set-to-grow-38-this-year/articleshow/103604682.cms",
    "source": "timesofindia.indiatimes.com",
    "description": "The oil deposits are so large relative to Guyana’s population of 800,000 that some projections show the nation overtaking Kuwait to become the world’s largest per-capita crude producer.\n\nGuyana ’s economy will expand 38% this year as a wave of oil wealth transforms the South American nation, the Int...",
    "category": "Economy",
    "country": "Guyana",
    "published_date": "2025-12-01"
  }
]