[
  {
    "id": 2508,
    "title": "Israel-Iran News LIVE: Trump claims Iran reaching out to US for negotiations, Tehran refutes",
    "url": "https://www.livemint.com/news/world/israel-iran-war-attack-news-today-live-updates-g7-summit-trump-missile-drone-attack-netanyahu-ayatollah-khamenei-dead-11750132275793.html",
    "source": "www.livemint.com",
    "description": "Israel Iran News LIVE: Intense Israeli airstrikes struck Tehran early Wednesday as the conflict escalated, with a Washington-based human rights organization reporting significant casualties across Iran.\n\nAccording to Human Rights Activists, at least 585 people have been killed and 1,326 injured in t...",
    "category": "Central Bank",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2510,
    "title": "‘Conduit that funnels billions…’: Israel declares Iran’s Central Bank a terrorist organisation",
    "url": "https://www.businesstoday.in/world/middle-east/story/conduit-that-funnels-billions-israel-declares-irans-central-bank-a-terrorist-organisation-481766-2025-06-25",
    "source": "www.businesstoday.in",
    "description": "Israel has declared Iran’s Central Bank a terrorist organisation, accused it of being a conduit for terrorism. It said no regime element that is involved in terrorism has immunity, it said. This comes after Iran executed three men, accusing them of being spies for Israel. Meanwhile, the ceasefire be...",
    "category": "Central Bank",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2518,
    "title": "Premature to conclude but geopolitical turmoil could risk global growth for several years, says CEA Anantha Nageswaran",
    "url": "https://www.moneycontrol.com/news/business/economy/premature-to-conclude-but-geopolitical-turmoil-could-risk-global-growth-for-several-years-says-cea-anantha-nageswaran-13137962.html",
    "source": "www.moneycontrol.com",
    "description": "The CEA added that conflicts and disruptions on the global scene have been around since 2022 but have become more intense and unpredictable, which makes the overall environment - political, economic or militarily - more difficult for growth.\n\nThe ongoing geopolitical turmoil in various parts of the ...",
    "category": "Economic Growth",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2521,
    "title": "Iran-Israel War: US urges China to stop Iran from shutting Strait of Hormuz - 'economic suicide for them'",
    "url": "https://www.livemint.com/news/us-news/iran-israel-war-us-urges-china-to-stop-iran-from-shutting-strait-of-hormuz-economic-suicide-for-them-11750638929198.html",
    "source": "www.livemint.com",
    "description": "Iran-Israel War: US Secretary of State Marco Rubio has called on China to encourage Iran not to shut down the Strait of Hormuz after Washington carried out strikes on Iranian nuclear sites.\n\nRubio's remarks came after Iran's Press TV reported that the Islamic Republic's parliament has approved the m...",
    "category": "Economic Growth",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2522,
    "title": "'Economic suicide': US on possible Strait of Hormuz closure by Iran",
    "url": "https://www.hindustantimes.com/world-news/us-warns-iran-against-closing-strait-of-hormuz-its-economic-suicide-101750616425309.html",
    "source": "www.hindustantimes.com",
    "description": "US Secretary of State Marco Rubio on Sunday reacted to reports claiming that the Iranian parliament has approved a measure to close the Strait of Hormuz, saying that it would be an “economic suicide”. US Secretary of State Marco Rubio at the State Department in Washington, DC on June 20, 2025. (AFP)...",
    "category": "Economic Growth",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2502,
    "title": "How Israel-Iran conflict is likely to inflate global oil prices? EXPLAINED",
    "url": "https://www.livemint.com/economy/how-israel-iran-conflict-is-likely-to-inflate-global-oil-prices-explained-ali-khamenei-crude-oil-war-11750607282436.html",
    "source": "www.livemint.com",
    "description": "The conflict raging between Israel and Iran on Sunday, 22 June 2025, took an escalating turn as the US entered the war after conducting an airstrike on three nuclear sites of Iran. These heightened tensions are likely to inflate the global oil prices in case Tehran decides to retaliate against Ameri...",
    "category": "Economy",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2503,
    "title": "Iran shutting Hormuz Strait will impact Indian economy: Experts",
    "url": "https://www.rediff.com/news/report/with-us-strikes-iran-israel-war-enters-decisive-phase/20250622.htm",
    "source": "www.rediff.com",
    "description": "The Israel-Iran conflict has entered a 'decisive phase' after the United States bombed three major Iranian nuclear sites Sunday morning, feel strategic affairs experts with some of them arguing it was Washington, DC's 'responsibility' to not get involved in the military standoff.\n\nIMAGE: A poster of...",
    "category": "Economy",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2504,
    "title": "Israel-Iran conflict effect? India ramps up crude oil imports from Russia, US in June 2025",
    "url": "https://www.livemint.com/economy/israel-iran-conflict-effect-india-ramps-up-crude-oil-imports-from-russia-us-in-june-2025-11750588304615.html",
    "source": "www.livemint.com",
    "description": "India increased its crude oil purchases from Russia and the United States in June 2025, amid the ongoing Israel-Iran conflict, reported the news agency PTI. Union Oil Minister on Sunday said that India has diversified its supplies, and the majority of oil imports for the nation do not come through t...",
    "category": "Economy",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2487,
    "title": "U.S. Attack on Iran Injects Uncertainty Into an Already Uncertain Economy",
    "url": "https://www.hindustantimes.com/world-news/us-attack-on-iran-injects-uncertainty-into-an-already-uncertain-economy-101750763731382.html",
    "source": "www.hindustantimes.com",
    "description": "Gasoline prices could be affected depending how the oil market reacts. The U.S. bombing of Iran and direct involvement in Israel’s conflict has added a fresh dose of uncertainty to a U.S. economic picture that was already looking pretty muddled.\n\nRecent gyrations in policy and global events have lef...",
    "category": "GDP",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2490,
    "title": "Global news wrap: Israel-Iran conflict, US student visas, global growth, rising temperature",
    "url": "https://www.livemint.com/news/world/israeliran-conflict-oil-prices-us-student-visas-global-growth-world-bank-forecast-india-gdp-recession-rising-heat-11750823464427.html",
    "source": "www.livemint.com",
    "description": "Every month, Mint ’s Plain Facts section brings out an update on key global developments. The accompanying analysis and charts explain how each story is creating ripples on the global stage, where it is headed in the coming weeks, and whether it can impact India.\n\nOil’s well\n\nGlobal crude oil prices...",
    "category": "GDP",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2512,
    "title": "Indian stock market: 8 key things that changed for market overnight- Gift Nifty, Israel-Iran war to China interest rates",
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-8-key-things-that-changed-for-market-overnight-gift-nifty-israel-iran-war-to-china-interest-rates-11750358227269.html",
    "source": "www.livemint.com",
    "description": "Indian stock market: The domestic equity market indices, Sensex and Nifty 50, are expected to see a muted opening on Friday, amid mixed cues from global markets.\n\nAsian markets traded mostly higher, while the US stock market was closed, and US stock futures dropped on cautiousness over the escalatin...",
    "category": "Interest Rates",
    "country": "Iran",
    "published_date": "2025-06-01"
  },
  {
    "id": 2515,
    "title": "Gold, Silver Rates Today: Precious metals fall on MCX amid Iran-Israel ceasefire | Check city-wise rates",
    "url": "https://www.indiatvnews.com/business/markets/mcx-gold-price-today-24-carat-10-gram-delhi-citywise-silver-on-june-25-comex-2025-06-24-995975",
    "source": "www.indiatvnews.com",
    "description": "Gold, Silver Rates Today: Precious metals fall on MCX amid Iran-Israel ceasefire | Check city-wise rates Gold, Silver Prices Today, Gold MCX Rate: In the international market, the COMEX gold price fell 1.47 per cent to trade at around $3,345.2 per troy ounce. The spot gold price at 11:20 am was arou...",
    "category": "Interest Rates",
    "country": "Iran",
    "published_date": "2025-06-01"
  }
]