[
  {
    "id": 3123,
    "title": "Trump nuclear: Testing can forever scar a nation. Just ask the Marshall Islands",
    "url": "https://edition.cnn.com/2025/11/04/asia/nuclear-testing-marshall-islands-legacy-intl-hnk-dst",
    "source": "edition.cnn.com",
    "description": "President Donald Trump’s call for the United States to resume testing of nuclear weapons last week has experts scratching their heads.\n\nWhat did he really mean – exploding a warhead or testing delivery systems? Does he understand how nuclear weapons work? How will US nuclear adversaries react?\n\nAnd ...",
    "category": "Economy",
    "country": "Marshall Islands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3115,
    "title": "Marshall Islands introduces world's first crypto-based universal income scheme",
    "url": "https://www.rnz.co.nz/international/pacific-news/580187/marshall-islands-introduces-world-s-first-crypto-based-universal-income-scheme",
    "source": "www.rnz.co.nz",
    "description": "Photo: CFOTO / NurPhoto via AFP\n\nThe Marshall Islands is giving away free cash to its more than 33,000 citizens.\n\nThe government announced its universal basic income (UBI) system on Wednesday, with blockchain as its main mode of delivery.\n\nIt marks the first system of its kind in the world, where ea...",
    "category": "GDP",
    "country": "Marshall Islands",
    "published_date": "2025-11-01"
  },
  {
    "id": 3129,
    "title": "Iran Seizes Marshall Islands-Flagged Tanker in Strait of Hormuz Amid Escalating Tensions",
    "url": "https://ijr.com/iran-seizes-marshall-islands-flagged-tanker-in-strait-of-hormuz-amid-escalating-tensions/",
    "source": "ijr.com",
    "description": "A Marshall Islands-flagged oil tanker transiting the Strait of Hormuz was seized by Iranian forces on Friday, marking the first such interdiction in months in one of the world’s most critical shipping lanes.\n\nAccording to The Associated Press, a U.S. defense official said the tanker, named the Talar...",
    "category": "Trade Policy",
    "country": "Marshall Islands",
    "published_date": "2025-11-01"
  }
]