[
  {
    "id": 3177,
    "title": "Mexico’s star economy dreams crumble under Donald Trump’s tariff threats",
    "url": "https://www.moneycontrol.com/world/mexico-s-star-economy-dreams-crumble-under-donald-trump-s-tariff-threats-article-12955076.html",
    "source": "www.moneycontrol.com",
    "description": "The Maya Train line in Campeche.\n\nOnly a couple years ago, manufacturers were fighting for space to relocate their operations to Monterrey, an industrial city in Mexico’s northeast, as they sought to move closer to the US and its vast consumer market. These days, real estate agents are offering flex...",
    "category": "Economy",
    "country": "Mexico",
    "published_date": "2025-03-01"
  },
  {
    "id": 3178,
    "title": "Tariff news Highlights: Countdown begins for Trump tariffs on Canada, Mexico; Piyush Goyal flies to Washinton, China prepares retaliation",
    "url": "https://www.moneycontrol.com/news/business/donald-trump-tariffs-live-updates-canada-mexico-import-news-ipo-gmp-balaji-phosphates-ipo-news-today-madhabi-puri-buch-sebi-gold-silver-price-on-march-3-live-updates-liveblog-12954397.html",
    "source": "www.moneycontrol.com",
    "description": "Xi prepares to unveil China stimulus plan as trade war heats up\n\nPresident Xi Jinping heads into China’s biggest political huddle of the year with his economy finally getting back some swagger. Donald Trump’s rising tariffs will test Beijing’s ability to sustain that momentum. Breakthroughs in artif...",
    "category": "Economy",
    "country": "Mexico",
    "published_date": "2025-03-01"
  },
  {
    "id": 3170,
    "title": "Trump confirms Canada, Mexico tariffs; Wall Street slumps",
    "url": "https://www.thehindubusinessline.com/news/world/trump-25-percent-tariffs-mexico-canada-imports-no-delays/article69287603.ece",
    "source": "www.thehindubusinessline.com",
    "description": "President Donald Trump said Monday that 25 per cent taxes on imports from Mexico and Canada would start Tuesday, sparking renewed fears of a North American trade war that already showed signs of pushing up inflation and hindering growth.\n\n“Tomorrow - tariffs 25% on Canada and 25% on Mexico. And that...",
    "category": "Inflation",
    "country": "Mexico",
    "published_date": "2025-03-01"
  },
  {
    "id": 3188,
    "title": "Trade war: Mexico holds fire on Donald Trump's steel tariffs; will wait until April, says President Claudia Sheinbaum",
    "url": "https://www.livemint.com/news/world/trade-war-mexico-not-to-retaliate-against-us-steel-tariffs-until-april-says-president-claudia-sheinbaum-11741794379301.html",
    "source": "www.livemint.com",
    "description": "Mexico President Claudia Sheinbaum said on Wednesday her country will not immediately retaliate against steel and aluminum tariffs imposed by US President Donald Trump.\n\nThe Mexican government will wait until April, when Trump has pledged to impose separate reciprocal tariffs, to see if it needs to ...",
    "category": "Trade Policy",
    "country": "Mexico",
    "published_date": "2025-03-01"
  },
  {
    "id": 3190,
    "title": "Trump tariffs: US trade war draws swift retaliation with new tariffs from Mexico, Canada, China",
    "url": "https://www.thehindu.com/news/international/trumps-trade-war-draws-swift-retaliation-with-new-tariffs-from-mexico-canada-china/article69291936.ece",
    "source": "www.thehindu.com",
    "description": "President Donald Trump launched a trade war Tuesday (March 4, 2025) against America’s three biggest trading partners, drawing immediate retaliation from Mexico, Canada and China and sending financial markets into a tailspin as the U.S. faced the threat of rekindled inflation and paralyzing uncertain...",
    "category": "Trade Policy",
    "country": "Mexico",
    "published_date": "2025-03-01"
  }
]