[
  {
    "id": 2721,
    "title": "Japan’s Nikkei Stock Adds to Weekly Gain with Eyes on Central Bank Meetings (UPDATE 1)",
    "url": "https://japannews.yomiuri.co.jp/news-services/reuters/20251128-295273/",
    "source": "japannews.yomiuri.co.jp",
    "description": "Yomiuri Shimbun file photo\n\nThe Tokyo Stock Exchange\n\nTOKYO, Nov 28 (Reuters) – Japan’s Nikkei share average added to a weekly advance on Friday as investor attention turned towards major central bank decisions next month.\n\nThe Nikkei 225 index .N225 swayed between gains and losses before closing up...",
    "category": "Central Bank",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2722,
    "title": "Rate Hikes Wouldn't Put Brakes on Japan's Economy, BOJ's Ueda Says",
    "url": "https://www.morningstar.com/news/dow-jones/202511301112/rate-hikes-wouldnt-put-brakes-on-japans-economy-bojs-ueda-says",
    "source": "www.morningstar.com",
    "description": "By Megumi Fujikawa\n\nThe Bank of Japan will thoroughly discuss the possibility of an interest-rate increase at its upcoming meeting, Gov. Kazuo Ueda said, stoking hopes that it could resume monetary tightening this year.\n\nThe central bank will pay special attention to the outlook for wage increases, ...",
    "category": "Central Bank",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2742,
    "title": "Yen rises as Japan ramps up intervention warning, signalling chance of near-term rate hike",
    "url": "https://www.straitstimes.com/business/companies-markets/japan-signalls-chance-of-currency-intervention-yen-rises",
    "source": "www.straitstimes.com",
    "description": "Sign up now: Get ST's newsletters delivered to your inbox\n\nFinance Minister Satsuki Katayama gave Japan's strongest warning to date against recent falls in the yen.\n\n- Japan on Nov 21 escalated its warning of currency intervention and the central bank governor signalled the chance of a near-term int...",
    "category": "Currency Exchange Rates",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2745,
    "title": "Asia’s currency-defence war chest has swelled to $8 trillion",
    "url": "https://www.moneycontrol.com/news/currency/asias-currency-defence-war-chest-has-swelled-to-8-trillion-13687111.html",
    "source": "www.moneycontrol.com",
    "description": "The Indian rupee and Philippine peso have both set record lows over the past two months, while the South Korean won is near the weakest level in 16 years\n\nAsia’s foreign-exchange reserves have surged to almost $8 trillion, providing the authorities from Tokyo to Mumbai with ample ammunition if they ...",
    "category": "Currency Exchange Rates",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2734,
    "title": "Japan Identifies Food Tech Priority Sector in Upcoming National Growth Strategy",
    "url": "https://www.greenqueen.com.hk/japan-growth-strategy-headquarters-council-food-tech/",
    "source": "www.greenqueen.com.hk",
    "description": "4 Mins Read\n\nUnder Japan’s new prime minister, Sanae Takaichi, the list of economic growth priorities includes a focus on food tech and synthetic biology.\n\nAfter decades of growth driven by the private sector, Japan’s government is taking charge of its economic future.\n\nThis month, the administratio...",
    "category": "Economic Growth",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2707,
    "title": "Japan's cabinet approves lavish stimulus as markets fret over Takaichi's fiscal policy",
    "url": "https://www.thehindu.com/news/international/japans-cabinet-approves-lavish-stimulus-as-markets-fret-over-takaichis-fiscal-policy/article70306736.ece",
    "source": "www.thehindu.com",
    "description": "Japanese Prime Minister Sanae Takaichi’s cabinet approved a ¥21.3 trillion ($135.40 billion) economic stimulus package on Friday (November 21, 2025), marking the first major policy initiative under the new leader, who has pledged to pursue expansionary fiscal measures.\n\nThe package includes general ...",
    "category": "Fiscal Policy",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2710,
    "title": "Japan PM Takaichi’s personal touch on social media draws bouquets, brickbats",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/11/30/japan-pm-takaichis-personal-touch-on-social-media-draws-bouquets-brickbats",
    "source": "www.thestar.com.my",
    "description": "TOKYO (Japan News/ANN): Japanese Prime Minister Sanae Takaichi’s active presence on social media has captured the public’s interest, and while her honest and humorous posts draw people in, they pose the risk of online backlash.\n\nTakaichi posts daily on social media using her own words, with topics r...",
    "category": "Fiscal Policy",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2712,
    "title": "Fiscal Consolidation Targets: Present Path That Can Strike Balance with Economic Growth",
    "url": "https://japannews.yomiuri.co.jp/editorial/yomiuri-editorial/20251117-293240/",
    "source": "japannews.yomiuri.co.jp",
    "description": "The administration of Prime Minister Sanae Takaichi has started discussions on economic measures with a government panel that includes new members who advocate proactive fiscal policies. It must advance measures that will strike a balance between fiscal consolidation and economic growth.\n\nAfter the ...",
    "category": "Fiscal Policy",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2688,
    "title": "Japan GDP Down Annualized 1.8% in July-Sept.",
    "url": "https://japannews.yomiuri.co.jp/business/economy/20251117-293123/",
    "source": "japannews.yomiuri.co.jp",
    "description": "Yomiuri Shimbun file photo\n\nThe Bank of Japan\n\nTOKYO — Japan’s gross domestic product in July-September shrank at an annualized rate of 1.8% after price and seasonal adjustment, contracting for the first time in six quarters, the Cabinet Office said in a preliminary report Monday.\n\nThe reading repre...",
    "category": "GDP",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2692,
    "title": "Japan’s economy contracts for first time in six quarters on tariff hit",
    "url": "https://www.thedailystar.net/business/news/japans-economy-contracts-first-time-six-quarters-tariff-hit-4037506",
    "source": "www.thedailystar.net",
    "description": "A store staff member tries to attract customers outside a shop in Tokyo. As the overall contraction was not as acute as expected, it likely represents a temporary setback rather than the start of a recession, economists said. Photo: REUTERS/file\n\nJapan's economy shrank almost 2 percent in the three ...",
    "category": "GDP",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2693,
    "title": "GDP Contraction: Overseas Risks Should Be Assessed Carefully",
    "url": "https://japannews.yomiuri.co.jp/editorial/yomiuri-editorial/20251118-293404/",
    "source": "japannews.yomiuri.co.jp",
    "description": "Japan’s economy, which had been on a gradual recovery path, has contracted for the first time in six quarters. It is crucial to carefully assess overseas risk factors and realize an economy that is driven by domestic demand.\n\nThe preliminary estimate for real gross domestic product in the July-Septe...",
    "category": "GDP",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2696,
    "title": "Japan approves $135 billion stimulus to mitigate inflation pain",
    "url": "https://www.moneycontrol.com/news/business/japan-approves-135-billion-stimulus-to-mitigate-inflation-pain-13689393.html",
    "source": "www.moneycontrol.com",
    "description": "The sizable allocation for price relief highlights Japanese Prime Minister Sanae Takaichi’s commitment to tackling persistent inflation, which has fueled voter frustration and contributed to the ouster of her predecessors\n\nJapanese Prime Minister Sanae Takaichi’s cabinet approved the largest round o...",
    "category": "Inflation",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2697,
    "title": "Japan's inflation rate rises as Takaichi prepares to announce major stimulus package",
    "url": "https://www.firstpost.com/world/japans-inflation-rate-rises-as-takaichi-prepares-to-announce-major-stimulus-package-13952622.html",
    "source": "www.firstpost.com",
    "description": "Japan’s inflation rate rose in October, official data showed Friday ahead of the expected announcement of a major stimulus package by Prime Minister Sanae Takaichi’s government.\n\nJapan's Prime Minister Sanae Takaichi tastes a persimmon after receiving a courtesy visit from the \"Nara Persimmon PR Lad...",
    "category": "Inflation",
    "country": "Japan",
    "published_date": "2025-11-01"
  },
  {
    "id": 2731,
    "title": "Crypto News: Robert Kiyosaki Warns Japan Ending Carry Trade May Crash Global Markets",
    "url": "https://www.livebitcoinnews.com/crypto-news-robert-kiyosaki-warns-japan-ending-carry-trade-may-crash-global-markets/",
    "source": "www.livebitcoinnews.com",
    "description": "Robert Kiyosaki warns Japan’s carry trade end may trigger a global crash and urges investment in energy, metals, Bitcoin, and Ethereum.\n\nRobert Kiyosaki, author of Rich Dad Poor Dad, has issued a warning that Japan’s decision to end its 30-year carry trade could trigger a global financial downturn.\n...",
    "category": "Trade Policy",
    "country": "Japan",
    "published_date": "2025-11-01"
  }
]