[
  {
    "id": 2473,
    "title": "Donald Trump teases Indonesia trade deal after tariff threats: ‘Details to follow’",
    "url": "https://www.livemint.com/news/donald-trump-teases-indonesia-trade-deal-after-tariff-threats-details-to-follow-11752594410133.html",
    "source": "www.livemint.com",
    "description": "US President Donald Trump said on Tuesday he has reached a trade agreement with Indonesia, just a week after threatening to slap the Southeast Asian nation with steep tariffs. However, the President provided no details on the deal’s scope or terms.\n\n“Great deal, for everybody, just made with Indones...",
    "category": "Trade Policy",
    "country": "Indonesia",
    "published_date": "2025-07-01"
  },
  {
    "id": 2477,
    "title": "Something similar with India, says Donald Trump after trade deal with Indonesia sealed",
    "url": "https://www.hindustantimes.com/world-news/something-similar-with-india-says-donald-trump-after-trade-deal-with-indonesia-sealed-101752681534979.html",
    "source": "www.hindustantimes.com",
    "description": "WASHINGTON DC: US President Donald Trump said on Tuesday that he believes Washington will conclude a trade deal with India similar to the agreement reached with Indonesia, offering the clearest indication yet of his expectations for the ongoing trade negotiations. U.S. President Donald Trump speaks ...",
    "category": "Trade Policy",
    "country": "Indonesia",
    "published_date": "2025-07-01"
  },
  {
    "id": 2479,
    "title": "‘India trade deal to be along same lines as Indonesia-US trade deal,' says Donald Trump",
    "url": "https://www.moneycontrol.com/world/india-trade-deal-to-be-along-similar-lines-as-indonesia-says-donald-trump-article-13283238.html",
    "source": "www.moneycontrol.com",
    "description": "He also said pharmaceutical tariffs may be coming by the end of the month\n\nUS President Donald Trump on July 15 said India is moving in the same direction as Indonesia when it comes to opening up trade access for the United States, adding that he believes 'we’re going to have access to India.'\n\nSpea...",
    "category": "Trade Policy",
    "country": "Indonesia",
    "published_date": "2025-07-01"
  }
]