[
  {
    "id": 128,
    "title": "Does the fate of the US economy now hinge on one company?",
    "url": "https://www.vox.com/podcasts/470729/ai-economy-nvidia-bubble-data-centers-stock-market",
    "source": "www.vox.com",
    "description": "As the price of almost everything has increased, and American workers’ wages have all but stalled, politicians like President Donald Trump have tried to ease our minds by telling us that the economy is “doing great” and that the stock market is booming. “Record high, record high, record high,” Trump...",
    "category": "Economy",
    "country": "Global",
    "published_date": "2025-11-29"
  },
  {
    "id": 130,
    "title": "Black Friday shoppers spent billions despite wider economic uncertainty",
    "url": "https://www.nbcnews.com/business/economy/black-friday-shoppers-spent-billions-rcna246456",
    "source": "www.nbcnews.com",
    "description": "Despite wider economic uncertainty hovering above this year’s holiday season, shoppers turned out in big numbers for Black Friday — spending billions of dollars both in stores and online.\n\nAdobe Analytics, which tracks e-commerce, said U.S. consumers spent a record $11.8 billion online Friday, marki...",
    "category": "Economy",
    "country": "Global",
    "published_date": "2025-11-29"
  },
  {
    "id": 120,
    "title": "K-shaped economy and inflation boost Black Friday sales by 4.1% from last year, online spending jumps 9.1%",
    "url": "https://www.cnn.com/2025/11/29/business/black-friday-us-econony-spending",
    "source": "www.cnn.com",
    "description": "US retail sales on Black Friday, the busiest shopping day of the year, climbed 4.1% compared with last year, according to data released Saturday by Mastercard SpendingPulse. Online shoppers alone spent $11.8 billion, up 9.1% from 2024, according to data collection platform Adobe Analytics.\n\nBut thos...",
    "category": "Inflation",
    "country": "Global",
    "published_date": "2025-11-29"
  },
  {
    "id": 122,
    "title": "Euro-Zone Inflation Near 2% to Seal Deal on ECB Rate Hold",
    "url": "https://www.bloomberg.com/news/articles/2025-11-29/euro-zone-inflation-near-2-to-seal-deal-on-ecb-rate-hold",
    "source": "www.bloomberg.com",
    "description": "A euro-zone inflation reading that’s likely to stay close to 2% should be enough to satisfy officials that they can avoid tweaking interest rates in December.\n\nConsumer prices probably rose 2.1% in November from a year earlier, according to the median of 29 forecasts in a Bloomberg survey ahead of T...",
    "category": "Inflation",
    "country": "Global",
    "published_date": "2025-11-29"
  },
  {
    "id": 141,
    "title": "California Unemployment Benefits: What is CalJobs and how can it help me find a job?",
    "url": "https://www.marca.com/en/lifestyle/us-news/personal-finance/2025/11/29/692b62ef46163f66448b4582.html",
    "source": "www.marca.com",
    "description": "If you can't find a job when you go out looking for one, CalJobs is an option.\n\nIf you can't find a job when you go out looking for one, CalJobs is an option.\n\nIf you are unemployed and do not find many job offers when you leave home to look for them, use your computer or mobile phone to search with...",
    "category": "Unemployment",
    "country": "Global",
    "published_date": "2025-11-29"
  },
  {
    "id": 142,
    "title": "Unemployment claims in California increased last week",
    "url": "https://www.recordnet.com/story/news/2025/11/29/unemployment-numbers/87495257007/",
    "source": "www.recordnet.com",
    "description": "Staff reports\n\nUSA TODAY Network\n\nInitial filings for unemployment benefits in California rose last week compared with the week prior, the U.S. Department of Labor said Thursday.\n\nNew jobless claims, a proxy for layoffs, increased to 53,708 in the week ending November 21, up from 45,489 the week bef...",
    "category": "Unemployment",
    "country": "Global",
    "published_date": "2025-11-29"
  }
]