[
  {
    "id": 4722,
    "title": "Turkish consumer confidence edges up on rate-cut expectations--China Economic Net",
    "url": "http://en.ce.cn/main/latest/202511/t20251128_2607903.shtml",
    "source": "en.ce.cn",
    "description": "ANKARA, Nov. 27 (Xinhua) -- Turkish consumers are heading into the final month of 2025 with a slightly more positive outlook on their finances, as sentiment indicators edge higher ahead of an expected Central Bank rate cut in December.\n\nThe Turkish Statistical Institute reported on Thursday that its...",
    "category": "Central Bank",
    "country": "Turkey",
    "published_date": "2025-11-01"
  },
  {
    "id": 4727,
    "title": "A Tale of Two Nations: Comparing Greek and Turkish Strategies in Combating Low Birth Rates",
    "url": "https://greekreporter.com/2025/11/24/greek-turkish-strategies-low-birth-rates/",
    "source": "greekreporter.com",
    "description": "Greece and Turkey, two neighbors separated by the Aegean, find themselves united by a shared existential threat: a rapidly falling birth rate and an aging population.\n\nWhile both nations acknowledge the crisis, which threatens future economic growth and social security, their rhetorical and policy a...",
    "category": "Economic Growth",
    "country": "Turkey",
    "published_date": "2025-11-01"
  },
  {
    "id": 4711,
    "title": "The factors influencing turkey prices this Thanksgiving",
    "url": "https://www.pbs.org/newshour/show/the-factors-influencing-turkey-prices-this-thanksgiving",
    "source": "www.pbs.org",
    "description": "Inflation, tariffs and bird flu are all playing a role in how much you'll be paying for your holiday meal this year. PBS News digital video producer Tim McPhillips spoke with a food economist to break down the costs.\n\nNotice: Transcripts are machine and human generated and lightly edited for accurac...",
    "category": "Inflation",
    "country": "Turkey",
    "published_date": "2025-11-01"
  },
  {
    "id": 4728,
    "title": "Mass struggles against rising unemployment in Turkey",
    "url": "https://www.wsws.org/en/articles/2025/11/20/eskz-n20.html",
    "source": "www.wsws.org",
    "description": "Three million people in Turkey are officially unemployed, a rate of 8.5 percent that remains unchanged since the second quarter of the year, according to Labor Force Statistics from the Turkish Statistical Institute (TurkStat).\n\nThe official unemployment rate was 9.2 percent in the third quarter of ...",
    "category": "Unemployment",
    "country": "Turkey",
    "published_date": "2025-11-01"
  }
]