[
  {
    "id": 3111,
    "title": "Central Bank Reports Show How Many Maltese Are Leaving Traditional Jobs",
    "url": "https://lovinmalta.com/news/central-bank-reports-show-how-many-maltese-are-leaving-traditional-jobs/",
    "source": "lovinmalta.com",
    "description": "A look at the change in sectoral employment between 2013 and 2023 is where things get interesting.\n\nWhile foreign workers account for almost three-quarters of that increase, the number of Maltese in employment rose from 171,036 to 201,008 – largely due to more pensioners and women deciding to land a...",
    "category": "Central Bank",
    "country": "Malta",
    "published_date": "2025-11-01"
  },
  {
    "id": 3113,
    "title": "EU expects Malta to maintain strong economic growth",
    "url": "https://timesofmalta.com/article/eu-expects-malta-maintain-strong-economic-growth.1119706",
    "source": "timesofmalta.com",
    "description": "Malta's economy is expected to sustain strong growth in 2025, driven by robust domestic consumption and tourism, the European Commission said in its autumn forecast on Monday.\n\nEconomic growth by Malta is expected to reach 4.0% in 2025, moderating to 3.8% in 2026 and 3.5% in 2027. Inflation is proje...",
    "category": "Economic Growth",
    "country": "Malta",
    "published_date": "2025-11-01"
  },
  {
    "id": 3109,
    "title": "Microtek Medical Malta to close down; government and GWU offer support to workers losing their jobs",
    "url": "https://www.independent.com.mt/articles/2025-11-28/local-news/Microtek-Medical-Malta-to-close-down-government-offers-support-to-workers-losing-their-job-6736285210",
    "source": "www.independent.com.mt",
    "description": "Economy Minister Silvio Schembri has announced that following the news that Microtek Medical Malta Ltd will close, resulting in 96 workers losing their jobs, the government is collaborating with the General Workers’ Union (GWU) to help these workers find new employment.\n\nThe Economy Minister declare...",
    "category": "Economy",
    "country": "Malta",
    "published_date": "2025-11-01"
  },
  {
    "id": 3107,
    "title": "Government’s financial mismanagement has driven Malta into a dead end, PN says",
    "url": "https://www.independent.com.mt/articles/2025-11-27/local-news/Government-s-financial-mismanagement-has-driven-Malta-into-a-dead-end-PN-says-6736285152",
    "source": "www.independent.com.mt",
    "description": "The financial mismanagement of Robert Abela's Government - which has severely missed its own fiscal targets and burdened the country with record levels of debt - has driven Malta into a dead end, the Natiomalist Party said Thursday.\n\nAfter the Labour Government ignored repeated warnings by the PN an...",
    "category": "Fiscal Policy",
    "country": "Malta",
    "published_date": "2025-11-01"
  },
  {
    "id": 3102,
    "title": "Malta’s Traffic To Cost €917 Million By 2030, New Master Plan Warns",
    "url": "https://lovinmalta.com/news/maltas-traffic-to-cost-e917-million-by-2030-new-master-plan-warns/",
    "source": "lovinmalta.com",
    "description": "Traffic congestion is expected to cost Malta €770 million in 2025, climbing to €917 million by 2030, according to the newly published National Transport Master Plan 2030. The document, released for public consultation earlier this month, paints a stark picture of worsening travel times and escalatin...",
    "category": "GDP",
    "country": "Malta",
    "published_date": "2025-11-01"
  }
]