[
  {
    "id": 1920,
    "title": "Russia buys bananas from India after Ecuador military hardware spat",
    "url": "https://www.zeebiz.com/economy-infra/news-russia-buys-bananas-from-india-after-ecuador-military-hardware-spat-275414",
    "source": "www.zeebiz.com",
    "description": "Russia buys bananas from India after Ecuador military hardware spat\n\nReuters Written By\n\nRussia's trade ties with India have deepened since 2022, when Western countries imposed sanctions on Moscow over its invasion of Ukraine, forcing it to seek greater trade with China, India and other non-Western ...",
    "category": "Economy",
    "country": "Ecuador",
    "published_date": "2025-12-01"
  },
  {
    "id": 1923,
    "title": "Trump administration says it has trade frameworks with Argentina, Ecuador, El Salvador and Guatemala",
    "url": "https://ca.news.yahoo.com/trump-administration-says-trade-frameworks-224539533.html",
    "source": "ca.news.yahoo.com",
    "description": "WASHINGTON (AP) — The Trump administration said Thursday that it had reached trade frameworks with Argentina, Ecuador, El Salvador and Guatemala.\n\nThe frameworks are about increasing the ability of U.S. firms to sell industrial and agricultural products in these countries, according to a senior admi...",
    "category": "Trade Policy",
    "country": "Ecuador",
    "published_date": "2025-12-01"
  },
  {
    "id": 1924,
    "title": "U.S. Strikes New Trade Frameworks with Argentina, Ecuador, Guatemala & El Salvador - Targeted Tariff Relief and Strategic Signals for the Hemisphere",
    "url": "https://www.jdsupra.com/legalnews/u-s-strikes-new-trade-frameworks-with-6882409/",
    "source": "www.jdsupra.com",
    "description": "On Nov. 13, 2025, the White House announced a series of new trade framework agreements with Argentina, Ecuador, Guatemala, and El Salvador, representing the Trump Administration’s most active trade engagement in the Western Hemisphere this year. These arrangements include select tariff reductions, n...",
    "category": "Trade Policy",
    "country": "Ecuador",
    "published_date": "2025-12-01"
  }
]