[
  {
    "id": 1548,
    "title": "Chad criticized for failure to address herder-farmer clashes amid climate crisis",
    "url": "https://www.jurist.org/news/2025/11/chad-criticized-for-failure-to-address-herder-farmer-clashes-amid-climate-crisis/",
    "source": "www.jurist.org",
    "description": "Amnesty International on Thursday denounced Chad authorities for their failure to protect victims of armed clashes between herders and farmers.\n\nThe group documented seven instances of herder-farmer violence in four provinces between 2022 and 2024, which resulted in 98 people dead, at least 100 inju...",
    "category": "Economic Growth",
    "country": "Chad",
    "published_date": "2025-12-01"
  },
  {
    "id": 5131,
    "title": "Hormel’s Chad Randick joins Minnesota Chamber Board of Directors",
    "url": "https://www.austindailyherald.com/news/hormels-chad-randick-joins-minnesota-chamber-board-of-directors-e0466a63",
    "source": "www.austindailyherald.com",
    "description": "The Minnesota Chamber of Commerce announced Wednesday that Hormel Vice President Government Affairs, Chad Randick, has been appointed to their Board of Directors.\n\n“We are so grateful to have Chad join our Board,” said Doug Loon, president and CEO of the Minnesota Chamber of Commerce in a press rele...",
    "category": "Economic Growth",
    "country": "Chad",
    "published_date": "2025-12-01"
  },
  {
    "id": 1543,
    "title": "Egypt aims to double trade exchange with Chad: El-Khatib",
    "url": "https://www.zawya.com/en/economy/north-africa/egypt-aims-to-double-trade-exchange-with-chad-el-khatib-qmk5iyca",
    "source": "www.zawya.com",
    "description": "Arab Finance: Egypt is seeking to double the volume of bilateral trade with Chad, which currently stands at approximately $35 million annually, Minister of Investment and Foreign Trade Hassan El-Khatib said.\n\nDuring his participation in the expanded ministerial talks of the Egyptian-Chadian Joint Co...",
    "category": "Trade Policy",
    "country": "Chad",
    "published_date": "2025-12-01"
  }
]