[
  {
    "id": 132,
    "title": "Russia’s central bank forced to sell gold reserves to cover budget, support ruble",
    "url": "https://www.kitco.com/news/article/2025-11-28/russias-central-bank-forced-sell-gold-reserves-cover-budget-support-ruble",
    "source": "www.kitco.com",
    "description": "Ernest Hoffman Ernest Hoffman is a Crypto and Market Reporter for Kitco News. He has over 15 years of experience as a writer, editor, broadcaster and producer for media, educational and cultural organizations. Ernest began working in market news in 2007, establishing the broadcast division of CEP Ne...",
    "category": "Central Bank",
    "country": "Global",
    "published_date": "2025-11-28"
  },
  {
    "id": 118,
    "title": "Goldman Sees China Spat Weighing on Japan’s GDP Via Tourism Hit",
    "url": "https://www.bloomberg.com/news/articles/2025-11-28/goldman-sees-china-spat-weighing-on-japan-s-gdp-via-tourism-hit",
    "source": "www.bloomberg.com",
    "description": "Rising tensions with China may shave about 0.2 percentage point off Japan’s gross domestic product growth if tourism and the export of consumer goods to the world’s second-largest economy decline, according to economists at Goldman Sachs Group Inc.\n\nThe analysts base their calculations on the fallou...",
    "category": "GDP",
    "country": "Global",
    "published_date": "2025-11-28"
  },
  {
    "id": 119,
    "title": "Black Friday kicks off as inflation-burned shoppers scour for deals",
    "url": "https://www.washingtonpost.com/business/2025/11/28/black-friday-inflation-shoppers-deals/",
    "source": "www.washingtonpost.com",
    "description": "PLANO, Texas — Black Friday is well underway, with retailers splashing their websites and storefronts with markdowns meant as a reprieve for inflation-fatigued customers who are looking to save on things like pantry and toiletry staples, jackets, makeup and gaming consoles. But the parking lots outs...",
    "category": "Inflation",
    "country": "Global",
    "published_date": "2025-11-28"
  },
  {
    "id": 123,
    "title": "Asia-Pacific stocks trade mixed as Tokyo inflation runs hotter than expected",
    "url": "https://www.cnbc.com/2025/11/28/asia-markets-live.html",
    "source": "www.cnbc.com",
    "description": "Pedestrians walking across a crowded traffic at Shibuya crossing square in Tokyo, Japan. Jaczhou | E+ | Getty Images\n\nAsia-Pacific markets traded mixed Friday as U.S. stock futures stayed flat over Thanksgiving Day, leaving the Nasdaq Composite on track to end a seven-month winning streak. Traders i...",
    "category": "Inflation",
    "country": "Global",
    "published_date": "2025-11-28"
  },
  {
    "id": 134,
    "title": "This Is Why Credit Card Interest Rates Are so High",
    "url": "https://www.bloomberg.com/news/articles/2025-11-28/this-is-why-credit-card-interest-rates-are-so-high",
    "source": "www.bloomberg.com",
    "description": "Listen to Odd Lots on Apple Podcasts\n\nListen to Odd Lots on Spotify\n\nWatch Odd Lots on YouTube\n\nSubscribe to the newsletter\n\nSome people pay off their credit cards at the end of each month. They use the cards as a payment method and collect points and rewards, and never have to pay any interest. For...",
    "category": "Interest Rates",
    "country": "Global",
    "published_date": "2025-11-28"
  },
  {
    "id": 138,
    "title": "Influence of Trade Policy on Maritime Shipping Dynamics",
    "url": "https://maritimefairtrade.org/influence-of-trade-policy-on-maritime-shipping-dynamics/",
    "source": "maritimefairtrade.org",
    "description": "The second term of U.S. President Donald Trump has been marked by a transformative tariff policy that is reshaping international trade and shipping dynamics. Following “Liberation Day” on April 2, 2025, the administration enacted significant tariffs, raising the effective U.S. tariff rate to its hig...",
    "category": "Trade Policy",
    "country": "Global",
    "published_date": "2025-11-28"
  }
]